[
    {
        "area": "Web Application, Navigation Information Platform",
        "description": "TMT Project aims to deliver a public Information System which would generate on request a national Multi-Modal Public Transport Travel Itinerary that will guide commuters from their point of origin to their desired destination within the Republic of Ireland. It aims to integrate as many Irish public transport companies as possible, then offer routing and access to this public IS from all web-compatible devices like smartphones, tablet PCs, laptops, desktops etc TMT Project received collaboration & support from: Department of Transport Ireland; Former Minister for Transport Mr Noel Dempsey TD; National Transport Authority; Transport 21 office; Dublin Chamber of Commerce; Irish Rail, Eirebus/Urbus and Dublin Bikes; IBM Ireland; DCU. Presentation website: www.tmtproject.eu Blog and history tracking: www.tmtproject.info TMT Project web address: www.tmtproject.net Note: Due to the massive scale and complexity of TMT Project's architecture, only a proof of concept will be demonstrated in the presentation.",
        "platform": "Multi-platform",
        "programme": "Information Systems",
        "students": [
            {
                "email": "bernaso2@computing.dcu.ie",
                "name": "Ovidiu Bernaschi"
            }
        ],
        "supervisor": "Dr. Martin Crane",
        "technology": "Google Maps Javascript API V3, Sencha Ext JS, MySQL, PHP",
        "title": "TMT Project (Take Me There) - MultiModal National Public Transport Information System"
    },
    {
        "area": "Web Application, Online Compilation and Deployment",
        "description": "The 'World-Wide-Mind' is a project which enables the construction of large, collaborative, multi-author, 'Society-of-Mind' systems in Artifi cial Intelligence (AI). It can also be used as a generic platform on which to pose software problems, whether related to AI or not, and develop and rank solutions to those problems. Software problems, in terms of the World-Wide-Mind, are constructed as subclasses of the 'World' class, which is defi ned in the World-Wide-Mind programming interface. Solutions to problems are constructed as subclasses of the 'Mind' class, which is also defi ned in the World-Wide-Mind programming interface. Minds are written for specifi c Worlds, against which they are run by users, and then graded automatically. Currently, in order to develop Worlds and Minds, a user of the WorldWide-Mind system must download the World-Wide-Mind programming interface as a 'jar' fi le. The user must also have the Java Virtual Machine (JVM) and the Java Development Kit (JDK) installed on their development system. Once Worlds and Minds are developed and tested off-line, they can be uploaded to the World-Wide-Mind server and run in a live environment. The primary intent of this project is to eliminate the requirement to have anything pre-installed on a user's development system (other than a browser with an Internet connection) in order to develop Worlds and Minds for the World-Wide-Mind system, and in doing so, make it easier to develop Worlds and Minds for the World-Wide-Mind project.",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "john.pendlebury2@mail.dcu.ie",
                "name": "John Pendlebury"
            }
        ],
        "supervisor": "Dr. Mark Humphries",
        "technology": "PHP, JavaScript",
        "title": "Making it Easy to Create Worlds for the World Wide Mind"
    },
    {
        "area": "Compilers, None",
        "description": "C2MIPS64 is a compiler for a subset of the C programming language. This compiler will be composed of a collection of different components which together will analyse the input program and produce an output program. There are four stages in the compiler: Lexical Analysis, Syntax Analysis, Semantic Analysis and Code Generation. At each stage of the analysis an intermediate representation of the source program is generated, this is passed through the compiler phases, with the fi nal stage using this representation to generate the target code. The target code is aimed at the WINMIPS64 simulator developed by Prof. Michael Scott. The project may be utilised by students who wish to learn how a high-level language is mapped to a low level language. It would be benefi cial to any student who is currently undertaking an Assembly Language or Computer Architecture course at the undergraduate level. The execution of the target code in the WINMIPS64 environment will allow students to associate the C code to the corresponding MIPS64 code. The compiler will be created using the C programming language and will be completely platform independent. However, the generated code will only run on a Windows XP / Vista or 7 platform, where WINMIPS64 is solely supported. The aim of this project is to deliver a system which can take a source program as input, written using a subset of the C programming language, and translate it into a target program, written in the MIPS64 language. This target language will then be executable on the WINMIPS64 simulator.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "ross.haugh2@mail.dcu.ie",
                "name": "Ross Haugh"
            }
        ],
        "supervisor": "Prof. Mike Scott",
        "technology": "C/C++, MIPS64",
        "title": "C2MIPS64"
    },
    {
        "area": "Software Development, None",
        "description": "The MIErp is a web-based Enterprise Resource Planning (ERP) application for the most common types of web browsers such as Firefox, Internet Explorer (IE), Safari, Opera and Google Chrome. MIErp is based on a common database and has modular software design with the data for the various business functions integrated in real-time. It has been developed for small and mid-size businesses. The application integrates data and functions of different departments into a unifi ed process in the company. With ERP, all elements of the delivery, fi nancial and production chains can be easily accessed by the user who requires the information and data. Each user has a different level of access to the data. This leads to effi ciency in customer management and perceived company effectiveness in delivering on customer expectations. Also, the ERP system helps to save in relation to energy consumption and data management. Having an ERP system in place implies having a single hardware system to handle the different requirements, translating into reduced power consumption operating off a single database which translates into savings on storage. The savings generated from a minimum of hardware and storage, coupled with operational effi ciencies created from a single system across all departments, translates into measurable profi t for the company.",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "irina.urunbaeva2@mail.dcu.ie",
                "name": "Irina Urunbaeva"
            }
        ],
        "supervisor": "Dr. Monica Ward",
        "technology": "Java, JSP/Servlets",
        "title": "MIErp"
    },
    {
        "area": "Gaming, None",
        "description": "Chess Vision Chess Vision is a tutorial introduction to the game of chess. It gives a beginner chess player an understanding of how the pieces move. The program also provides an insight into playing the game by providing sample board positions and requiring the player to accomplish a specifi c task. Chess Vision is focused mainly to cater for people who have never played chess before. This includes adults however the main focus group is children. The game must be able to hold their interest and accomplish the task of teaching the basics of chess. The code will be written in Java. Game play 1. How the pieces move. A black and a white piece is placed on the board. The player's piece must take the opposing piece in a single move. King - Take a piece exercise. Flee exercise. Queen - Take a piece. Bishop - Take a piece. Knight - Take a piece. Rook - Take a piece. Swap with King. Pawn - Take a piece. Make it across the board. 2. Identify threats. At the start there are three pieces on the board, a player's king and two opposing pieces. The player must identify which opposing piece can take the player's king in its next move. As the player progresses, the number of opposing pieces increases as well as the number of near misses increases. 3. Escaping threats. Sample positions are taken from a database. The player's king will be in check. The player must get out of check. As the game progresses, more diffi cult positions are generated.",
        "platform": "Windows",
        "programme": "Information Systems",
        "students": [
            {
                "email": "richard.ennos2@mail.dcu.ie",
                "name": "Richard Ennos"
            }
        ],
        "supervisor": "Dr. Stephen Blott",
        "technology": "Java, None",
        "title": "Chess Vision"
    },
    {
        "area": "Web Application, None",
        "description": "PlayBook is a web application for American football coaches that provide an intuitive interface for drawing up, annotating and animating American football plays. As it stands today, the American football playbook has not evolved much beyond static 'x's and o's' drawn on paper, or in MS Paint. With PlayBook, I am dragging that staid format into the 21st century, making it more expressive and more engaging - both for the players who must spend hours studying and for the coaches who spend even longer designing and refi ning their tactics. PlayBook will allow a coach to quickly and easily sketch his plays, highlight players, create notes, and when done, click one button to animate the fi nished play. This play can then be shared with only those players or assistant coaches who are approved for access, giving those people a much more dynamic, informative view of the play, right there in their browser - also a greener way to share an often-thick playbook!",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "rory.okeeffe5@mail.dcu.ie",
                "name": "Rory O'Keeffe"
            }
        ],
        "supervisor": "Mr. Charlie Daly",
        "technology": "JavaScript, HTML",
        "title": "PlayBook"
    },
    {
        "area": "Image/Video Processing, Digital Signal Processing",
        "description": "One of the biggest problems in digital media is unauthorised use of digital image content. It is very diffi cult to prevent theft of digital images so at least there should be a way to prove the ownership of the content. One way of doing so is to embed an invisible watermark into an image. The application will enable the user to embed a watermark on the his/her digital image for copyright protection. The user will be able to prove the ownership of an image by extracting the watermark. This watermark will be invisible and therefore the image will stay the same as before the modifi cation. The watermark in itself will be unique to each user and should withstand the intentional attacks or the usual image manipulations such as cropping, fi ltering etc. The software will support most common of image fi le formats such as jpeg, png, gif etc. This application will help owners of digital content such as image fi les to prove the ownership by 'stamping' a unique logo,code or name onto the picture. The watermark is invisible and unauthorised user will not be aware of the watermark unless a special software is used, even then it will be extremely diffi cult to fully remove the watermark from the image without distorting the image. This software will serve as a copyright protection tool for a user. This tool can be used by any user who wants to protect the ownership rights to their digital image content and have a secure way to prove and prevent future disputes.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "mykhaylo.zakharenkov2@mail.dcu.ie",
                "name": "Michael Zakharenkov"
            }
        ],
        "supervisor": "Dr. David Sinclair",
        "technology": "Java, None",
        "title": "Image Protect"
    },
    {
        "area": "Databases, Network Applications",
        "description": "Conran Pharmacy Management System (CPMS) is designed to facilitate all of the day to day tasks and operations of a Pharmacy department. Its layout and features were designed carefully, with close consultation with relevant industry professionals, to insure that each of the physical processes involved were complimented by the system and, where possible, expedited. This specifi c application is designed to be used in a hospital scenario as it caters for such fi elds as patient's ward and consultant etc. However, it could be easily converted for use in a community pharmacy setting. Main user functions provided by CPMS: dispensing and recording of medicines to patients, setup and editing of patients on the system, viewing of patients medication history, handling of all ordering for the department for the purposes of inventory management and order-list generation for suppliers. CPMS can also handle a wide range of requests and services which, in a Healthcare scenario, would be beneficial to have all available from a single system (eg. Generation of BMI (Body Mass Index), BSA (Body Surface Area) (both used in drug dosage), as well as other drug information inquiries). This system has been designed from a user point of view as I have over 5 years experience of working within the industry. CPMS complies with current regulations set by the Pharmaceutical Society of Ireland that govern such applications. The application incorporates a high level of security to insure patient data protection, and also has built in administrative rights features to limit personnel access with the aim of safeguarding content, and has features currently not employed on any other system of its type that are in use within the health sector.",
        "platform": "Windows",
        "programme": "Information Systems",
        "students": [
            {
                "email": "stephen.conran@mail.dcu.ie",
                "name": "Steve Conran"
            }
        ],
        "supervisor": "Dr. Martin Crane",
        "technology": "Java, SQL",
        "title": "Pharmacy Management System"
    },
    {
        "area": "3-D Modelling, Gaming",
        "description": "This project provides the fundamental engine, physics and technology for a 'free- Running' 3D adventure game for the touch-screen and accelerometer enabled Windows Phone 7 platform. Users can explore the world, fi nd pieces of text and try to piece together what happened before they arrived. It experiments with the interesting idea of rather than creating a typical 3D landscape of drawn shapes using a 3D modeller, instead building a world out of cubes, reminiscent of voxels, from different materials: grass, cement, brick, dirt and so on. As such the game world has a distinct look, and can be more readily dynamic than most commercial games. The player can also download and rate new levels made by other users, or use the inbuilt level creator to make their own and share them with the world. They have the ability to place messages, notes, diaries or any kind of imaginative pieces of text in the world for users to fi nd, so as to tell their own individual stories.",
        "platform": "Windows Phone 7",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "polmacaoidh@gmail.com",
                "name": "Paul McGee"
            }
        ],
        "supervisor": "Dr. Martin Crane",
        "technology": "C#, XNA",
        "title": "3D Block Engine, Level Creation & Sharing for Mobile, Touch Screen Device"
    },
    {
        "area": "Web Application, None",
        "description": "The Google Calendar Application is designed to allow the user (students of DCU) to synchronise their DCU timetable with their calendar account. They will then be able to receive SMS alerts about any upcoming lectures/ tutorials etc. Google already provide this service. Lecturers will also be able to create events for particular class groups, which will be synchronized to the students calendar once they update it. It is designed to work on any browser.",
        "platform": "Multi-platform",
        "programme": "Information Systems",
        "students": [
            {
                "email": "danmcm88@gmail.com",
                "name": "Daniel McMahon"
            }
        ],
        "supervisor": "Mr. Ray Walshe",
        "technology": "Java, XML",
        "title": "Google Calendar Application"
    },
    {
        "area": "Web Application, None",
        "description": "The objective of this project is to create an online resource for users to design their own BPMN (Business Process Modelling Notation) Diagrams, and graphically manipulate them to suit a system they are trying to model. Following a user's completion of a diagram, the user will be able to save their progress and return to it at another point in time, as well as download the diagram in the form of an image fi le or a .PDF document. Aside from this, and most practically, the diagram alternatively can be analysed, and processed into a BPMN Standardised XML format structured representation of that diagram, which could be used by users and professionals for their own needs. The project is designed to be an easy to use professional tool for developers and other users to use. All types of BPMN items have been included to the designer so it is possible for a user to complete and entire thorough BPMN process model. Throughout the development process there has been signifi cant user involvement to gauge what was wanted from the target users, in order to satisfy client functional requirements. As this is a web application the idea is for the project to be able to anyone online, accessible on any modern web browser.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "alan.crowley5@mail.dcu.ie",
                "name": "Alan Crowley"
            }
        ],
        "supervisor": "Dr. Markus Helfert",
        "technology": "JavaScript, Java",
        "title": "DiagramDesigner"
    },
    {
        "area": "Web Application, Artifi cial Intelligence",
        "description": "Project Spy is a web based project management application designed to assist software development companies. The application is presented through .aspx web pages with c# code behind which allow the user to easily interact with the system. Project Spy is used to allow managers to manage staff and projects. It has an estimation system which gives the manager estimates on the duration and cost of the project before it is created. All data from previous projects will be recorded in a mysql database. This data is used to create the estimations. Managers are able to interact with staff through the system giving them their job specifi cation. Managers are also able to evaluate staff based on a review system associate with them. This will allow managers to assess both the progress of their staff and of their projects. The staff will use the web application to fi nd out what projects they are assigned to and what work they have to do. The application uses a simple, intuitive design so that it is simple for even non-technical people to use.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "aidan.greene23@mail.dcu.ie",
                "name": "Aidan Greene"
            }
        ],
        "supervisor": "Dr. Claus Pahl",
        "technology": ".NET, C#",
        "title": "Project Spy"
    },
    {
        "area": "Software Development, Mobile App",
        "description": "The overall intention of this project is to establish a taxonomy for developing mobile applications, outlining a framework and a high-level overview of the mobile application development process across Android and iOS operating systems. The methods and feasibility of doing are also justifi ed - using the standard development means of Android Java and XCode/Objective-C, and alternatives such as HTML, CSS and JavaScript with PhoneGap. As the major players of the mobile OS world solidify their positions in both the development community and the marketplace, there has been an increase in demand for the implementation of different applications on mobile/handheld devices. Should an application be developed natively, non-natively, or as a web Application. Which platform would be more suitable to implement on. This project examines and elaborates on a few of those options in an organised, well presented manner. Key areas this project looks into are: outlining the processes, identifying the tools and exploring the platforms in relation to developing applications for mobile operating systems. Three applications have been developed for this project - a multi-feature music gig/event mapping application one for each individual OS and one cross-platform application to examine multi-platform application development. From these, a comparative, taxonomic view is derived, which compares and contrasts the options available to both developers and management interested in the nuances between the different mobile operating systems available today.",
        "platform": "iPhone, Android",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "sean.ofl aherty6@mail.dcu.ie",
                "name": "Sean O'Flaherty"
            }
        ],
        "supervisor": "Mr. Brian Stone",
        "technology": "XCode, Java",
        "title": "Taxonomic Comparative Mobile Application Framework."
    },
    {
        "area": "Software Development, None",
        "description": "It is this project's objective to write the most useful ports to UNIX of user land commands from Plan 9 in the new Go language to form a robust base for future UNIX-like user lands that do not suffer from the vulnerabilities that are common in C or C++ code. For example, since Go incorporates a Garbage Collector as well as safe types and memory, this eliminates the problem of buffer overfl ows attacks, which are one of the biggest problems with programs written in C and C++. Many of these programs are very similar to the UNIX programs with the same name, other are to be found only on Plan 9. Others again share only the name, but have a different behaviour. These commands would work with a variety of UNIX and UNIX-like operating systems in much the same way the current set of user land commands do.",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "seamus.ronan3@mail.dcu.ie",
                "name": "Seamus Ronan"
            }
        ],
        "supervisor": "Dr. David Gray",
        "technology": "Go, C/C++",
        "title": "Goblin"
    },
    {
        "area": "Mobile App, Document Processing",
        "description": "Pocket Scanner is an application for Google's Android Platform. The application makes use of the camera on a Google Android handset as a makeshift scanner to transcribe and record notes, appointments, tasks and if desired upload them to a Google Docs or Google Calender account. After taking a photo, the application will upload the image to a WeOCR server running the Tesseract object character recognition engine. The server will extract any textual data to be found in the image and return it to the user. The user may manipulate the data before saving it to an online document. With the growing popularity of smart phones, more people are carrying and becoming reliant upon reasonably powerful computing computers on their person which are capable of performing some complex tasks. As one of the most popular and fastest growing smart phone install bases, Google's Android platform seemed to be an obvious choice for developing this application. The mobile handset camera is an almost ubiquitous tool which can be found on just about every smart phone in the market. One of the most useful applications for the mobile phone camera I've found in my own experience was for quickly recording useful information or data. With this in mind, an application which could extract data from images and quickly store it for later retrieval seemed like a genuinely useful tool.",
        "platform": "Android",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "sean.hand3@mail.dcu.ie",
                "name": "Seán Hand"
            }
        ],
        "supervisor": "Dr. Gareth Jones",
        "technology": "Java, XML",
        "title": "Pocket Scanner"
    },
    {
        "area": "Image/Video Processing, None",
        "description": "MZKR is a photo mosaic maker that is designed be able to be used by any level of computer user. The application allows the user to build up an image library from their own photos and images or from the supplied ones. These images can then be used to create a mosaic of a different image. The master image is split into sectors and each one of these sectors will be replaced by an image from the user's image library. The fi nal outputted image will still look like the original but will be made up of many smaller images. The application does this by evaluating an images attributes such as the average value across the images' colour bands as well as other attributes such as image texture. This data is stored in the image library. The master image is split up into sectors and then each of these sectors is analysed in a similar manner. The matching algorithm then picks the best image to replace the sector based on various options. The whole image is then reconstructed from the replacement images. An important aspect of this project was to ensure usability while also allow the user to control the outcome if they want to. The user can create a mosaic with this application right out of the box using the supplied sample images. On the other hand the user can have a high level of control over options such as sector size, whether to use colour correction and how to deal with repeated images within the mosaic.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "mar_coyne@yahoo.ie",
                "name": "Martin Coyne"
            }
        ],
        "supervisor": "Dr. Alistair Sutherland",
        "technology": "Java, None",
        "title": "MZKR - A Photo Mosaic Maker"
    },
    {
        "area": "Web Application, Model View Controller",
        "description": "AccAp is an accounting application. It is a web-based application built on the Spring framework. The product tracks the progress of any small to medium size business in terms of profi t and cash surpluses. Accurate fi nancial documents allow the company to keep track of cash fl ow (either expenditure or profi t), and monitor how much of loans have been paid off or are owned to company. It measures the success of a company through accurate fi nancial planning. All of these functions are kept in userfriendly format, with well-formed tables, and easy to understand graphs or pie charts. This is achieved with the help of the Flash and Flex charts. Charts and graphs provide the visual representation of the data and enable a presenter to provide information in a more comprehensible format. Whether publishing a survey report or fi nancial analysis, charts play a major role in data presentations, and AccAp provides a way to analyse and visual data rather than just reading it.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "magorzata.stefanowicz2@mail.dcu.ie",
                "name": "Malgorzata Stefanowicz"
            }
        ],
        "supervisor": "Dr. Monica Ward",
        "technology": "Spring - Java, Javascript, JSP,HTML,CSS,SQL,XML, Flex, Flash - ActionScript 3.0",
        "title": "AccAp"
    },
    {
        "area": "Software Development, Databases",
        "description": "This project is a Table Tennis tournament organiser. The idea for this project came from my background in playing table tennis. Currently at tournaments, the organisers do everything by hand. This can be very tedious and can leave room for error as there is some maths involved and things can get very messy with a large number of competitors. The application helps these users with the organisation and running of the tournament. Users are able to enter in the participants and these will be sorted into groups using the 'Snake draw' algorithm, which sorts the groups based on player rankings. Once the groups are sorted, users can view the generated match sheets for the groups and enter in the results of the matches. From these results, the next round draw is calculated accordingly and the tournament can progress until fi nished with the user entering in the results along the way. I worked closely with current tournament organizers from the Irish Table Tennis Association to provide validation at various stages of development. The application is written in Java and the user interface is built using the Swing library.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "daniel.keenan4@mail.dcu.ie",
                "name": "Daniel Keenan"
            }
        ],
        "supervisor": "Dr. Liam Tuohey",
        "technology": "Java, Eclipse",
        "title": "T.T Tournament"
    },
    {
        "area": "Gaming, Software Development",
        "description": "RbEngine is a simple, functional game engine, with a focus on modularity, extensibility and ease of use. The main goal of RbEngine is to provide a cross- platform development environment which allows rapid prototyping of game design ideas thanks to the integration of a scripting engine, in which all the game logic - right down to the camera - can be quickly written. RbEngine has all the functionality expected of a game engine, providing subsystems for graphics, networking, scripting, audio and resource management. RbEngine has also been designed from the ground up to be platform-agnostic, hiding platform-specifi c functions beneath layers of well-structured abstraction. This abstraction also lends the engine a high degree of modularity, making it easily modifi ed with new subsystems, or allowing for existing subsystems to be replaced entirely without affecting the rest of the engine. Making use of only freely available open source libraries, RbEngine itself is not only an open source project - users are actively encouraged to play around with the engine's internal workings and tweak it as they see fi t.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "robert.lester2@mail.dcu.ie",
                "name": "Robert Lester"
            }
        ],
        "supervisor": "Dr. David Sinclair",
        "technology": "C/C++, OpenGL",
        "title": "RbEngine"
    },
    {
        "area": "Educational, Gaming",
        "description": "Letter formation is an application for the Android operating system. The concept behind this application is to help users learn how to draw letters and numbers through the use of touch screen technology. The users will be able to draw these letters and numbers with their fi ngers, and then will be notifi ed if they are drawing these letters correctly or incorrectly. This idea is based on the concept of 'air tracing' which is used in the educational system in Ireland. 'Air Tracing' is the practice of using a fi nger to draw a letter in the air, to help the person understand how the letter is formed. The application makes use of Android API's including an API called Gestures. The coding is done in Java for the backend logic and XML is used for the visual front end of the application. The users can also connect two devices together to play a drawing game. This game will show the users a simple mathematical equation, and the user will have to draw the answer. This brings an element of fun into the learning process.",
        "platform": "Android",
        "programme": "Information Systems",
        "students": [
            {
                "email": "colin.gough2@mail.dcu.ie",
                "name": "Colin Gough"
            }
        ],
        "supervisor": "Dr. David Gray",
        "technology": "Java, XML",
        "title": "Letter Formation"
    },
    {
        "area": "Network Applications, Security",
        "description": "Mytent eases the management and sharing of fi les for both enterprise and home users. The user establishes a profi le on their network and on start-up becomes visible to all users. Files can be easily shared over RSA/AES secured channels by simply dragging and dropping fi les to users, or, by making the fi le available publicly through a shared folder. For localization teams, the application features linguistic fi le analysis allowing for sorting and searching of fi les based on language (with over 100 languages detectable). For international students, mytent comes with a fully localized user interface and offers to query 3rd party translation services to translate lecture notes and documents into their native language. Through WPF, XAML and the Windows SDK, the user's experience of mytent is integrated seamlessly with the Windows 7 experience. The application will also take advantage of multi-core architectures where necessary and allows for drag/drop interoperability between other Windows applications.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "thomas.cashman2@mail.dcu.ie",
                "name": "Thomas Cashman"
            }
        ],
        "supervisor": "Dr. Monica Ward",
        "technology": "C#, .NET",
        "title": "mytent"
    },
    {
        "area": "Biometrics, None",
        "description": "In 2006, the aim of the CDVPlex biometric cinema project was to investigate the potential correlations between human subject responses to emotional stimuli in movies, and observed biometric responses. Another recent project has investigated the visualization of concurrent tones in music with colours and as a result colours can be generated that are associated with music as it is playing. Taking these projects as inspiration, this project has set up a lab in which a subject relaxes, listens to music and as that music is played the subject observes the changing colours generated on a large screen. Instruments measuring galvanic skin response (GSR), movement and EEG (Electroencephalography) takes readings from the subject throughout the exercise. A number of subjects experience the lab for a number of sessions and the data gathered from these sessions are used in an attempt to correlate music, colour and people's reactions. This gives us some understanding as to how music is experienced not only aurally but also visually and emotionally. Depending on the subject, possible levels of synaesthesia, a neurologically-based condition in which stimulation of one sensory or cognitive pathway leads to automatic, involuntary experiences in a second sensory or cognitive pathway, may also be correlated with the music, colour and personal reactions. The correlation between emotional physiological events as observed in the lab and emotional segments or movements in the music can be observed and perhaps used to aid the composition of music aiming to portray certain emotions. There is also the possibility of using the obtained data to fi nd out more about the phenomenon of synaesthesia and how it affects one's perception or experience of music. This project received approval from the DCU Research Ethics Committee as it involved the use of human subjects.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "evan.white4@mail.dcu.ie",
                "name": "Evan White"
            }
        ],
        "supervisor": "Prof. Alan Smeaton",
        "technology": "Java, Python",
        "title": "MusiColour"
    },
    {
        "area": "Databases, Intelligence Pattern Matching",
        "description": "My project work is concentrated on data mining. The data I use is historical data collected from different sensors in an urban environment. This includes real world sensors such as public transport usage, traffi c and weather, and virtual world sensors such as geo-tagged or specifi c topic-related twitter messages and FourSquare status messages. My work is aimed at reliving past events in an urban environment by means of visualisation of this data across a timeline, identifying similar and unusual trends across different sensors during the same time period. With such visual data mining we can explore the relationships between data sets, identifying cause and effect, and ultimately building mathematical models for these relationships. The applications for this include organisers of city events who can apply my work to make predictions, and in real time to dynamically reallocate resources in order to make resource usage optimal and to handle unexpected situations. In this way, this is how we make the city smarter.",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "yang.li6@mail.dcu.ie",
                "name": "Yang Li"
            }
        ],
        "supervisor": "Prof. Alan Smeaton",
        "technology": "Perl, JavaScript",
        "title": "What makes the city pulse"
    },
    {
        "area": "Web Application, 3-D Modelling",
        "description": "The idea came to me after struggling with underdeveloped booking systems whether booking cinema tickets or theatre tickets not only in this country but on my travels also. After working on websites for the majority of my 3rd year Internship I got to know how advanced they have become. New languages I wrote in for example 'ASP' are the new age languages yet to be infl uenced in everyday sites. With 'ASP' initially used for banking sites, its very advanced in web design and I feel with tying in so many other languages and graphics etc, 'ASP' is the perfect language to bring all of them together and make an advanced and futuristic booking site for theatre or cinema. I wanted the ability to have a booking system which would graphically portray exactly what I was purchasing. Not only that, but have a 3d graphical video of the screen or stage itself, giving me relatively good knowledge of my surroundings and exactly what I was purchasing over the internet. Additional features such as email confi rmation and possibly SMS confi rmation are under development but are likely to add to the advanced system. Countless times I have bought tickets for an event and been unhappy with my location, having certain ticket prices for the 'better' seats simply is not good enough in a 21st century website. The application is for a theatre but with full optimization should be easily applicable for any booking system, with some small coding changes.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "conor.malone24@mail.dcu.ie",
                "name": "Conor Malone"
            }
        ],
        "supervisor": "Dr. David Sinclair / Dr. Gary Keogh",
        "technology": ".NET, JavaScript",
        "title": "3D Theatre Booking System"
    },
    {
        "area": "Gaming, Graphics",
        "description": "Peasant's Triumph is a 2 dimensional Role Playing Game developed in java that uses OpenGl and OpenAl. The game has been designed to have a retro and minimalistic user interface to appeal to a wide range of gamers. When the player starts a new game, they are given access to a highly customizable game character which they assign various attributes to suit their play style. As the player plays through the game their character levels up and becomes stronger. The game presents the player with a large game world consisting of 'above world' and 'below world' maps and caves. Each cave in the world is randomly generated when the player enters them, therefore providing a high re-playability factor. Caves vary in the complexity and depth so no two experiences will be the same. Various enemies roam the game world waiting to attack the player. When this happens the game initiates a battle sequence. The player chooses various battle actions and attempts to defeat all enemies before them. The player gains experience from battling enemies which can be used to level up and augment the player's attributes. When the battle is completed if the player is triumphant in defeating the enemies, gold and items may be gained from the fallen foes.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "keith.cummins3@mail.dcu.ie",
                "name": "Keith Cummins"
            }
        ],
        "supervisor": "Dr. Donal Fitzpatrick",
        "technology": "Java, OpenGL",
        "title": "Peasant's Triumph"
    },
    {
        "area": "Gaming, Mobile App",
        "description": "Mobile devices have come on a lot in recent years and games have been making a home for themselves on these devices. For this reason, making it easy for people to connect and play with each other through these devices at their own convenience has obvious appeal. Tactical Wars is a 2D, grid-based, turn-based strategy game for the iPhone. It features a top-down view, is suitable for two players and is based on a GameBoy game by the name of Advance Wars. On each turn a player can move each of their units to another position on the board within the particular unit's allowed range. After moving, it can then choose to attack an enemy unit on an adjacent tile, with the damage infl icted being calculated depending on the type of unit attacking, its current health and the type of unit being attacked. The objective is to move your own units around the map and defeat all of the opposing player's units. The game features a simple interface with intuitive controls. Possibly the most important aspect of the game is that users play together through asynchronous online play. This means player one can open the app and take their turn, at which time player two will receive a notifi cation telling them they have a turn waiting, which they can then execute at their leisure. The game's state is stored on a server using JSON so the data being exchanged is kept to a minimum. The game appeals to a large subset of iPhone owners who enjoy playing mobile games that don't require much time investment each time they pick up the game. It also provides a more practical way for users to play with friends online.",
        "platform": "Mac_iOS",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "comara2727@gmail.com",
                "name": "Ciaran O'Mara"
            }
        ],
        "supervisor": "Dr. David Gray",
        "technology": "XCode, None",
        "title": "Tactical Wars"
    },
    {
        "area": "Sensor Technology, Data Analysis",
        "description": "Secure bins are used for shredding important and confi dential documents. In their current state they offer little more than a simple lock, which can be opened with any triangle key, as the only form of security. By using sensor technology the security of the bins can be enhanced and thus a customer's confi dence and satisfaction can be guaranteed to a higher level. Using sensors offered a method of gathering data on a secure bins typical and atypical usage. Normalising and analysing this data then allowed for the most effi cient sampling rate to be chosen and which sensors offer the best results, in terms of recognising permitted typical usage and forbidden atypical usage. By using these fi ndings a device and system can be implemented which will allow companies, offering a secure shredding service, to add an extra level of security to their bins. It will be both cost and energy effective which are important aspects for new technologies.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "neil.odonnell8@mail.dcu.ie",
                "name": "Neil O'Donnell"
            }
        ],
        "supervisor": "Prof. Alan Smeaton",
        "technology": "Sensors, MS Excel",
        "title": "Enhancing Secure Bins"
    },
    {
        "area": "Multimedia, None",
        "description": "The Cartoon Version of a Meeting project is aimed at creating concise and eye-catching animated videos representing important parts of a meeting, without any user input. It makes use of the Xtranormal movie creation engine, in the form of a downloadable package called State. Instead of having meeting minutes released in text format, paraphrased and long winded, this application lets a user create a short film. All this is free of hassle, the user just needs to supply an audio file of the meeting, along with a small markup file which makes note of wanted sections of audio. The application will then turn this into an animated piece, complete with facial expressions, gestures, real audio and camera angles, which can then be distributed and viewed at leisure. All of this creation will happen automatically, with no extra input from the user. It can also be used to create presentations or demos in lieu of powerpoint for anything the user wanted.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "cian.scolard3@mail.dcu.ie",
                "name": "Cian Scolard"
            }
        ],
        "supervisor": "Prof. Alan Smeaton",
        "technology": "Java, None",
        "title": "Cartoon Version of a Meeting"
    },
    {
        "area": "Flash Gaming, Web Design",
        "description": "For my final year project I am developing a racing game in Flash using the ActionScript programming language. Having previously developed in Java and JavaScript it gives me the opportunity to directly compare both technologies. The game includes computer controlled 'racers' so there is the aspect of AI involved in the coding. I also have to program for user controls (speed, direction), boundaries, collisions and controlling the dimensions of the gameplay (confining the user to a certain space). There will be features such as car and track selection, conditions, etc. The other attraction for me to select this project is the opportunity to work using Flash as a Web Development tool. Long term i see Web Development being an area that will interest me and having already coded in HTML, JavaScript and using Applets, this is adding another technology to my portfolio. I also relish the challenge of teaching myself a new language. Flash is an extremely powerful language and offers huge potential graphically and visually. Just look up the top flash websites on the web and you will realise that you can deliver a website using language that gives amazing interaction and stunning visuals - screen and menus that blend smoothly into each other or blow up into huge animated displays. There is also the huge benefit that newer Android phones now support Flash, so by scaling down my game, i can have it up and running on a mobile phone.",
        "platform": "Multi-platform",
        "programme": "Information Systems",
        "students": [
            {
                "email": "aisling.friel4@mail.dcu.ie",
                "name": "Aisling Friel"
            }
        ],
        "supervisor": "Dr. Donal Fitzpatrick",
        "technology": "Flash, None",
        "title": "Flash Racing"
    },
    {
        "area": "Android Development, Sustainable Energy",
        "description": "The aim of this project is to create a Dwelling Energy Assessment Procedure (DEAP) application for Android OS smartphones. DEAP is the Irish offi cial procedure for calculating and assessing the energy performance of dwellings. DEAP software is available for PC to download from The Sustainable Energy Authority of Irelands website. However a smartphone application is a very appropriate way to assess a building and return a Building Energy Rating (BER). It allows the BER to be determined on site which reduces the time needed to get this result. The target market for this application will be BER assessors, home owners and various others in the construction industry. DEAP takes account of the energy required for space heating, ventilation, water heating and lighting, less savings from energy generation technologies. DEAP calculates yearly values of energy used and carbon dioxide emissions. The algorithms that carry out the calculations for DEAP are written in Java while the graphical user interface is designed using XML.",
        "platform": "Android",
        "programme": "Information Systems",
        "students": [
            {
                "email": "colum.wilde2@mail.dcu.ie",
                "name": "Colum Wilde"
            }
        ],
        "supervisor": "Dr. Liam Tuohey",
        "technology": "Java, XML",
        "title": "DEAP for Android"
    },
    {
        "area": "Web Application, Mobile App",
        "description": "In the current economic climate it is important that small independent retailers can survive against large multinational companies. Find It is a web application packaged with an Android application that enables small Irish retailers to compete with large companies and online auction and shopping websites in the ever-growing online market. These retailers can create accounts with Find It and input information about themselves, add branches/ stores to their account and add products and services to a store. Customers can then go online and browse through the various products and services that are available. Google's Geocoding Service along with an integrated Google Maps interface allows Retailers to easily mark their store location on a map so that Customers can identify the exact location of the store without the need of acquiring directions to the store address. Customers with Android devices can use the Android application to quickly search for a product, service or store that is located nearby. Using GPS the application will calculate the users current location and return their search results in order of nearest location. These results can be displayed on a Map on the Android device. The web application was developed using the latest version of the Spring MVC framework combined with Hibernate for database management. The web application and Android application are localized and can be easily changed between English, Spanish and Japanese. Additional languages can be added to the system without the need of modifying code in any way. This means that Find It is not specifi c to Ireland but can be deployed anywhere in the world. The inclusion of Twitter and Facebook support means Customers can broadcast their findings which will aid retailers in marketing.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "anthony.murphy74@mail.dcu.ie",
                "name": "Anthony Murphy"
            }
        ],
        "supervisor": "Dr. Monica Ward",
        "technology": "Java, JSP/Servlets",
        "title": "Find It"
    },
    {
        "area": "Project Management, Web Application",
        "description": "StaffPM provides a platform for organisations to record projects, tasks and the performance of their employees. Many companies give little thought to staff performance reviews and their impact on the productivity and drive they can provide to staff. StaffPM allows users to track their projects and their progress within them. Combining a clean, fast interface for capturing and organising tasks, StaffPM allows staff members to receive regular feedback from their managers and team leaders. The feedback staff members receive is stored and can be retrieved for any time-period or time-scale and exported to Microsoft Excel fi les including the charts generated and displayed to the users within StaffPM. StaffPM allows users to manage all of their projects in one place, and to focus on the task at hand without ever losing sight of the big picture. The system even includes the option of full integration with users' Google Calendars. This provides a fl exible project management tool whether you are tracking tasks for a single project, or running countless projects throughout your entire company. Task workfl ows allow any business process to manage tasks, track activity therefore ensuring you meet your deadlines, increase productivity and provide a more enthusiastic environment for all employees.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "rhodesg2@mail.dcu.ie",
                "name": "Graham Rhodes"
            }
        ],
        "supervisor": "Dr. Markus Helfert",
        "technology": "Java, HTML",
        "title": "StaffPM"
    },
    {
        "area": "Mobile App, None",
        "description": "MiStats Sensing Sporting Performance is an application, which can be downloaded and used on an iPhone or an iPod Touch. The MiStats project is a personal sports application, which monitors a user's in-game performance. The application measures several different aspects of the user's performance, these include the following; the distance covered (miles), pace (min/miles), speed (mph), the length of time the player has been active and the amount of passes the player played over the course of their game. Presently the iPhone or iPod Touch is capable of acting as a personal fitness or sports performance monitor for users. Therefore, the most up-to-date versions of iPhone or iPod Touch include systems and methods for integrating sensors for tracking a user's performance metrics into media devices and accessories, thereby reducing or eliminating the need for additional independent monitoring devices. These include the capturing of both physiological measurements such as heart rate and ECG. However, the MiStats application is more concerned with the capture of more non-physiological parameters such as distance covered, pace and speed and so forth. In the world of technology there is going to be a greater movement towards sensory development. As a result, focusing on the use of wearable technologies to capture physiological and non-physiological data from the wearer with key applications areas such as exercise, sports and personal health will become increasingly relevant. The application makes use of the iPhone's and/or iPod Touch's inbuilt sensory facility and provides accurate feedback on several aspects of a user's performance.",
        "platform": "Mac_iOS",
        "programme": "Information Systems",
        "students": [
            {
                "email": "mervyn.fealy2@mail.dcu.ie",
                "name": "Mervyn Fealy"
            }
        ],
        "supervisor": "Dr. Stephen Blott",
        "technology": "XCode, HTML",
        "title": "MiStats Sensing Sports Performance"
    },
    {
        "area": "Digital Signal Processing, None",
        "description": "Legobot demonstrates Image processing techniques in which different detection algorithms using mathematical operations will be implemented with the use of a webcam and the Lego Mindstorms NXT programable robotics kit. A lego robot is constructed along with wheels allowing it to orient itself in an environment, extract information from the environment, and react to it using the wireless webcam. Connection from the laptop to the robot is via bluetooth. It is programmed in Matlab using the Image Acquisition Toolbox and the RWTH Mindstorms NXT Toolbox for Matlab. The function of legobot is to detect a line using the webcam and using the robot follow the line to the end. Another function is to detect an object and to follow it by keeping a certain distance away from it.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "mustafa.magdeldin2@mail.dcu.ie",
                "name": "Mustafa Magdelin"
            }
        ],
        "supervisor": "Dr. Alistair Sutherland",
        "technology": "Matlab, None",
        "title": "Legobot"
    },
    {
        "area": "Machine Learning, Intelligence Pattern Matching",
        "description": "The idea for this project comes from research undertaken by CLARITY. For almost 2 years domestic energy usage data has been collected from homes and then stored in a CLARITY database. Appliance detection aims to recognize the operating states of an electric kettle appliance from raw sensing data of electric power. The project also intends to use these application detection methods to try and distinguish usage patterns to try and defi ne user's activity in regards to electrical energy output. The appliance detection project uses machine learning combined with some statistical techniques to create a model for an electric kettle which can then be applied to data over a specifi ed time period. The project uses heat maps as a way of displaying when a kettle is active and inactive. Heat maps can be created based on day, week, month, or year. Comparisons of heat maps can then be made based on a given time period, for example to see the kettle usage habits of Winter Vs Summer months.",
        "platform": "Windows",
        "programme": "Information Systems",
        "students": [
            {
                "email": "marc.healy34@mail.dcu.ie",
                "name": "Marc Healy"
            }
        ],
        "supervisor": "Prof. Alan Smeaton",
        "technology": "SVM_Light, Microsoft Excel",
        "title": "Electrical Appliance Detection"
    },
    {
        "area": "Content Development Environment, Web Application",
        "description": "This system was designed and developed to help assist the IVI (Information Value Institute) in automating their process of developing the IT-CMF (Information Technology Framework). The content of the framework is developed through a defi ned 'review process' involving a number of participant and synthesizing leading academic research, proven industry best practices and domain expertise. Although there are a number of templates available for the content development, previously most of the content development process relied on a manual processes and development on PowerPoint presentations and excel sheets. The main aim of this project was to assist is automating the content development process and design & implement a Content Development Environment for the IT- Capability Maturity Framework. A very large part of the project was requirements analysis as well as system design as it was not clear to the customer what they actually wanted, it was decided the system would: - Allow a user and role concept (authentication and authorization)  Support for the review process (with comments and staged releases of CP's) - Have Version control capabilities - Store the content in a database system in accordance to the data structure of critical processes defi ned by the IVI - Automated emailing One of the main reasons for selecting this project was due to its real world relevance and having a customer to deal with (i.e. the project has the potential to be used by the IVI which consists of 50 of the worlds largest organizations such as Intel and British Petroleum). Another reason this project was selected was due to the fact that it involved all aspects of the software development life cycle from requirements gathering to testing and implementation.",
        "platform": "Multi-platform",
        "programme": "Information Systems",
        "students": [
            {
                "email": "mohamad.aldeiri2@mail.dcu.ie",
                "name": "Mohamad Aldeiri"
            }
        ],
        "supervisor": "Dr. Markus Helfert",
        "technology": "Ruby, JavaScript",
        "title": "Content Development Environment for the IT-Capability Maturity Framework"
    },
    {
        "area": "Compiler Development, None",
        "description": "This project applies optimization techniques to a non Object Oriented subset of Python. Examples are copy propagation(where a statement like a = b has all a's until a reassignment of a or end of scope replaced with b) and constant propagation(same as copy except it's a value such as 1 or 3.14), strength reduction(turning expensive operations into a series of lesser costly operations), loop unrolling(trades reducing cost of controlling the loop for adding similar independent statements), loop-invariant code motion(moves code that doesn't vary in value between iterations outside the body of a loop). It mainly focused on loop optimization, which is where the most execution time is spent. This will take advantage of non-loop code optimizations which will optimize the body of a loop as well loop specifi c optimizations which will will optimise the structure of the loop. The end result is that even with software engineers programming for clarity and maintainability, the optimizer should produce byte at least as fast as if they wrote it for speed themselves. This hopefully should allow the engineer greater fl exibility in how they approach writing programs to their particular style without be too adverse to speed.",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "paul.dunning2@mail.dcu.ie",
                "name": "Paul Dunning"
            }
        ],
        "supervisor": "Dr. Geoff Hamilton",
        "technology": "Python, None",
        "title": "Python Optimiser"
    },
    {
        "area": "Artificial Intelligence, Educational",
        "description": "This is a simulation program to demonstrate Artificial Life in the context of Darwinian evolution. Artificial Life is a contemporary interdisciplinary field that models biological life in a computer simulation. This program will create artificial habitats for the species to live in and interact with(Ecology). How the species interacts with its environment depends on the species properties which can also be defined by the user. As the simulation runs, communities (groups of creatures of one particular species) gravitate to and restrict themselves to certain parts of the habitat depending on properties of both the community and the habitat. As well as species-habitat interaction and interaction amongst the communities, there is also inter-species interaction. Species interact in a manner akin to a 'chain of command' which depends on the species properties such as strength, speed etc. This 'chain of command' hierarchy develops as the simulation runs. The population of a community naturally increases also due to natural selection where the most suitable members are selected for reproduction.",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "cathal.sharkey5@mail.dcu.ie",
                "name": "Cathal Sharkey"
            }
        ],
        "supervisor": "Dr. Alistair Sutherland",
        "technology": "Java, Eclipse",
        "title": "Artificial Life"
    },
    {
        "area": "Data Mining, Databases",
        "description": "XMine is a Java API that enables data-mining functionality with XPath, the XML path language used for querying XML documents. XPath (a subset of XQuery) allows for intuitive XML queries to be generated for retrieving XML result-sets using simple path syntax and predicates. However, it does not provide facilities for analysis of the requested data, which may only be accomplished with the addition of potentially complex XQuery syntax. The XMine API allows a user to submit an XPath/XQuery query expression, but with additional data-mining syntax and options as defi ned by the API. Query results will be retrieved from a database and subsequently post-processed according to the given data-mining syntax. The results of the analysis are then returned to the caller as XML. XMine implements a set of useful data-mining functions that should be applicable to any dataset, and allows the analysis of data from a multi-dimensional aspect. Although the API is at the core of this project, a command line utility has also been developed in order to demonstrate usage of the XMine API. This utility leverages the API to process useful queries against a specifi c dataset stored in an opensource XML database (MonetDB).",
        "platform": "Unix/Linux",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "robert.fynes2@mail.dcu.ie",
                "name": "Robert Fynes"
            }
        ],
        "supervisor": "Dr. Mark Roantree",
        "technology": "Java, XML",
        "title": "XMine"
    },
    {
        "area": "Educational, Software Development",
        "description": "The system has been developed for use as study aid to students of operational management orientated classes. It will allow users, with some mild computation on their part, to view correctly solved critical path problems in the form of a network diagram. The system has been originally developed as a java application, with views to incorporate it into a website during the later stages of development. The systems main use will be to verify answers and help solve problems students are fi nding too diffi cult. Although user friendliness has been a priority, the system will only receive information in a predetermined format which will be expanded upon in the user manual. This is due to the nature of critical path problems and the lack of a set format that every question follows directly. The final system will be presented in the form of a website for ease of use . The only prerequisites necessary to use the system is computer with access to the internet and any given browser. The user will be required to format the question, if not already done so, into three sections; activity, duration and predecessors. Once this is completed the user can enter the necessary numbers and activity names into the system to be processed. The website will be as user friendly as possible with the aesthetics of the network diagram being paramount. Given the straight forward nature of the system user interaction will be minimal, the majority of the complexities encountered were functionality based coding issues. All that is required of the user is the input of figures. From there, the system will pass the information to a java program which will compute the solution, utilising Dijkstra's algorithm, and create a network diagram which will show the users the correct course of network activity and thus the solution.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "gary.noone2@mail.dcu.ie",
                "name": "Gary Noone"
            }
        ],
        "supervisor": "Mr. Charlie Daly",
        "technology": "Java, None",
        "title": "Critical Path Problem Solving Tool"
    },
    {
        "area": "E-Commerce, Information Retrieval",
        "description": "AutoSearch is an online vehicle manager that has the ability to provide the user with all costs involved with purchasing the vehicle they are interested in. It works similar to other websites of its type in that a user uploads a vehicle they wish to sell. However AutoSearch indexes this vehicle to a specifi c category and therefore won't hinder browsers searching for something else. This makes browsing vehicles a lot more effi cient. AutoSearch can also provide a user with an estimation of all the cost involved in buying the vehicle they are interested in by calculating how much the tax, VRT (if applicable) and insurance specifi c to the user in the click of a button. AutoSearch will also show users on a map, the location of where the viewing of the vehicle will take place. The site will also allow for a suffi cient upload of pictures along with having certain mandatory fi elds that must be fi lled out such as year, mileage, fuel type etc. AutoSearch brings all this functionality to the user by providing a nice friendly user interface. The market potential of this website is to enter a new era how we think about selling and buying vehicles. The aim of the project is to become the primary source of trading vehicles on both a private and commercial level.",
        "platform": "Windows",
        "programme": "Information Systems",
        "students": [
            {
                "email": "liam.kearns@mail.dcu.ie",
                "name": "Liam Kearns"
            }
        ],
        "supervisor": "Dr. Martin Crane",
        "technology": "PHP, JavaScript",
        "title": "AutoSearch"
    },
    {
        "area": "Educational, Educational",
        "description": "It is a fairly common belief that not enough students are getting on well with mathematics in Secondary School and consequently there is a 'Maths Shortage' at Third Level and in the country's work force. The purpose of this project will be to develop a programme that teaches maths and makes the learning of maths more appealing to children studying Junior Certificate maths. This will entail writing a program that will follow the junior certificate ordinary and higher level syllabus with each topic covered. This will be taught online with the students following examples and interacting with the program, progress reports are generated after each exercise and real world comparisons are demonstrated. The aim is to make the subject more attractive and interesting and help students feel comfortable with mathematics. The project includes a module on Computer Programming. This gives students an introduction to programming with aim of creating an interest in computing, and showing the benefits that computers provide.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "donnelm4@computing.dcu.ie",
                "name": "Martin Donnelly"
            }
        ],
        "supervisor": "Dr. Liam Tuohey",
        "technology": "Java, JSP/Servlets",
        "title": "Maths_Interactive"
    },
    {
        "area": "Gaming, None",
        "description": "The project is a 2-dimensional video game viewed from an overhead perspective. The player controls a character capable of free movement in 8 different directions while exploring a series of game levels. Its concept is infl uenced by previous top-down shooter games such as the Alien Breed series for the Commodore Amiga. The player's goal is to reach the exit of each level by surviving hazards such as groups of enemy creatures and environmental hazards. This is accomplished by the use of several types of weapons and items. Limited amounts of such items can be found through exploration of the game's levels but can also be purchased during the game. The game is coded in C++ using Microsoft's DirectX API with XML used for managing various items of game data.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "sean.mulkerrin3@mail.dcu.ie",
                "name": "Seán Mulkerrin"
            }
        ],
        "supervisor": "Mr. Charlie Daly",
        "technology": "C/C++, XML",
        "title": "2D Top Down Shooter Game"
    },
    {
        "area": "Mobile App, None",
        "description": "This project has 3 primary functions. It allows the user to view a Google Map of their surrounding area. This Map identifi es the users current location relative to bookmaker stores. These stores include Ladbrokes BoyleSports and PaddyPower. The application will retrieve and display the odds being offered by each of the respective bookmakers. The odds it will search for are English Premiership football matches. Finally, the application will attempt to predict the outcome of these games. Predictions will be delivered in the format of 'Win, Lose or Draw'.",
        "platform": "Android",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "patrick.odonovan8@mail.dcu.ie",
                "name": "Patrick O'Donovan"
            }
        ],
        "supervisor": "Dr. Liam Tuohey",
        "technology": "Java, XML",
        "title": "Best Odd Finder, Bet Predictor and Store Locator"
    },
    {
        "area": "Music, None",
        "description": "This project implements the classic analog synthesizer in Matlab with MIDI control capabilities through an external MIDI controller to provide an expressive musical tool for the user. The implementation uses the subtractive approach to synthesis in which an oscillator produces simple waveforms. This signal is then fi ltered to cut off certain frequencies of the signal and then the signal is shaped over time to provide a distinct timbre. The program provides two sources of control to alter the parameters of the sound being generated. An external MIDI controller allows the user to play the instrument providing the frequency and amplitude of the signal and the GUI provides global controls that affect the overall characteristics of the synthesizer sound such as specifying the cut-off frequency of a particular fi lter and specifying how the loudness and spectral content of the sound change over time. The program also allows the user to save the current control settings so they can recall them at a later time if they created a sound which they liked.",
        "platform": "Windows",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "craig.minchin2@mail.dcu.ie",
                "name": "Craig Minchin"
            }
        ],
        "supervisor": "Dr. John McKenna",
        "technology": "Matlab, Java",
        "title": "Audio Synthesizer"
    },
    {
        "area": "Graphics, Artifi cial Intelligence",
        "description": "This project is partially based on the Prisoner's Dilemma game. The Prisoner's Dilemma is a fundamental problem in game theory that demonstrates why two people might not cooperate even if it is in both their best interests to do so. The system is using the idea that different people live in a world where each person has a different strategy 'Generous', 'Selfi sh', or 'Tit-for-Tat', which allows them depending on the strategy to take certain actions towards other people (by taking a certain amount of money from or giving it to another user). The main goal of the system is to see in the long run which strategy is profi table, and which strategy lasts the longest without losing everything.",
        "platform": "Multi-platform",
        "programme": "Software Engineering",
        "students": [
            {
                "email": "bakoserge@gmail.com",
                "name": "Serge Bakayoko"
            }
        ],
        "supervisor": "Dr. Alistair Sutherland",
        "technology": "Java, None",
        "title": "Modelling Society -Game Theory"
    },
    {
        "area": "Sensor Technology, Information Retrieval",
        "description": "Within CLARITY they have 22 homes gathering data on electricity usage, 24x7, for the last 12 months. This data is stored on a conventional SQL database with an API developed and working. The project is to carry out an analysis of usage patterns, activity levels, and appliance usage and to develop visualisations for this enormous database of data readings. This will involve extracting data from the current data, from the current SQL (e.g. appliance detection based on amount of electricity used etc). As well as extracting data about appliance and electricity within houses, it is also possible to research information from sources including things like external factors (i.e. temperature drop/measurement in a particular place and time etc.). Integrating these different sources of information together can help to answer some questions by, for example, showing the correlation between electricity usage of a certain house during a particular time and the showing the temperature measurement in that particular area where the house is situated in the same particular time (i.e. can answer a question of why electricity usage is so high (weather is particularly cold at that time.) etc.). When all relevant data is gathered and utilised, the next step will involve fi nding way of displaying the information which is both meaningful and visually appealing to the audience member viewing it. The information and visuals will be displayed on the Clarity multi-touch wall. This is an area of modular multi-touch cells which can cross platform and allow multiple people to use the screens at the same time.",
        "platform": "Multi-platform",
        "programme": "Information Systems",
        "students": [
            {
                "email": "jude.higgins2@mail.dcu.ie",
                "name": "Jude Higgins"
            }
        ],
        "supervisor": "Dr. Hyowon Lee and Prof. Alan Smeaton",
        "technology": "C/C++, OpenGL",
        "title": "Visualising Energy Consumption"
    },
    {
        "area": "Multimedia, Software Development",
        "description": "This project is an introduction to random music generation that ideally makes appropriate music based on what the user defi ned choices are and stores it as some universal format (i.e. midi fi le and wav fi le). This document outlines the steps which were taken to make this possible. Random music is not a very developed area, in fact there are very few functional working examples of it in the world today, and it is for this reason that it is an interesting subject that in my opinion needs more research and to improve the overall quality of the music that is outputted. This project resulted in complete success; that is it performed its primary goal which was that it should be capable of passing a variant of the classic Turing test, whereby a listener should not be capable of identifying whether the composition was written by a person or a machine.",
        "platform": "Windows",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "daniel.obrien44@mail.dcu.ie",
                "name": "Daniel O'Brien"
            }
        ],
        "supervisor": "Dr. Conor Brennan",
        "technology": "Matlab, Eclipse",
        "title": "Matlab Based Random Music Generator"
    },
    {
        "area": "Security, None",
        "description": "In this project, chaos is used for secure communications. Three different methods are discussed and compared to each other. These are digital secure communication via basic chaotic systems, the power spectrum mask method of chaotic secure communication and secure communication using chaos in complex-order Chua's systems. Simulations show the advantages and disadvantages of each method. The secure system via the basic chaotic system: the digital signal is transmitted and received via a chaotic system. During signal transfer, noise is added to the signal in the channel. At the receiving end of the system, the BER is calculated in order to compare the original signal and recovered signal. The power spectrum mask in chaotic secure systems: the basic Chua's circuit is introduced. The signal is transmitted via Chua's chaotic system. At the receiver, the signal is restored by an additive mask and a multiply mask. The BER is calculated. The complex-order Chua's system: the fractional complex order Chua's system is used in this system. In this system, we apply a complex-order model to achieve secure communication. This method can transmit two-way signals. Once again, the BER is calculated. We compared the performance of the three systems in terms of simulation time, model security, reliability, flexibility, recover signal accuracy (BER), size of system. The results show that the power spectrum mask secure system is better than the others. It has better security. It is more reliable.",
        "platform": "Windows",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "hongyi.wang3@mail.dcu.ie",
                "name": "Hongyi Wang"
            }
        ],
        "supervisor": "Dr. Marissa Condon",
        "technology": "Matlab, None",
        "title": "A comparison of a variety of secure communication techniques involving chaos theory"
    },
    {
        "area": "Optoelectronics, Optical communications",
        "description": "The aim/objectives of this project is to do an intense research about passively mode-locked lasers, this type of lasers features a periodic variation of the output power even thought they are DC-biased. They have the ability of reaching up to a frequency of 1.1THz and they are multimode, alongside with this project I develop a matlab code that predict the behaviour of this type of laser, this was done in order to get a better understanding of how this type of laser works.",
        "platform": "Windows",
        "programme": "Info and Communications Engineering",
        "students": [
            {
                "email": "femozaky2000@gmail.com",
                "name": "Femi Adeleke"
            }
        ],
        "supervisor": "Dr. Pascal Londais",
        "technology": "Matlab, None",
        "title": "Theoretical study of Passively mode-lock lasers"
    },
    {
        "area": "Numerical analysis, Circuit theory",
        "description": "This dissertation examines the simulation of highly oscillatory circuits by using an envelope following technique. Oscillatory systems arise when using clocked circuits or modulated signals. In the envelope following method, it skips simulating several highly oscillatory cycles and uses interpolation/ extrapolation instead. This means that it is much more efficient. It involves solving a boundary value problem and numerical integration. The numerical integration part is implemented with both the Forward and Backward Euler for comparison purposes. The Backward Euler method is more stable than the Forward Euler method. The shooting method is implemented for the Boundary Value Problem. The envelope following technique is applied to a Van Der Pol problem and compared with the MATLAB ODE code to see what differences lie between them. Results show that the envelope following method is much more efficient.",
        "platform": "Windows",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "da.liu5@mail.dcu.ie",
                "name": "Da Liu"
            }
        ],
        "supervisor": "Dr. Marissa Condon",
        "technology": "Matlab, None",
        "title": "Envelope following technique for the simulation of highly oscillatory circuits"
    },
    {
        "area": "Software Development, mechanics of machines",
        "description": "The aim of the project was to develop a tool using Microsoft Excel and VBA programming to assist learning of mechanics of machines. Students, when face with a mechanics question. Most fi rst identify what methods can be applied in its solution. For instance, is the principle of work energy viable for this question or shall the principle of impulse be used. This tool asks a series of questions to help them identity the appropriate method for a given problem. Different questions in the next stage are asked by the tool according to answer made in the previous question. In such a way, the student is introduced to a 'tree' structure of information. The tool allows lecturers to build the 'tree' structures easily using questions. The questions can include several types of data such as text, images and hyperlinks. The lecturers can identify the correct path through the 'tree'. Also, they can set the feed back on the degree of recommendation for these paths and provide feed back on why certain choices are not recommended. The students can then receive feedback at all stage.",
        "platform": "Windows",
        "programme": "Mechatronic Engineering",
        "students": [
            {
                "email": "xiao.liu5@mail.dcu.ie",
                "name": "Xiao Liu"
            }
        ],
        "supervisor": "Mr. Alan Kennedy",
        "technology": "excel VBA, None",
        "title": "Teaching tool development based on Excel VBA"
    },
    {
        "area": "Educational, None",
        "description": "The aim of this project was to develop a tutorial creator based in excel to be used in class tutorials or as a study aid for students. While the system primarily focuses on multiple choice type questions, the tutorials created with the editor are intended to provide tutorial like help for students when working on their own or during a timetabled tutorial session, supplying students in tutorials where lecturer contact time may be limited, or where students are unsure of asking questions, with additional guidance and help on approaching the material covered in the tutorial. To implement this approach, the question creator allows for a lecturer/teacher to provide additional information when creating a question. When a student attempts a question and an incorrect answer is entered the additional information will be made available to the student, possibly highlighting common mistakes or supplying more detail on the approach to take in completing the question. The tool is also intended to allow a lecturer to highlight additional resources, such as a pointer to a recommend text, lecture notes, or web links to sites containing relevant examples of the principles in practice. With this additional information reinforcing the tutorial it is intended that the students encounter a positive and useful learning experience, hopefully allowing students to learn from their mistakes and from the experience giving them a better understanding of the material currently being explored in the tutorial.",
        "platform": "Windows",
        "programme": "Mechatronic Engineering",
        "students": [
            {
                "email": "michael.lawless6@mail.dcu.ie",
                "name": "Michael Lawless"
            }
        ],
        "supervisor": "Mr. Alan Kennedy",
        "technology": "VBA, Visual Basic for Applications, Microsoft Excel",
        "title": "Development of computer-based learning tools for Mechanics - 1"
    },
    {
        "area": "Multimedia, None",
        "description": "In the area of electronic music and sound mixing, few groups have come close to the innovation and creativity achieved by the Monome and Arduinome projects, both of which focus on the use of an array of pushbuttons with lights as a musical interface. This project aims both to build a fully functioning Arduinome (8x8 button array) and to show its potential for wider applications outside the realm of audio mixing. To this end, it was decided that the Arduinome should be able to function independently of a host computer, as so many applications would benefi t greatly from a lack of reliance on a wired USB connection. The goal of the project was to build the original 8x8 array and add to its software and hardware such that a few applications, some musical and some not, could run without any computer interaction whatsoever. This was achieved using the architecture designed by the Arduinome project, modifi ed slightly for use with the Arduino Mega, and a Wave Shield for audio output. As well as these hardware considerations, many changes were made on the software side to implement full applications rather than just a simple interface to a host machine. In addition to a custom hardware and software confi guration, the project also involved the design and fabrication of a clear acrylic case for display and use. In conclusion, the project is a clear proof of concept, showing that the Arduino platform is suffi cient to power and run the full button array while at the same time performing some other task (in this case sound output).",
        "platform": "Arduino",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "david.mcmullin4@mail.dcu.ie",
                "name": "David McMullin"
            }
        ],
        "supervisor": "Dr. Gabriel-Miro Muntean",
        "technology": "C/C++, Matlab",
        "title": "A Standalone Arduinome"
    },
    {
        "area": "Engineering System Design, Sustainable Energy",
        "description": "Due to the damage that fossil fuels cause to the Earth's atmosphere and their limited nature, the human population's dependence on fossil fuels as a source of energy needs to be re-evaluated. Solar energy is a readily available and infi nite source of energy that is yet to be exploited to its full potential. Concentrated solar power (CSP) involves using a refl ector to focus the sun's energy to a point to produce great light and heat. The heat energy at this point can then be used to produce electricity by heating a working fl uid or by directly operating a heat engine. A parabolic dish refl ector is the most effi cient CSP method. However, if a parabolic refl ector does not look directly at the sun then it will not bring the Sun's rays to a perfect focus. The refl ector must therefore be mounted on a solar tracking mechanism in order to keep the dish pointing at the sun. This project details the design and development of a solar tracking system for a standard 80cm satellite dish as a desktop proof-of-concept. A standard satellite dish can be converted into a parabolic dish refl ector by covering it in mirrors or refl ective material. The engineering methods that the author used in designing the system are detailed. Methods include kinetic and kinematic analysis, 3D modelling and simulation, and prototype testing, and design decisions in the project are justifi ed. The fi nal design was manufactured and tested against the aims of the project. It was found that the design effectively tracked the sun and was a good proof-of-concept of the benefi ts of solar tracking.",
        "platform": "Windows",
        "programme": "Mechatronic Engineering",
        "students": [
            {
                "email": "kevin.ofl ynn4@mail.dcu.ie",
                "name": "Kevin O'Flynn"
            }
        ],
        "supervisor": "Dr. Noel Murphy",
        "technology": "Arduino microcontroller., None",
        "title": "Solar Tracking Drive and Controllers for a Parabolic Dish Solar Thermal Collector"
    },
    {
        "area": "Renewable Energy System Design, None",
        "description": "The aim of this project was to fabricate a prototype of a renewable energy system for use in the household. The main goals of the project where to produce a scaled model of a controllable system that during the day charged a battery using a solar or photovoltaic panel and at night to use the stored energy to power the lights in the household independent of the mains supply. The innovative part of the project lies within the proposed controllability aspect. While there are similar solar powered systems available to heat water in houses and to power A/C devices with the use of an inverter, these however lack the level of controllability I incorporated into my design. One example of this is for the lights to turn on automatically at night. A successful prototype was built and tested as part of the project and the calculations where carried out to illustrate what would be needed in a real world application. Also discussed at the end of this report are some further development ideas which could be explored to improve the amount of energy harvested from a panel.",
        "platform": "Arduino",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "paul.martin26@mail.dcu.ie",
                "name": "Paul Martin"
            }
        ],
        "supervisor": "Dr. Stephen Daniels",
        "technology": "Electronic Components, None",
        "title": "Renewable Energy System Design: The Photon Utilisation Project"
    },
    {
        "area": "Web Application incorporating Google Maps and Google Elevation, Graphics - Overlaying Radio Coverage back onto Google Maps - Coverage Calculated using the Fast Far-Field Algorithm",
        "description": "The 'Interactive Radio Coverage Map' is a web application which incorporates the Google Maps API. It is intended to allow users to select a transmitter location and coverage range on the map, and visualize the corresponding radio wave coverage over the earth's terrain. This coverage data is calculated using the Fast Far-Field algorithm which obtains distance and elevation data from Google Maps via the user's interaction. Using this information the web application provides user-friendly plots of the distance, elevation, and coverage data obtained, along with a colour-coded coverage overlay to the original map.",
        "platform": "Windows",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "patrick.murphy39@mail.dcu.ie",
                "name": "Patrick Murphy"
            }
        ],
        "supervisor": "Dr. Conor Brennan",
        "technology": "Groovy and Grails, JavaScript, HTML, CSS, Matlab",
        "title": "Interactive Radio Coverage Map"
    },
    {
        "area": "Radio Frequency, None",
        "description": "The Very Low Frequency (VLF) band is located in the frequency range between 3 kHz and 30 kHz. This band has the unique characteristic of having a portion fall within the audio frequency range of our ears. In this range, there is a large spectrum of electromagnetic waves we cannot see. If we could see at these very low frequencies, we would be dazzled by electromagnetic emissions such as sferic, tweaks, whistlers, chorus and many more. These are natural radio waves or emissions coming from such common phenomena as lighting. VLF radio emissions can be received, amplified and turned into sound that we can hear. In this project, I designed and built very low frequency receiver system, which comprised of a VLF receiver, a 0.3 m by 0.3 m square loop antenna and an antenna tuning unit to receive these radio signals. The design of the receiver comprises of a combination of filtering (low-pass high-pass) and subsequent signal amplification. The signal is filtered to remove undesired out of band signal and amplified until the desired signals are strong enough to record on a portable audio recorder. The antenna consists of a wound wire on a wooden frame to transducer the magnetic field (B) of the received VLF electromagnetic waves. The RLC antenna tuner was connected between the receiver and the antenna in order to improve the efficiency of the signal transfer between them by matching the impedance of the receiver to that of the antenna. The receiver system was engineered, constructed and tested, and a variety of interesting VLF signals were recorded and analysed.",
        "platform": "Windows",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "eric.dankwa2@mail.dcu.ie",
                "name": "Eric Dankwa"
            }
        ],
        "supervisor": "Prof. Patrick McNally",
        "technology": "PCB, Pspice",
        "title": "Monitoring Very Low Frequency RF Emissions"
    },
    {
        "area": "Image/Video Processing, Software Development",
        "description": "Driver assistance systems have the potential to improve the driving experience for road users and also to increase safety on the roads. The purpose of this project is to create a vision based system which will automatically detect traffic light changes. The system processes video data acquired using a dash mounted camera and generates an audible beep whenever a traffic light change is detected. The system begins by looking for any changes which have occurred between the current frame and the frame that is two frames ahead of the current frame. Any changes between these frames are analysed to see if they are consistent with the changing of traffic lights. Features such as the colour of objects, the angle between objects and the distance between objects are used to determine if a traffic light change has occurred.",
        "platform": "Windows",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "kieran.boland4@mail.dcu.ie",
                "name": "Kieran Boland"
            }
        ],
        "supervisor": "Dr. Robert Sadleir",
        "technology": "Matlab, Java",
        "title": "A driver assistance system for automatically detecting traffic light changes"
    },
    {
        "area": "Mobile Robotics, None",
        "description": "The aim of this project was to build a fully automated GPS guided robot. It would be programmed on an Arduino board. At the start of the project the robot had two sonar sensors at the front to detect objects in front of it. A GPS unit for the Arduino was ordered from Radionics. This would receive the GPS coordinates. As the project progressed it became apparent that the GPS would not yield suffi cient accuracy to determine velocity and heading, so an electronic compass was ordered. An LCD screen was also ordered to help with debugging. After a lot of testing the end goal was fi nally achieved. Now the robot drives from the engineering building to the helix. It does this by travelling via various waypoints. When the robot is turned on, it waits for two minutes while it picks up the GPS signal and then determines its position. Then it drives at -165 degrees to North until it has driven through the wind tunnel. It turns right at 90 degrees and drives straight until it detects that it is at the end of the computer building. It turns and heads north until it reaches the Helix Theatre and then it stops. Despite this progress the machine is not suffi ciently robust. The robot can occasionally become stuck because of object which it cannot get around. It is also quite slow.",
        "platform": "Windows",
        "programme": "Mechatronic Engineering",
        "students": [
            {
                "email": "ronan.doolan2@mail.dcu.ie",
                "name": "Ronan Doolan"
            }
        ],
        "supervisor": "Dr. Sean Marlow",
        "technology": "C/C++, None",
        "title": "Outdoor autonomous GPS guided robot"
    },
    {
        "area": "Model View Controller, None",
        "description": "Linear Quarter Car Model Accuracy Abstract Linear quarter car suspension system is the most widely used car suspension system. In general car suspension system should provide a comfortable ride and a good handling. The suspension system is very important to isolate the car from the height frequencies Caused from the road surface, the tyre and the spring purpose is to suppress the vibration and the damper function is to control the energy dissipation. In this research a quarter car indoor rig is designed to simulate the MacPherson Strut car Suspension system .The rig is subjected to narrowband excitation frequencies to drive the cam Simulation carried out using the linear and nonlinear models and compared with the measured data from the rig. The results shows that the nonlinear simulation with a nonlinear shock absorber model and nonlinear tyre produces more accurate results compared to the linear simulation . Simulation carried out using steel bushing for 8HZ and 14 HZ frequencies, Changed the steel bushing into rubber bushing and compared the two result the result shows small improvement .",
        "platform": "",
        "programme": "Mechatronic Engineering",
        "students": [
            {
                "email": "bassam.hayyan2@mail.dcu.ie",
                "name": "Bassam Hayyan"
            }
        ],
        "supervisor": "Dr. Paul Young",
        "technology": "Matlab, None",
        "title": "Linear Quarter Car Model Accuracy"
    },
    {
        "area": "Gaming, None",
        "description": "The aim of this project was to create a computer game for allowing cystic fi brosis patients to improve the performance of their breathing exercises. The game utilizes a wearable breath sensor to record the breathing pattern of the patient as he/she plays the game. A calibration is fi rst performed at the beginning of the game so that a reference breath pattern could be recorded and used throughout the game. By comparing the actual breath pattern and the reference one the performance of the breathing exercise can be obtained. The new game is compared against an existing game and the initial user feedback is positive.",
        "platform": "Windows",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "haolin.wei2@mail.dcu.ie",
                "name": "Haolin Wei"
            }
        ],
        "supervisor": "Prof. Noel O'Connor",
        "technology": "C#, None",
        "title": "Development of a sensor-based computer game for skill acquisition"
    },
    {
        "area": "Home Automation, Web Application",
        "description": "The aim of this project was to develop an advanced home alarm system, using the Arduino platform, which could be accessed through the internet so that, among other functions, its status could be viewed and changed online. Arduino is an open-source electronics prototyping platform free for anybody to use. An Arduino can be used to develop interactive objects, taking inputs from a variety of switches or sensors, and controlling a variety of lights, motors, and other physical outputs. The particular board used for this project was the Arduino Duemilanove. The solution has been implemented using Java code, Arduino programming language and microcontroller boards. The alarm system is accessed through a web application where the user can carry out all the alarm functionality and check statuses. If an alarm zone is tripped, this is also displayed automatically on the web page. The Arduino is used along with, LED's, LDR's, buttons and resistors to detect, light and temperature and show alarm activity.",
        "platform": "Multi-platform",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "alison.clery3@mail.dcu.ie",
                "name": "Alison Clery"
            }
        ],
        "supervisor": "Dr. Derek Molloy",
        "technology": "Arduino, Java",
        "title": "Arduino Based Home Alarm System"
    },
    {
        "area": "Aerodynamics, Electronics",
        "description": "Angle of attack (AoA) is a term used in aerodynamics to describe the angle between the reference line (chord line) of a lifting body and the relative airfl ow. Lift is a fundamental factor in aircraft flight and lift coeffi cient varies as a function of angle of attack. Thus angle of attack is an important characteristic of aircraft flight. Essentially, increasing the angle of attack produces increased lift up to a point known as the critical angle of attack, the angle at which maximum lift is being generated. Beyond this point, lift decreases rapidly with increasing angle of attack, resulting in a stall. The purpose of an angle of attack indicator is to inform the pilot how close they are to reaching this critical angle of attack, hence stalling the aircraft. This project attempts to develop an angle of attack indicator which measures angle of attack using differential pressure measurements, confi rmed by wind tunnel testing. This information will then be presented through an appropriate angle of attack display which presents the required information in the pilot's peripheral vision.",
        "platform": "Windows",
        "programme": "Mechatronic Engineering",
        "students": [
            {
                "email": "david.kinsella5@mail.dcu.ie",
                "name": "David Kinsella"
            }
        ],
        "supervisor": "Dr. Noel Murphy",
        "technology": "Arduino microcontroller, Mechanical design of differential pressure pickups",
        "title": "Development of an Angle-of-Attack indicator"
    },
    {
        "area": "Image/Video Processing, None",
        "description": "According to the World Health Organization, more than 1.2 million lives are lost every year in road traffi c accidents. In Ireland alone in 2009, there were approximately 26,495 motor traffi c collisions on the country's roads of which 238 were fatal. The aim of this project is to implement a driver assistance system that automatically detects speed limits utilising a dashboard mounted camera to capture video data. From this data, image processing techniques are used to isolate and classify potential speed signs. The methods used for the detection stage include colour segmentation followed by morphological operations for classifying the signs. Adaptions to the algorithm were made for night-time detection, which included conversion to the HSI colour space for more effective detection, but the core algorithm existed for both. With the speed signs classifi ed, the system will then crosscheck the speed of the vehicle (calculated using GPS coordinates) and determine whether the user is above the speed limit. If so, the user will be warned that they are driving in excess of the speed limit and instructed to slow down. The potential for autonomous vehicles has been demonstrated by companies like Google and importantly provide the opportunity to save lives and reduce road collisions. This project has shown how the use of a vehicle based image processing system can also be used to assist the driver with the same goal of improving road safety and ultimately save lives.",
        "platform": "Windows",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "louis.ryan37@mail.dcu.ie",
                "name": "Louis Ryan"
            }
        ],
        "supervisor": "Dr. Robert Sadleir",
        "technology": "Matlab, None",
        "title": "A driver assistance system for automatically detecting speed limits"
    },
    {
        "area": "GPS/GIS, Image/Video Processing",
        "description": "Nowadays, Global Navigation Satellite System (GNSS) are widely used in our everyday life. The most common example is to estimate the location of road vehicles and provide navigation services using portable Global Positioning System (GPS) navigation devices. These GPS devices provide reliable location and time information by using a space-based global navigation satellite system (GNSS). However, current GPS devices have certain limitations i.e. they do not provide detailed lane-level navigation information. The purpose of this project was to develop a hybrid satellite navigation system to overcome this limitation by combining GPS navigation with image processing tools in order to provide lane level guidance information. To do this, the Java programming language has been selected as the primary development language and used in conjunction with Java Swing and Java Graphics2D. The completed system has been applied to real life complex scenarios with multiple lane motorways and has been show to deliver a suitable result.",
        "platform": "Multi-platform",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "cong.chen2@mail.dcu.ie",
                "name": "Cong Chen"
            }
        ],
        "supervisor": "Dr. Robert Sadleir",
        "technology": "Java, None",
        "title": "Development of a hybrid satellite navigation system"
    },
    {
        "area": "Embedded Systems, Sensor Technology",
        "description": "Everyday our society is collecting a vast amount of information. Our buying habits, our reading habits, where we go and who we talk to are all now being logged. It has become common to log our lives on the Internet. Photos are now being uploaded with GPS data (GEO tagging). Smart phone apps are logging our location and sharing it with our friends (Google Latitude) on line. Information collecting and sharing has now become the norm. Nowadays many of our day to day devices are location aware. Each of these giving us a little snapshot of our movement but none of them providing a complete analysis of our motion. This project researched and assess the needs of a complete embedded motion tracking system and developed a prototype. Location information is only one part of our movement. By using accelerometers, gyroscopes and a GPS this project has captured the full range of movement of an object.",
        "platform": "Multi-platform",
        "programme": "Digital Media Engineering",
        "students": [
            {
                "email": "jeffrey.roe3@mail.dcu.ie",
                "name": "Jeffrey Roe"
            }
        ],
        "supervisor": "Dr. Derek Molloy",
        "technology": "Arduino, JSP/Servlets",
        "title": "An Embedded Motion Capture Device"
    },
    {
        "area": "GPS/GIS, Sensor Technology",
        "description": "The project 'Ultra wideband based indoor location and tracking system' is used to track user in indoor environment. This project uses Ubisesne geo-location system, which is a type of ultra wideband system. There are Ubisense receivers at the corners of a room and it senses the ubisense tag. In this project, I have developed the canvas of the room (L128) of the computing building with its full structure including tables, windows and doors. The user walks in the room with the tag and the receivers sense the tag and a red dot shows where the person is on the canvas. The red dot moves with the person. This application can be used in different forms. It could be used to track kids in building or shopping centres so that the parents can't loose their kids. Teachers can also use it so no student can leave their class. It can also be used to track pets at home or some other place. It can be used by firefighters to track people in a building in fire and save them. Shops can use it track mobile phones of the customers within a specific range and send them the special offers and the customers can also find where they are at present.",
        "platform": "Multi-platform",
        "programme": "Info and Communications Engineering",
        "students": [
            {
                "email": "param.singh2@mail.dcu.ie",
                "name": "Paramveer Singh"
            }
        ],
        "supervisor": "DR. Conor Brennan",
        "technology": "Java, HTML",
        "title": "Ultrawideband based indoor location and tracking system."
    },
    {
        "area": "Renewable Energy, None",
        "description": "Energy reserves are becoming very scarce. The demand for energy will also increase rapidly to about 60% in 20 years time. This will even reduce the time span of the available supplies. The quandary has been intensified by the mounting need of energy in Asia and Near East where the largest deposits of oil and gas exit. Without a thought electricity is one of the basic necessities of mankind. As the demand of electricity is increasing day by day, there is need to exploit renewable energy sources of energy. The use of solar energy could be another source of energy of renewable energy beneficial to a greater extent. The project proposes a possible design and implementation of an efficient algorithm for power extraction from solar panel. The goal of the project is to fully implement a DC load by sourcing power from a battery, which is charged with a photovoltaic system; a charged controller and a controlled step-up power converter for a constant voltage. This implementation hopes to provide a renewable source (solar energy) and improve the efficient use of the energy source.",
        "platform": "Windows",
        "programme": "Electronic Engineering",
        "students": [
            {
                "email": "temidayo.olowoniyi2@mail.dcu.ie",
                "name": "Temidayo Olowoniyi"
            }
        ],
        "supervisor": "Dr. Stephen Daniels",
        "technology": "Matlab, None",
        "title": "Photovoltaic (PV) panel for stand alone DC load"
    }
]