    [
    {
        "area": "Model View Controller, Software Development, Web Application",
        "description": "CryptoCert is a Blockchain-powered web application, which enables companies and other entities to provide clients with secure and verifiable certifications. An entity or Certificate Authority (CA) representative (rep) can interact with CryptoCert's private blockchain either through the web application, or manually by setting up a node to listen in on the blockchain. CryptoCert also implements SAML authentication, so your company rep can verify themselves via your authentication portal.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "cathal.conroy25@mail.dcu.ie",
            "name": "Cathal Conroy"
        }
        ],
        "supervisor": "Geoff Hamilton",
        "technology": "JQuery, MySQL, Python, SQL, Ethereum, Solidity, Django, AWS, SAML",
        "title": "CrpyptoCert"
    },
    {
        "area": "Energy Conservation",
        "description": "This project deals with energy consumption and energy management in cleanrooms. The aim of this project is to reduce energy usage, carbon footprint and costs, while maintaining the required environmental conditions. This project examines the current control strategy and operation of the cleanroom and also analysing the current energy consumption and environmental conditions. This project involves identifying possible opportunities for energy savings that will reduce the annual cost of operating the cleanrooms.",
        "programme": "Manufacturing Engineering with Business",
        "students": [
        {
            "email": "sean.giles3@mail.dcu.ie",
            "name": "Sean Giles"
        }
        ],
        "supervisor": "Lorna.Fitzsimons@dcu.ie",
        "technology": "Cyclon Active Energy",
        "title": "Energy Efficiency for Cleanrooms: Modelling Energy Requirements"
    },
    {
        "area": "Software Development, Mobile App, Computer Vision, Artificial Intelligence, Android",
        "description": "This project is an easy to use Android Application that allows users to snap a picture of numerous famous landmarks worldwide, with the image then acting as the input for a pre-trained and tested Convolutional Neural Network (CNN). Upon the CNN identifying the image, the user is then presented with interesting facts about the landmark. Travel-lovers worldwide now have the ability to learn about the famous landmarks they visit at the touch of a button.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "cathal.neary2@mail.dcu.ie",
            "name": "Cathal Neary"
        }
        ],
        "supervisor": "Alistair.Sutherland@dcu.ie",
        "technology": "XML, Python, Java, Eclipse",
        "title": "SightSeer Android Application"
    },
    {
        "area": "Mechanical Design and Manufacture, Automotive Technology",
        "description": "This project looks to improve the damper test method used during the NCT. A test rig was constructed to determine the damping rate of a model car suspension for each individual damper. Accelerometers were used with LabVIEW to produce the suspension response of the car.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "derek.dunne28@mail.dcu.ie",
            "name": "Derek Dunne"
        }
        ],
        "supervisor": "Paul.Young@dcu.ie",
        "technology": "Solidworks, Matlab, LabVIEW",
        "title": "Development of Test Rig to evaluate suspension dampers in line with the NCT test"
    },
    {
        "area": "Android, Database, Mobile App",
        "description": "DigiStay is a mobile application designed to improve the overall hotel experience for both hotels and their guests. The app aims to reduce time at reception by digitalising the check-in process. The application generates a QR Code with the user's data, which will be encrypted and will only be decrypted by the sister application.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "rebecca.fenlon2@mail.dcu.ie",
            "name": "Rebecca Fenlon"
        }
        ],
        "supervisor": "Markus.Helfert@dcu.ie",
        "technology": "Java, SQL, XML, QR Code",
        "title": "DigiStay"
    },
    {
        "area": "Web Application",
        "description": "This Web Application Tegasc Dom is to provide primary school students an interactive platform to identify key parts of speech in Irish. The pupils teacher will have access to the application and can delegate tasks to specific Users to be completed. A text file will be passed into a language parser which can pick all the different forms of speech within the file. The parsed file will be passed to student who will in turn answer questions regarding the sentence.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "robert.oconnor47@mail.dcu.ie",
            "name": "Robert O'Connor"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "SQL, REST, PHP, MySQL, JavaScript, HTML5, CSS",
        "title": "Tegasc Dom"
    },
    {
        "area": "Device Design, Educational, Arduino, Sensor Data, Software Development",
        "description": "The aim of the project is to allow 1970's communication technology work with a modern micro controller. Punch tape, an early form of data storage, is the communication medium and the tape reader is the piece of technology which had to be restored to working order. The system was built to output the punch tape message to an LCD screen. The project involves retrofitting design, C++ coding, SolidWorks modelling and extensive testing and analysis.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "matthew.symth42@mail.dcu.ie",
            "name": "Matthew Symth"
        }
        ],
        "supervisor": "Ronan.Scaife@dcu.ie",
        "technology": "C/C++, Solidworks",
        "title": "RS19 - Punched Paper-Tape Reader"
    },
    {
        "area": "Android, Cloud Computing, Distributed Systems, Information Retrieval, Mobile App, Multimedia, Software Development, Social Networking, Speech Recognition",
        "description": "Chirpy is a new novice social network. It allows users to share updates with speech rather than traditional text. Chirpy aims to reduce the amount of time people waste on social media. By providing a alternative way of receiving updates via speech, the user can focus on other tasks without being distracted. Built using Twitter and Google Drive APIs, we give the power back to the user by giving them the option to modify/delete any data that they share.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "seamus.kelly237@mail.dcu.ie",
            "name": "Robert O'Connor"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "Java, Oracle, REST, XML",
        "title": "Chirpy - The spoken social network"
    },
    {
        "area": "3-D Modelling, Device Design, Fluid Mechanics, Mechanical Design andManufacture, Thermodynamics",
        "description": "This project investigates noise that is being created inside a cistern/water-tank produced when refilling froma valve with a ball-cock attached. The noise created by the refilling was investigated and new devices were designed to combat the noise issue. Components were modelled using SolidWorks and manufactured using 3D printing. Decibel readings were recorded for each concept to analyse the reduction of noise.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "keith.timmons2@mail.dcu.ie",
            "name": "Keith Timmons"
        }
        ],
        "supervisor": "Brian.Corcoran@dcu.ie",
        "technology": "Solidworks",
        "title": "Cistern Noise Reduction Device & Water Hammer"
    },
    {
        "area": "Android",
        "description": "A POC Android App aimed primarily at Children with Diabetes and their parents/guardians. It provides an easy and friendly vehicle to help children with this condition manage their sugar levels, diet, and insulin administration, thereby reducing the amount of stress usually associated with this condition, particularly in the early stages. In addition, it allows parents to have access to the required information, such as sugar levels, while providing them with live updates of blood sugar readings as they are taken.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "dean.lalor4@mail.dcu.ie",
            "name": "Dean Lalor"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "Java, XML",
        "title": "Diabetes Management Android App for Children and Parents"
    },
    {
        "area": "Android, Arduino, GPS GIS, Mobile App",
        "description": "This project is a bicycle navigation system which will allow cyclists to easily and safely tell the direction of their desired location. A small arduino powered LED display device located in the middle of the bicycle'shandle bars which indicates the correct direction. The device works wirelessly over bluetooth in conjunction with a mobile application for Android smartphones which reads gpx files to guide the user along their route.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "cillian.rice8@mail.dcu.ie",
            "name": "Cillian Rice"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "Java, XML",
        "title": "Bicycle Navigation System"
    },
    {
        "area": "Renewable Energy Technology, Optical Communications",
        "description": "The reflectance of sunlight from the surface of a solar cell is a significant limiting factor in terms of overall efficiency. Existing anti-reflection coatings are expensive to produce and do not eliminate reflectance completely. A novel approach based on the anti reflection properties of a moth's eye is examined to simulatea cost effective, low reflectance coating. A simulation is developed and then tested for solar cell application. The fabrication process of such a coating is also examined in detail.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "fergal.conlon3@mail.dcu.ie",
            "name": "Fergal Conlon"
        }
        ],
        "supervisor": "Pascal.Landais@dcu.ie",
        "technology": "Matlab",
        "title": "A Novel Anti Reflection Coating for a Solar Cell"
    },
    {
        "area": "3-D Modelling, Device Design, Mechanical Design and Manufacture",
        "description": "This project involves redesigning a turf testing device which tests the pitch performance under different load conditions. The project was carried out in affiliation with Croke Park and is designed based on the design specifications received from the pitch manager. The tests involve measuring the torque required to rotate various types of boot stud arrangements on different surfaces. The device is designed that only 30kg is applied at a given time, regardless of the users weight allowing consistent, reproducible results.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "karl.morgan4@mail.dcu.ie",
            "name": "Karl Morgan"
        }
        ],
        "supervisor": "Brian.Corcoran@dcu.ie",
        "technology": "Solidworks",
        "title": "Croke Park Turf Testing Device"
    },
    {
        "area": "Gaming",
        "description": "My project is a 3D first person game that has a sci fi setting. The player must advance through each level of the game by battling against AI controlled opponents. The game utilises the Godot game engine and the logic of the game is written in GDScript which is a python like scripting language used to program for the Godotengine.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "owen.flynn8@mail.dcu.ie",
            "name": "Owen Flynn"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "Godot, GDScript",
        "title": "Sci Fi Game"
    },
    {
        "area": "3-D Modelling, Automotive Technology, Mechanical Design and Manufacture, Motion Analysis, Vehicle Contro",
        "description": "The aim of this project was to produce a new chassis capable of competing in the Formula IET F24+racing category of the Greenpower racing series. The design was required to adhere to specific rules and regulations and offer enhanced performance over the car currently in use by DCU. Through studying the reaction forces when accelerating, braking and turning the characteristics and performance of the new chassis could be quantified and compared to the current chassis.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "sean.brady52@mail.dcu.ie",
            "name": "Sean Brady"
        }
        ],
        "supervisor": "Paul.Young@dcu.ie",
        "technology": "Excel/VB, Solidworks",
        "title": "Design of Rear Chassis and Drivetrain Components for Greenpower Project"
    },
    {
        "area": "Mobile App",
        "description": "ParkShark is a mobile application which aims to revolutionise the traditional parking system by introducing modern technologies such as predictive analytics, and automatic geo-location. ParkShark will help with load balancing across city centre parking locations by offering variable tariffs at competitive prices to its users, based on a pay per demand system. This is driven by an econometric model of parking revenue based on a survey of user acceptance of variable tariffs.",
        "programme": "Enterprise Computing ",
        "students": [
        {
            "email": "bronagh.hennessy6@mail.dcu.ie",
            "name": "Bronagh Hennessy"
        },
        {
            "email": "darina.costelloe23@mail.dcu.ie",
            "name": "Darina Costelloe"
        }
        ],
        "supervisor": "Alan.Smeaton@dcu.ie",
        "technology": "Java, Android SDK",
        "title": "ParkShark"
    },
    {
        "area": "Advanced Material Engineering, Biomedical Engineering",
        "description": "A carrier of genetic material in gene therapy is referred to as a vector. Viruses are usually used as vectors due to their high transfection efficiency, dangers associated with using viral vectors have resulted in more research into using non-viral vectors for gene therapies. A material of rising interest in this area is hydroxyapatite. The aim of this project was to optimise the drying process of hydroxyapatite to createa nano-particle which is ideal for the purpose of gene delivery",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "elizabeth.akintola2@mail.dcu.ie",
            "name": "Elizabeth Akintola"
        }
        ],
        "supervisor": "Tanya.Levingstone@dcu.ie",
        "technology": "none",
        "title": "Fabrication and characterisation of Nano sized hydroxyapatite particles for useas non-viral vectors for gene delivery."
    },
    {
        "area": "Water Treatment",
        "description": "This project involved conducting a detailed cost benefit analysis of several process changes carried out at the Anglo Beef Processors wastewater treatment plant in Cahir Co. Tipperary as part of the Exemplar Project. This cost benefit analysis involved learning about and collecting data from the different processes identified at the plant and identifying the main energy consumers and costs associated with these processes. The existing processes were then compared to planned and completed process changes to carry out a cost analysis.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "christopher.doogan2@mail.dcu.ie",
            "name": "Christopher Doogan"
        }
        ],
        "supervisor": "Lorna.Fitzsimons@dcu.ie",
        "technology": "Excel/VB",
        "title": "Cost Benefit Analysis of a Wastewater Treatment Plant"
    },
    {
        "area": "Android, Data Analytics, Data Mining, Statistical Analysis",
        "description": "A basketball team uses the developed Android application as a tool to record statistics about their team during a live game. Statistics are recorded by one person using the application and entering each event by a number of quick and simple taps. All recorded statistics are then analysed. Developed functions automatically produce reports on a team and each player on the team. These reports enable teams to see their weaknesses/strengths, providing them with a chance to improve their game.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "brian.kilduff3@mail.dcu.ie",
            "name": "Brian Kilduff"
        }
        ],
        "supervisor": "Mark.Roantree@dcu.ie",
        "technology": "Eclipse, Java, Node.js",
        "title": "Basketball Statistics Collector and Analyser"
    },
    {
        "area": "Computer Vision, Information Retrieval, Image Video Processing, Multimedia, Software Development",
        "description": "The creation of multi-sensory media (mulsemedia) content is a tedious and complicated process. This project aims to accomplish easing this through the use of a user interface and video analysis techniques. The user interface allows users to create mulsemedia files for a video in real-time while the analysis tool automatically detects objects that can be related to mulsemedia effects and adds the associated effect. i.e. outputting the smell of a rose when a rose is in frame.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "cathal.oreilly77@mail.dcu.ie",
            "name": "Cathal OReilly"
        }
        ],
        "supervisor": "Gabriel.Miuntean@dcu.ie",
        "technology": "Eclipse, Java, Python, XML, JSON",
        "title": "Enabling Adaptation of Mulsemedia Content"
    },
    {
        "area": "Android, Cloud Computing, Cryptography, Databases, Distributed Systems, Information Retrieval, Mobile App, Security, Software Development, WebApplication",
        "description": "This platform is designed to return the power of ones identity back to the user. This is a challenge, asproving a person's identity is difficult in a world where private information is shared online daily. Based on a client-server architecture, the user will interact with an Android application, which stores digital, verified documents issued by bodies such as the Passport Authority. Verification of ones identity will use of a distributed, tamper-resistant solution called the Blockchain.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "cillian.mcneill2@mail.dcu.ie",
            "name": "Cillian Mc Neill"
        }
        ],
        "supervisor": "Geoff.Hamilton@dcu.ie",
        "technology": "AngularJS, CSS, Docker, Go, HTML5, Java, JavaScript, MySQL, Node.js, Json, Maven, Swagger, Junit, Cucumber, Sonar, Android",
        "title": "MiD - My Identity"
    },
    {
        "area": "Water Treatment",
        "description": "This project investigates all the possible types of diffused air aeration systems that could be used at the Blessington street basin. This project aims to improve the water quality of the water in the basin by using alow cost but energy efficient diffused air aeration system. This system will introduce more dissolved oxygen into the water and as a result improve the quality of the water in the basin.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "john.brady38@mail.dcu.ie",
            "name": "John Brady"
        }
        ],
        "supervisor": "Lorna.Fitzsimons@dcu.ie",
        "technology": "Excel/VB",
        "title": "A Diffused Air Aeration System to be used at Blessington Street Basin"
    },
    {
        "area": "Information Retrieval, Web Application",
        "description": "While significant research has been focused on finding images and video clips using image-based examples, far less attention has been paid to searching using audio queries. This project involves building a query by example system that allows a user to search in a large audiovisual collection by providing an audio example via a microphone. The system will then rank the video clips by similarity to the provided sounds and display the top-ranked videos via a custom web app.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "emi.bumanglag2@mail.dcu.ie",
            "name": "Emi Janela Bumanglag"
        }
        ],
        "supervisor": "Kevin.McGuinness@dcu.ie",
        "technology": "Python",
        "title": "A sound similarity search engine for audiovisual archives"
    },
    {
        "area": "Mobile App",
        "description": "Just Ask is a Question-Answer app, where users are Anonymous. The app is location based and also provides a feature of private chat which most similar apps don't do. The AI detects any hate speech that may be used against other users for a more friendly sociable experience. The AI will also predict questions for the right users based on their interests. So now there is no need to keep them embarrassing questions to yourself, you can Just Ask it.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "ali.raza2@mail.dcu.ie",
            "name": "Ali Raza"
        }
        ],
        "supervisor": "Mark.Roantree@dcu.ie",
        "technology": "Swift, Firebase, Twitter API, Xcode, Artificial Intelligence",
        "title": "Just Ask"
    },
    {
        "area": "Educational, Internet of Things, RaspberryPi",
        "description": "The intended outcome for this project was to research the applications of a Raspberry Pi based interface. The project will research and develop an early pre-prototype electronic touchscreen interface. Focusing on the RPi's ability to be used as the Single Board Computer for the device. The intended end users for the interface are those who are not technologically inclined.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "shane.hoare2@mail.dcu.ie",
            "name": "Shane Hoare"
        }
        ],
        "supervisor": "Alan.Kennedy@dcu.ie",
        "technology": "Python, Solidworks",
        "title": "Applications of a Raspberry Pi Based Interface"
    },
    {
        "area": "Optical Character Recognition, Mobile App, Android, Computer Vision",
        "description": "This project is developed to help assist the visually impaired with their daily lives. We plan to help these individuals by identifying different objects for them such as faces, text, and handwriting. Once identified it will then call out the result of the query to let the user know what was captured. This app is available on Android and works by using your smartphone camera to capture images or by using previously saved images.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "amirsad.zalli2@mail.dcu.ie",
            "name": "Amirsad Zalli"
        },
        {
            "email": "fionn.fitzgibbon2@mail.dcu.ie",
            "name": "Fionn Fitzgibbon"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "Java",
        "title": "SmartSight - Visual Assistive Technology"
    },
    {
        "area": "Fluid Mechanics, Motion Analysis",
        "description": "This project investigates the behaviour of a range of adhesives as they cure over time. They are tested using a Micro-Fourier Rheometer (MFR). As well as testing the behaviour of the adhesives, this project also involved the design and manufacture of a small rig to be incorporated onto the MFR to allow for simpler removal of the adhesives when testing is complete.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "niall.gilsenan",
            "name": "Niall Gilsenan"
        }
        ],
        "supervisor": "Harold.Esmond@dcu.ie",
        "technology": "Solidworks, MFR2100",
        "title": "Testing of Curing Adhesives"
    },
    {
        "area": "Software Development, Robotics, Sensor Technology, Sensor Data, MechatronicSystems, Mechanical Design and Manufacture, Environmental Mapping, EmbeddedSystems",
        "description": "This project investigated the use of low-cost Time-Of-Flight laser-ranging modules to design a cost-effective Lidar scanner for near-range 3D imaging. The project involved the design of a scanner drive motor control system and development of software for interfacing with the ranging module. Software was then developed to interface the device with a PC for data processing and (near) real-time 3D display of the scanned field.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "ahmed.ibrahim4@mail.dcu.ie",
            "name": "Ahmed Ibhrahim"
        }
        ],
        "supervisor": "Conor.McArdle@dcu.ie",
        "technology": "Matlab, Java, Solidworks, OpenGL, C/C++",
        "title": "A Low-Cost Near-Range Lidar Scanner"
    },
    {
        "area": "Cryptography, Distributed Systems, Internet of Things, RaspberryPi, Sensor Data",
        "description": "The number of internet connected devices is expected to reach 24 billion by 2020 but IoT is riddled with major vulnerabilities. Privacy, authentication, security and most importantly scalability are major barriers for the mass adoption of IoT. The goal is to explore the possibilities/advantages of using Blockchain technology in the context of IoT. Blockchain and IoT offers a new world of promise. This project investigates IOTA, decentralised distributed ledger, that aims to support the growing needs of huge IoT ecosystems.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "sunayana.kantimahanthi2@mail.dcu.ie",
            "name": "Sunayana Kantimahanthi"
        }
        ],
        "supervisor": "Martin.Collier@dcu.ie",
        "technology": "Docker, JavaScript, Node.js, Python",
        "title": "Blockchain & IoT: Using Peer-to-Peer Capabilities of a Distributed Ledger toValidate and Transfer Data"
    },
    {
        "area": "Databases, Web Application",
        "description": "Pennywise aims to foster a culture of personal saving and investing in a passive and automatic way. It is a fact that today we are simply not saving enough for the future. Pennywise has the solution: Micro-investing. By rounding up your bank card purchases as you spend and funnelling the balance into your digital savings wallet or personalised investment portfolio, Pennywise will turn your digital spare change into something much more secure for your financial future.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "gavin.connorton4@mail.dcu.ie",
            "name": "Gavin Connorton"
        },
        {
            "email": "connor.mcgrath42@mail.dcu.ie",
            "name": "Connor McGrath"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "HTML5, JavaScript, JQuery, MySQL, PHP, SQL",
        "title": "Pennywise - The Micro-investing Platform"
    },
    {
        "area": "Software Development, Embedded Systems, Circuit Modeling",
        "description": "This project investigates the possibility of using a 200MHz 32-bit microcontroller paired with a 16-bit analog-digital converter to create a low-cost high-performance electronic drum module capable of performing complex digital signal processing. This project provides a comprehensive introduction to the PIC32 microcontroller using the MPLAB X IDE as a development platform. This project also investigates MPLAB Harmony, a framework which provides a set of peripheral, driver and system libraries that are fully configurable through a graphic user interface (GUI).",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "connor.shirren2@mail.dcu.ie",
            "name": "Connor Shirren"
        }
        ],
        "supervisor": "Alan.Kennedy@dcu.ie",
        "technology": "C/C++, MPLAB X IDE, MPLAB Harmony, MIDI",
        "title": "Electronic Drum Module"
    },
    {
        "area": "Biomedical Engineering",
        "description": "This project aims to develop a replacement material for the current percutaneous coronary intervention, coronary metallic stent. The goal of the material is to degrade over time leaving a fully healed and remodelled coronary artery. The replacement material examined is sodium alginate. The project produces a hydrogel by crosslinking sodium alginate, calcium chloride and glucono-delta-lactone (GDL). Samples of the hydrogel were tested for setting time and degradation, these samples varied in water concentrationand GDL to calcium chloride ratio.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "mieke.kiernan23@mail.dcu.ie",
            "name": "Mieke Kiernan"
        }
        ],
        "supervisor": "Owen.Clarke@dcu.ie",
        "technology": "none",
        "title": "Development of a device/material to replace or augment the existing coronarystent which will inhibit or reduce cardiac reperfusion injuries"
    },
    {
        "area": "Gaming",
        "description": "The project is about helping primary school students to not only understand mathematics but to also master it with the help of our super hero who is travelling to his own home planet. While travelling home he'll be facing number of obstacles which can only be solved by answering the Mathematical equations. With this game teacher will be able to monitor the progress in Mathematics for each primary school student with the help of the scores they are getting.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "arpit.chaudhary2@mail.dcu.ie",
            "name": "Arpit Chaudhary"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "Java",
        "title": "Mathematics for Primary School"
    },
    {
        "area": "Cryptography, Internet of Things",
        "description": "Blockchain technology has been proposed as a possible solution to the issue of secure and provable peer-to-peer data exchange. One issue associated with the Blockchain approach is that the computation and storage requirements are likely too demanding for low-power low-cost devices which populate the IoT-edge. This project aims to examine the requirements for implementing Blockchain technology for secureand provable peer-to-peer data transactions, to determine the constraints on resource-limited devices, to propose alternative approaches, and to simulate and test these.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "malachy.brennan73@mail.dcu.ie",
            "name": "Malachy Brennan"
        }
        ],
        "supervisor": "Noel.Murphy@dcu.ie",
        "technology": "Ethereum, IPFS, JavaScript, Solidity",
        "title": "Adaptation of Blockchain Technology for Secure Peer-to-Peer IoT Data Exchange"
    },
    {
        "area": "Mobile App, Web Application",
        "description": "If something is unavailable for purchase online it will, more than likely be unavailable for delivery also. The objective of fetcher is to make anything available for the user from the comfort of their own home. The user selects the location their item needs to be collected from, people with the fetcher application, near that location receive a push notification. These people may bid on the advert and then if accepted they will collect and deliver the item.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "damien.mcglynn5@mail.dcu.ie",
            "name": "Damien McGlynn"
        },
        {
            "email": "jack.bentley5@mail.dcu.ie",
            "name": "Jack Bentley"
        },
        {
            "email": "kevin.lynam3@mail.dcu.ie",
            "name": "Kevin Lynam"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "CSS, Java, JavaScript, MySQL, PHP",
        "title": "Fetcher"
    },
    {
        "area": "Data Analytics, Artificial Intelligence",
        "description": "Finwhiz is a web application for financial market analysis like Forex and Cryptocurrency. The goal of this application is to ensure users, especially amateurs are able to understand the market trends and the relationships between their interested securities. This goal is achieved by implementing interactive data visualisations and analytical functions like anomaly and correlation. Through the use of this app the user can strategize better, gain faster understanding of the trends of the market and reduce investment risks.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "lisa.koilparambil2@mail.dcu.ie",
            "name": "Lisa Koilparambil"
        }
        ],
        "supervisor": "Andrew.McCarren@dcu.ie",
        "technology": "Python, Bootstrap, Node.js, MySQL, JavaScript",
        "title": "Finwhiz - Financial Market Analysis web app"
    },
    {
        "area": "Software Development, RaspberryPi, Embedded Systems, Circuit Modeling, Mechatronic Systems, Arduino",
        "description": "This project aims to develop a dummy wind instrument and software that will convert key presses and blowing pressure to MIDI signals. These MIDI signals will then be sent to a MIDI synthesizer to control the notes that are being played. The use of two different controllers was investigated; The Raspberry Pi and the Arduino. The project was ultimately achieved using an Arduino as the microcontroller, copper windings as the keys and a pressure sensor for the blowing pressure.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "luke.crawley2@mail.dcu.ie",
            "name": "Luke Crawley"
        }
        ],
        "supervisor": "Ronan.Scaife@dcu.ie",
        "technology": "C/C++",
        "title": "MIDI Wind Controller"
    },
    {
        "area": "Software Development, Optical Character Recognition, Image Video Processing, Computer Vision",
        "description": "The aim is to perform optical music recognition allowing a user to input an image of a sheet of music and have the program output a music file. This python program uses image processing techniques to extract individual music symbols. A convolutional neural network built using the Keras library on a TensorFlow backend is used to identify the symbol. Once identified, the symbols are fed into a music notation model which will output a MIDI file.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "shuta.minaguchi3@mail.dcu.ie",
            "name": "Shunta Minaguchi"
        }
        ],
        "supervisor": "Alistair.Sutherland@dcu.ie",
        "technology": "Python",
        "title": "Sheet Music Reader"
    },
    {
        "area": "Image Video Processing, Embedded Systems, Computer Vision, Automation, Artificial Intelligence",
        "description": "This project implements a person re-identification system using the Movidius Neural Compute Stick. The solution uses a convolutional neural network (CNN) for representation extraction on the device, and fast lookup techniques to determine if a person has been seen before by the system, and updates the system's database accordingly. The project is developed using Python and the Caffe framework for the CNN.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "zeynep.tugrul2@mail.dcu.ie",
            "name": "Zeynep Naz Tugrul"
        }
        ],
        "supervisor": "Kevin.McGuinness@dcu.ie",
        "technology": "Python",
        "title": "Person Re-identification on a Neural Compute Stick"
    },
    {
        "area": "Statistical Analysis",
        "description": "Many six sigma statistical tools and procedures (such as ANOVA) are based on an underlying assumption that the data follows a normal distribution or a Gaussian distribution. Therefore, before these procedures and tools can be applied, it is essential for the data set to be tested in advance for normality. A number ofthese normality tests are used in this project. Their capabilities and limitations are analysed and compared.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "padraig.mccahey3@mail.dcu.ie",
            "name": "Padraig McCahey"
        }
        ],
        "supervisor": "Tamas.Szecsi@dcu.ie",
        "technology": "Excel/VB",
        "title": "Normality Test Analysis"
    },
    {
        "area": "Web Application",
        "description": "My Project is a web based application. Which is student and lecturer portal. This website was built because I believe there should be better interaction between Students and Lecturers. Using this website the lecturer can take attendance and distribute class material like (exercise sheet). Lecturer can create an assignment with specific date and time. This portal allows the student to post anonymous question to lecturer and track their progress in an assignment. These are just few features.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "rupak.thapa2@mail.dcu.ie",
            "name": "Rupak Thapa"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "PHP, REST, XML, MySQL, JavaScript, HTML5",
        "title": "Unistart"
    },
    {
        "area": "Arduino, Control Systems, Data Analytics, Internet of Things, Sensor Data, SensorTechnology",
        "description": "Sensor fusion is the combination of multiple sensors to improve the performance of a system through the use of software-based methods. This project combines accelerometer and gyroscope data to performsensor fusion using MATLAB software. The Kalman filter and Complementary filter sensor fusion models are applied to provide a real-time attitude estimation of the sensor system. The IoT platform ThingSpeakis also examined as a sensory data analysis tool in the cloud.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "robert.beirne3@mail.dcu.ie",
            "name": "Robert Beirne"
        }
        ],
        "supervisor": "Jennifier.Bruton@dcu.ie",
        "technology": "Matlab",
        "title": "The Internet of Things: A sensor fusion application using MATLAB and ThingSpeak"
    },
    {
        "area": "Android, Cryptography, Mobile App, Web Application",
        "description": "The aim of this project is to create a password manager that will speed up initial use of a machine. The application allows a user to pull their login credentials, via an NFC device, from their personal machine and store them securely on their Android device. When the user moves to a new machine, they can send their credentials to it via an NFC device. The credentials will be populated in the login fields when they visit the relevant website.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "daniel.holton2@mail.dcu.ie",
            "name": "Daniel Holton"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "SQLite, MySQL, JavaScript, Java",
        "title": "NFC-Capable Password Storage Application"
    },
    {
        "area": "Electric Generation, Renewable Energy Technology, Simulation",
        "description": "This project provides analysis of the issues facing large-scale renewable energy integration in Ireland between 2020-2030. Renewable energy sources are expected to account for 60-70% of electricity generation by 2030. Specifically, the problem of curtailment of variable sources of electricity generation such as windwas examined. Using an Irish electricity system model developed by ABO Wind Ireland, simulations were run for a 70% share of renewable electricity generation to estimate curtailments and various mitigation strategies were explored to reduce curtailment.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "connor.forde9@mail.dcu.ie",
            "name": "Connor Forde"
        }
        ],
        "supervisor": "James.Carton@dcu.ie",
        "technology": "Excel/VB",
        "title": "Analysing the challenges faced with large scale renewable energy integration inIreland"
    },
    {
        "area": "E-Commerce, Web Application",
        "description": "ICOHub is a unique and innovative investment platform that allows startup companies to launch an ICOtoken without any blockchain knowledge. ICOHub offers a package of services to investors allowing them invest in start-up company's with ease.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "aaron.gillespie6@mail.dcu.ie",
            "name": "Aaron Gillespie"
        },
        {
            "email": "evan.doherty38@mail.dcu.ie",
            "name": "Evan Doherty"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, PHP, Blockchain",
        "title": "ICOHub"
    },
    {
        "area": "Android, Augmented Reality, Computer Vision, Image Video Processing, Mobile App",
        "description": "Augmented Reality combines virtual content with the real world to provide an enhanced perception of our reality. The reality explored in this project is someone struggling with the navigation of a complex indoor building. This project develops an Android application which adds virtual objects to aid in navigation of such environments.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "john.ocallaghan23@mail.dcu.ie",
            "name": "John O Callagahan"
        }
        ],
        "supervisor": "Robert.Sadleir@dcu.ie",
        "technology": "Java",
        "title": "An augmented reality pedestrian navigation system"
    },
    {
        "area": "Biomedical Engineering",
        "description": "The primary objective of the project is measure the level of tack (stickiness) of pressure sensitive adhesives (PSA's) that are used for wound care applications. The tack was measured using a probe tack test experimenting on surgical tapes and bandages that are found on the consumer market. The JKR theory was applied to the adhesive samples for comparison of the theoretical versus the actual results obtained. Finally, a standalone unit was designed to conduct the test on an individual's forearm.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "mark.mcdonald72@mail.dcu.ie",
            "name": "Mark McDonald"
        }
        ],
        "supervisor": "Garrett.McGuinness@dcu.ie",
        "technology": "Solidworks",
        "title": "Development of a Probe Tack Experiment for Measuring the Adhesiveness ofBiomaterials"
    },
    {
        "area": "Sensor Data",
        "description": "Direct writing of electronic structures will be examined via the Confined Atmospheric Pulsed-laserdeposition (CAP). As nanotechnology has developed, the creation of nano-structured surfaces has garnered attention for their application in sensing and catalysis. These are however often expensive, time-consuming, and difficult to produce. In contrast, this investigation is focused on the inexpensive, environmentally friendly, and fast technique of Confined Atmospheric Pulsed-laser deposition by altering the process parameters with a view to optimise electronic structure deposition.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "louis.ronan4@mail.dcu.ie",
            "name": "Louis Ronan"
        }
        ],
        "supervisor": "Dermot.Brabazon@dcu.ie",
        "technology": "LabVIEW, Design Expert 7",
        "title": "Confined Atmospheric Pulsed Laser Deposition"
    },
    {
        "area": "Web Application, Social Networking, Databases, Data Mining, Model ViewController, Software Development",
        "description": "This project is a social media bot to help people who have set up a community on Reddit prevent 'brigades' of users who belong to other communities from flooding the discussion. The bot collects a sample of comments from another community set by the user and trains a machine learning model, allowing it to detect and remove comments that are similar to the comments from the other community.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "adam.pegman2@mail.dcu.ie",
            "name": "Adam Pegman"
        }
        ],
        "supervisor": "Ray.Walsh@dcu.ie",
        "technology": "CSS, HTML5, Java, SpringMVC, SQLite",
        "title": "Detecting brigading on social media with machine learning."
    },
    {
        "area": "Energy Conservation",
        "description": "Hydrogen fuel cells are an attractive source of energy, as they are environmentally friendly and they produce energy with higher efficiency compared to batteries. Hydrogen can be produced in small quantities via the decomposition of water via a metal-water chemical reaction, the produced hydrogen can be employed to power fuel cells for portable applications. This project focuses on the selection of the finest metal for hydrogen production under suitable experimental parameters that are optimised using DOE methods.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "maryam.alsaqry2@mail.dcu.ie",
            "name": "Maryam AlSaqry"
        }
        ],
        "supervisor": "James.Carton@dcu.ie",
        "technology": "DOE methods",
        "title": "Fuel Cell Storage"
    },
    {
        "area": "Tissue Engineering, Biomedical Engineering",
        "description": "A research & development based project that aims to develop an anterior cruciate ligament (ACL) prosthesisto eliminate the current issues surrounding ACL reconstruction surgeries. Polyvinyl alcohol (PVA), a highlybiocompatible material, is used in a braided rope pattern in order to mimic the function of the native ACL. The research project assesses the mechanical behaviour of the braided structures in terms of their suitability for high-stress applications as an ACL prosthesis.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "greg.campion4@mail.dcu.ie",
            "name": "Greg Campion"
        }
        ],
        "supervisor": "Garrett.McGuinness@dcu.ie",
        "technology": "Solidworks",
        "title": "Development and Characterisation of Braided Fibre Bundle Structuresfor Tendon Substitution"
    },
    {
        "area": "Cryptography",
        "description": "The idea behind this project was to solve the problem of trust between two or more signatories and a digital notary using cryptography. Using this application, the signatories can share, sign and safeguard a digital asset (which can be anything from a word document, to an mp3 file etc. ) and the notary ensures that all digital assets entered into the system cannot be altered, disclosed without permission or have their associated transactions tampered with or repudiated by the signatories.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "anna.parsisiploumpi2@mail.dcu.ie",
            "name": "Anna Parisi - Ploumpi"
        }
        ],
        "supervisor": "Geoff.Hamilton@dcu.ie",
        "technology": ".NET, C#, SQL",
        "title": "Notary of Digital Assets"
    },
    {
        "area": "Android, Mobile App",
        "description": "This application was developed to help improve a GAA team's game play by recording their statistics during the game to highlight their strengths and weaknesses on the pitch. The user logs into an account on the mobile application and then begins to record the information about the match (kick outs/ scores/ turnovers). This information will then be displayed to the user in graph form allowing them to see where the teams strength and weaknesses are on the pitch.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "aisling.casserly4@mail.dcu.ie",
            "name": "Aisling Casserly"
        }
        ],
        "supervisor": "Mark.Roantree@dcu.ie",
        "technology": "React-Native, Node.js, SQLite",
        "title": "Gaa Game Time Statistics"
    },
    {
        "area": "3-D Modelling, Biomedical Engineering, Finite Element Analysis",
        "description": "This project will examine osteochondral defects on the medial femoral condyle and the stresses presentin the defect. It will investigate the effect the size of an osteochondral defect has on the stresses presentin a patient's femur bone and use various scaffolds to repair the affected site. A 3D Finite Element Model composed of a standardised femur bone was created using ANSYS Workbench and SolidWorks to analyse and measure the various stresses and strains present in the distal femur.",
        "programme": "Biomedical Engineering ",
        "students": [
        {
            "email": "ross.gordon5@mail.dcu.ie",
            "name": "Ross Gordon"
        }
        ],
        "supervisor": "Bryan.MacDonald@dcu.ie",
        "technology": "ANSYS Workbench, Solidworks",
        "title": "Finite element modelling of damage and proposed repairs to the distal femur/Condyles"
    },
    {
        "area": "Internet of Things",
        "description": "BluBox is an 'Internet of Things' device aimed at medium to large recreational boats. Our vision is to create a greater connection between boats and their owners by creating a remote hub for all important onboard information. Data will be sent via a mobile or web application for instant use, analysis and sending of critical notifications. The purpose of our project is to innovatively improve a owners boating experience.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "barry.osullivan29@mail.dcu.ie",
            "name": "Barry O,Sullivan"
        },
        {
            "email": "sean.oconnor93@mail.dcu.ie",
            "name": "Sean O'Connor"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": ".NET, CSS, HTML5, Java, JavaScript, Node.js, JSON, NMEA, Ionic, Signal K, Autodesk Fusion 360, Raspberry Pi",
        "title": "BlueBox"
    },
    {
        "area": "Cloud Computing, Software Development, Web Application",
        "description": "The aim of this platform is to create a library that will assist the promotion of best practice coding standards. This enables other developers to integrate it, either locally through the library or remotely through my cloudbased web platform, into their own code teaching websites, IDE plugins, or other such projects. The system, using a Java library written in Clojure, takes in a user submitted style-rulebook, the piece of source code, and returns suggested changes based off the rulebook.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "bernard.oconnor47@mail.dcu.ie",
            "name": "Bernard O'Connor"
        }
        ],
        "supervisor": "David.Sinclair@dcu.ie",
        "technology": "Clojure, ClojureScript, Leinigen, Figwheel, Jetty Server, Bootstrap, Compojure, CLJS-Ajax, Reagent, IntelliJ",
        "title": "Source Code Analyser Engine"
    },
    {
        "area": "Sensor Data, Web Application",
        "description": "Recently introduced IoT application boards, the Espruino and the Tessel 2 which both natively support JavaScript and Node.js hint at a new trend of the use of JavaScript in IoT development. This project involves the development of an IoT hub of sensors using the Espruino and the Tessel boards, bundled with a monitoring application. The performance of this solution is compared to that of a traditional approach using a compiled language, comparing footprint, power consumption, accessibility and development time.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "seamus.doherty27@mail.dcu.ie",
            "name": "Seamus Doherty"
        }
        ],
        "supervisor": "Martin.Collier@dcu.ie",
        "technology": "HTML5, JavaScript, Node.js",
        "title": "IoT Hub using JavaScript"
    },
    {
        "area": "Additive Manufacturing, Arduino, Biomedical Engineering",
        "description": "Plantar pressure distribution, which is the pressure felt between the sole of the foot and a support surface, can be an important form of analysis in determining an illness and detecting lower limb problems. The aim of this project is to design and develop a low-cost device capable of measuring an individual's plantar pressure during normal activity such as walking. The finalised device was assessed and compared to other systems already present on the market.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "graham.vaughey2@mail.dcu.ie",
            "name": "Graham Vaughey"
        }
        ],
        "supervisor": "Dermot.Brabazon@dcu.ie",
        "technology": "Solidworks",
        "title": "Development of a Low Cost Plantar Pressure Measurement Device"
    },
    {
        "area": "Mobile App, Android",
        "description": "Spotted is a map based Android application. In summary, it allows users to make 'posts' which willbe displayed on a map and can be viewed by other users near their area as well as encompassing a communication system which allows users to contact each other. These 'posts' may contain images, textor both. Useful for users in communities as they can advertise unwanted items for sale, report antisocial behaviour, report missing pets, ask the towns people questions and so on.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "liam.nunez2@mail.dcu.ie",
            "name": "Liam Nunez"
        }
        ],
        "supervisor": "Ray.Walshe@dcu.ie",
        "technology": "Java",
        "title": "Spotted"
    },
    {
        "area": "Web Applications",
        "description": "This web application is aimed at the health and fitness industry, and a growing market. Our application is designed for both personal trainers and their clients. Personal trainers can manage their time, their clients, view progress and distribute materials. Likewise, clients can log information and view material sent by the personal trainer. The aim of this app is to leverage their existing workflow with the aim of improving results. This Project utilizes HTML5, Javascript, PHP, CSS, & MySQL.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "nathan.mcaloon2@mail.dcu.ie",
            "name": "Nathan McAloon"
        },
        {
            "email": "dillon.dooley7@mail.dcu.ie",
            "name": "Dillon Dooley"
        }
        ],
        "supervisor": "Jane.Kernan@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, PHP, SQL",
        "title": "MiPT"
    },
    {
        "area": "Data Analytics, Device Design",
        "description": "While a water mill system is running, sound generation from the system occurs. an unknown source in the system is causing the sound. With the use of an accelerometer, microphone and LabView this source can be determined. A form of sound mitigation will be implemented once the source has been identified. Soundproofing and vibration absorption are two of the mitigation techniques used to reduce the sound of the water mill system.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "neil.martin34@mail.dcu.ie",
            "name": "Neil Martin"
        }
        ],
        "supervisor": "Harold.Esmonde@dcu.ie",
        "technology": "LabVIEW, Solidworks",
        "title": "Sound Generation and Mitigation in a water mill"
    },
    {
        "area": "Android, Mobile App",
        "description": "This project will consist of a mobile application which will act as a diagnostic tool for young primary school children who may possibly have dyscalculia. Dyscalculia is a maths learning disability which can effect a persons ability to learn arithmetic facts, process numerical magnitude and perform accurate and fluent calculations. The application will test young children through a set of various tasks/tests to determine if they have the learning difficulty",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "meabh.horan4@mail.dcu.ie",
            "name": "Meabh Horan"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "Java, SQLite, XML",
        "title": "Diagnose Dyscalculia"
    },
    {
        "area": "Lean Manufacturing",
        "description": "This project investigates the impact of a processing time bottleneck on four-stage, single product Kanbanand CONWIP systems. The effect of a constraint on the stability of system work-in-progress (WIP) and service level is analysed while monitoring the amount of backlog recorded. It also explores bottleneck mitigation methods such as adjusting the WIP restriction placed on the four stages of the Kanban system and adding extra WIP to the Kanban and CONWIP systems when a bottleneck is detected.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "samuel.nwosutobechukwu2@mail.dcu.ie",
            "name": "Tobe Nwosu"
        }
        ],
        "supervisor": "John.Geraghty@dcu.ie",
        "technology": "ExtendSIM",
        "title": "The Impact Of A Bottleneck On A Lean Manufacturing System"
    },
    {
        "area": "Android, Mobile App",
        "description": "This is an Android application which gathers in-store receipts from Near Field Communication (NFC) tags. Once the receipt is scanned, users can view their receipts through the app. The apps aim is to provide a simple way to organise and budget purchases by supplying an overall calculation of all their expenditure, categorising their receipts into different folders and providing suggestions of shops they may like.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "emer.hennebry2@mail.dcu.ie",
            "name": "Emer Hennebry"
        }
        ],
        "supervisor": "Jane.Kernan@dcu.ie",
        "technology": "Java, SQLite, XML, NFC",
        "title": "NFC Receipts App"
    },
    {
        "area": "Cloud Computing, Distributed Systems",
        "description": "Cerberus is a MapReduce framework built for processing large datasets across many machines. The framework is written in Rust and is focused on reliability and scalability. The project includes a distributed filesystem implementation which can be used for storing datasets distributed across the machines carrying out the MapReduce. Other storage implementations are included with the framework including an implementation for using S3 on AWS.",
        "programme": "Computational Problem Solving and Software Development",
        "students": [
        {
            "email": "darragh.griffin24@mail.dcu.ie",
            "name": "Darragh Griffin"
        },
        {
            "email": "ryan.connell5@mail.dcu.ie",
            "name": "Ryn Connell"
        },
        {
            "email": "connor.griffin37@mail.dcu.ie",
            "name": "Connor Griffin"
        }
        ],
        "supervisor": "David.Gray@dcu.ie",
        "technology": "Rust, Docker",
        "title": "Cerberus MapReduce Framework"
    },
    {
        "area": "Arduino, Renewable Energy Technology, Sensor Data",
        "description": "This project detailed and explored the performance of a lithium-ion battery. A methodology to establish singular cell state of health within an overall battery pack using elements of the charge cycle was proposed. Using a simple test rig, Arduino and Matlab, a monitoring station was created to capture and graphically present the behaviour of a lithium-ion battery. The state of health was determined from the slope of the charge cycle constant-current phase and a look-up table.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "sean.finn32@mail.dcu.ie",
            "name": "Sean Finn"
        }
        ],
        "supervisor": "Barry.McMullin@dcu.ie",
        "technology": "C/C++, Matlab",
        "title": "Performance Monitoring of Lithium Ion Cells."
    },
    {
        "area": "Content Management System, Web Application",
        "description": "This project aims to build a project creation, management and interaction solution for the CoderDojoFoundation and their community platform (Zen) which is currently used to manage over 1,000 Dojos and their events across the world. This solution allows youths to share software projects they have worked onby uploading their code which is automatically stored and versioned using GitHub. Projects can then be run and interacted with directly in the browser including Python 3, Node.js, HTML5 and Java projects.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "graham.bartley3@mail.dcu.ie",
            "name": "Graham Bartley"
        }
        ],
        "supervisor": "Geoff.Hamilton@dcu.ie",
        "technology": "CSS, Docker, HTML5, SQL, Vue. js, Node.js",
        "title": "CoderDojo Zen Projects"
    },
    {
        "area": "Finite Element Analysis",
        "description": "The project investigates the rubber-pad forming manufacturing process of a hemi-spherical dome shape. The investigation included both experimental and finite element methods using Ansys software. A three dimensional model was produced in order to compare with the experimental results. The project involved variance the forming load, lubrication conditions and equipment set-up which produced results including maximum forming depth, areas of high stress and defect prevention.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "peter.hogan8@mail.dcu.ie",
            "name": "Peter Hogan"
        }
        ],
        "supervisor": "Bryan.MacDonald@dcu.ie",
        "technology": "ANSYS Workbench, Solidworks",
        "title": "Experimental and Numerical Investigation of the Rubber-Pad Forming Processof Aircraft Components"
    },
    {
        "area": "Automation",
        "description": "This project aimed at upgrading the control systems which would enable communication from the PLC'sover the network, in order to make it in line with industry 4.0. Before this could happen problems had to be resolved with the station that was going to be worked on. These issues were resolved using Siemens Step 7 products and configuring the station efficiently.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "jake.salveta2@mail.dcu.ie",
            "name": "Jake Salveta"
        }
        ],
        "supervisor": "Paul.Young@dcu.ie",
        "technology": "Siemens Step 7 Products, Solidworks",
        "title": "Developments of a Digital Twin for the FMS Rig"
    },
    {
        "area": "Artificial Intelligence, Computer Vision",
        "description": "This project involves the design and implementation of a convolutional based neural network which is capable of recognising a limited set of fashion items from everyday images. The main goal is to develop a system that is computationally efficient as well as accurate in predicting a fashion item given an image. It also involves the analysis of transfer learning from industry level models.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "sakthignana.somaskandan2@mail.dcu.ie",
            "name": "Sakthignana Sundaram Somaskandan"
        }
        ],
        "supervisor": "Paul.Whelan@dcu.ie",
        "technology": "Python",
        "title": "Automatic Fashion Item Identification and Classification using Deep Learningbased Computer Vision"
    },
    {
        "area": "Databases, Data Mining, Data Analytics",
        "description": "The project tracks near real-time user behaviour to ensure the business understands their product performance - focusing on VSWare use case. It provides a general overview of user interactions with aVSWare application. This is achieved through a Big Data Platform and analytics which are computed ina distributed manner by Spark Cluster. User behaviour anomaly detection demonstrates the platform's Machine Learning potential. General analytics are displayed on a web based UI.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "elisabeth.kraman2@mail.dcu.ie",
            "name": "Elisabeth Kraman"
        }
        ],
        "supervisor": "Brian Stone@dcu.ie",
        "technology": "AWS Kinesis, Apache Spark (Streaming & MLlib), Apache Cassandra, ChefCookbooks, Jenkins, JUnit, SonarQube, Vue. js, Java",
        "title": "User Behaviour Monitoring"
    },
    {
        "area": "Advanced Material Engineering, Mechanical Design and Manufacture, AdditiveManufacturing",
        "description": "In this project, reinforcing phases of elements of nano-scale SiC particles was integrated within Additive Manufacturing 316L stainless steel powder. Correlation of production parameters using Powder Metallurgy route, amount of the reinforcement phase and resultant part's mechanical and microstructural properties were examined for process optimization. Nano-material characterization techniques for this project included SEM, advanced Optical Microscopy, and Particle Surface Analysis.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "ahmed.ahameed2@mail.dcu.ie",
            "name": "Ahmed Ahameed"
        }
        ],
        "supervisor": "Dermot.Brabazon@dcu.ie",
        "technology": "Powder Metallurgy",
        "title": "Re-Enforcing Nano-Particle Integration into Metal AM and Produced PartCharacterisation"
    },
    {
        "area": "Mobile App, Educational, Android, Databases",
        "description": "WhichPrep is an Android application designed to assist English learners to correctly use prepositions. The app offers sentences of varying length and content to the user with the prepositions missing. The user selects the correct preposition from a selection of possible answers. This process increases in difficulty as the user completes levels to allow the user to apply their learning. A MySQL database communicates with the main application to provide sentences suitable for the user's current level.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "ellen.kennedy38@mail.dcu.ie",
            "name": "Ellen Kennedy"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "SQL, MySQL, Java",
        "title": "WhichPrep"
    },
    {
        "area": "Tissue Engineering",
        "description": "This project investigates the injectability of Alginate hydrogel. Forces required for the injection of Alginae hydrogel of different compositions were evaluated using a 5kN Zwick mechanical testing machine. The curing process was also examined with a Rheometer, the gelation time of hydrogel samples was also assessed using the data acquired.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "yi.nin3@mail.dcu.ie",
            "name": "Yi Nan"
        }
        ],
        "supervisor": "Tanya.Levingstone@dcu.ie",
        "technology": "AntonPaar Rheometer Software",
        "title": "Assessment of injectability of hydrogels designed for bone repair applications"
    },
    {
        "area": "Web Application, Databases",
        "description": "Styled Solutions is a customer relationship management system that will help manage a salon's relationship and interactions with their customers and potential customers. The website will manage bookings which will help salons to increase their profitability and work flow processes. Styled solutions acts as a platform for salons to advertise their business helping to generate new clients to maximise business potential.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "shauna.barry32@mail.dcu.ie",
            "name": "Shauna Barry"
        },
        {
            "email": "roisin.crowley7@mail.dcu.ie",
            "name": "Roisin Crowley"
        }
        ],
        "supervisor": "Markus.Helfert@dcu.ie",
        "technology": "Java, JavaScript, MySQL, PHP, SQL, HTML5",
        "title": "Styled Solutions"
    },
    {
        "area": "Network Applications",
        "description": "This is a network automation platform which will aid engineers in deploying and maintaining a live network. It will subsequently reduce operating costs as well as likelihood of human introduced errors. The devices this platform will manage include, but are not limited to enterprise grade switches, routers and firewalls. The system will use a variety of technologies, including a client-server architecture, Statistical Machine Learning, Software Defined Networking tools and many other.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "filip.nikolic2@mail.dcu.ie",
            "name": "Filip Nikolic"
        }
        ],
        "supervisor": "Brian.Stone@dcu.ie",
        "technology": "AngularJS, CSS, HTML5, Java, JavaScript, JQuery, MySQL, Python, SpringMVC",
        "title": "ASDN - Automated Software defined Networking"
    },
    {
        "area": "Circuit Modeling, Control Systems, Mechatronic Systems, Power Electronics, Simulation",
        "description": "This project investigates suitable compensators for use in buck converter systems. DC-DC converters are widely used in equipment for computing, mobile and automotive applications. Nowadays DC-DC design requirements are increasing due to a market demand for smaller size and higher efficiencies. The project investigates the selection of suitable compensators to achieve a desired performance and a well-regulated voltage.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "aoife.grady2@mail.dcu.ie",
            "name": "Aoife Grady"
        }
        ],
        "supervisor": "Marissa.Condon@dcu.ie",
        "technology": "Matlab, Simulink",
        "title": "Stability Analysis of Compensated Voltage Regulators"
    },
    {
        "area": "Android, Mobile App, Sensor Data",
        "description": "Sensor fusion is the combination of sensor readings to enhance system performance. This project investigates the use of sensor fusion in relation to smartphone sensors and other data sources usable within infrastructures e.g. Wi-Fi, to develop an indoor navigational device that can provide a rough indication of position. Different localization strategies were developed throughout this project and were evaluated in terms of accuracy, performance and resource usage, by comparing the device's outputs against ground truth data specified within this project.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "adrian.whelan38@mail.dcu.ie",
            "name": "Adrian Whelan"
        }
        ],
        "supervisor": "Robert.Sadleir@dcu.ie",
        "technology": "Java, XML",
        "title": "Sensor fusion based indoor positioning system"
    },
    {
        "area": "Fluid Mechanics, Water Treatment",
        "description": "The objective of this project is to design a frame to increase of the oxygen transfer rate of a micro-bubble diffuser. The frame design created a viscous shear flow over the diffuser which has been shown to increase the detachment rate of microbubbles. The venturi effect was investigated through the CFD ANYSYS programme fluent, then implemented into the flow chamber design. In turn, maintaining the high oxygen transfer rate but reducing the volumetric flow demand.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "ciaran.gibney4@mail.dcu.ie",
            "name": "Ciaran Gibney"
        }
        ],
        "supervisor": "Yan.Delaure@dcu.ie",
        "technology": "Solidworks, ANSYS Workbench",
        "title": "Design and build a new pumping station for microbubble generation"
    },
    {
        "area": "Android, Cloud Computing, Databases, Mobile App, Social Networking",
        "description": "C-Me is a mobile application that helps groups of friends organise and locate each other during social events. This app allows friends to plan a social event by providing the event details and inviting their friends to the event. As the start-time of the event approaches the location of all invited guests will be shared amongst each other and everyone's location will be visible on a virtual-map. Allowing users to track and locate their friend's before and during social events.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "kevin.nangle2@mail.dcu.ie",
            "name": "Kevin Nangle"
        },
        {
            "email": "sean.motherway@mail.dcu.ie",
            "name": "Sean Motherway"
        }
        ],
        "supervisor": "Brian.Stone@dcu.ie",
        "technology": "Java, XML",
        "title": "C-Me"
    },
    {
        "area": "Web Applications",
        "description": "This project will allow players of the game Guild Wars 2 to access their account outside of the game, as well as see the in-game, player run, trading post. From this they will be able to view all the details of their account in a comprehensible format that would be normally hidden within menus. They will also be able to view predicted prices of items on the trading post.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "brendan.mcmanus@mail.dcu.ie",
            "name": "Brendan McManus"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "AngularJS, Java, JavaScript, Python",
        "title": "Guild Wars 2 Companion App"
    },
    {
        "area": "Mechanical Design and Manufacture, Simulation",
        "description": "This project investigates the operating force required to open and close a door. A simple controllable damper which represents a hydraulic door closer was designed to measure the force required by a spring or counter-weight to close a door and the force required by the user to open it. The objective of the project was to reduce both forces to as little as possible. A redesign of an existing counter-weight door mechanism was also designed.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "robert.ennis2@mail.dcu.ie",
            "name": "Robert Ennis"
        }
        ],
        "supervisor": "Alan.Kennedy@dcu.ie",
        "technology": "Matlab, Simulink, Solidworks",
        "title": "Adjustable damper for external door"
    },
    {
        "area": "Biomedical Engineering, Tissue Engineering",
        "description": "The objective of this project is to develop a degradable sodium alginate based hydrogel for the temporary embolization of the hepatic artery to treat liver tumours. Calcium carbonate  glucono delta lactone-based formulations are being developed for this purpose. Various testing methods will be performed on the hydrogel samples to determine the optimum formulation. Tests to determine working and setting times, degradation behaviour, injectabilty and compressive strength will be performed.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "matthew.mcdermott32@mail.dcu.ie",
            "name": "Matthew McDermott"
        }
        ],
        "supervisor": "Owen.Clarkin@dcu.ie",
        "technology": "Excel/VB",
        "title": "Development of a Degradable Embolic Hydrogel Material for the TemporaryEmbolization of Liver Tumours"
    },
    {
        "area": "Internet of Things, Computer Vision, Embedded Systems",
        "description": "The use of embedded machine vision for IoT applications is currently experiencing huge expansion. To facilitate this type of growth in the age of IoT and post Moore's law era innovative solutions are needed that minimise power consumption and maximise computing resources. In this project a framework is developed for accelerating computationally expensive tasks in Hardware-Software Co-Design image processing pipelines using the Zynq APSoC and High Level Synthesis.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "mark.mchugh32@mail.dcu.ie",
            "name": "Mark McHugh"
        }
        ],
        "supervisor": "Derek.Molloy@dcu.ie",
        "technology": "C/C++, FPGA",
        "title": "Software Configurable Hardware Architectures for Machine Vision AlgorithmsImplemented on Zynq"
    },
    {
        "area": "3-D Modelling, Additive Manufacturing, Biomedical Engineering, TissueEngineering",
        "description": "This project investigates the validation of a pre-built FDM based 3D printer's ability to produce accurate and precise calcium phosphate-based scaffolds and the modifications required for the printer to be repurposed in order to achieve this.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "sean.elliott@mail.dcu.ie",
            "name": "Sean Elliott"
        }
        ],
        "supervisor": "Nicholas.Dunne@dcu.ie",
        "technology": "Solidworks",
        "title": "3D Printing of Calcium Phosphate Based Scaffolds"
    },
    {
        "area": "Web Applications",
        "description": "TrackMyDiabetes is an application that was developed to assist people with diabetes with the monitoring of data crucial to their diabetic health management. It engages with the API of Fitbit and MyFitnessPal to automatically record and integrate the user's exercise and diet data. The application also allows users to enter their blood glucose levels and then uses all of the information given to provide a recommended insulin bolus dosage to the user.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "alannah.mccabe38@mail.dcu.ie",
            "name": "Alannah McCabe"
        },
        {
            "email": "sarah.kelly247@mail.dcu.ie",
            "name": "Sarah Kelly"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, PHP",
        "title": "TrackMyDiabetes"
    },
    {
        "area": "Image Video Processing, Software Development, RaspberryPi, Internet of Things, Android, Computer Vision",
        "description": "This project is a Raspberry Pi powered Smart Mirror, with an accompanying Android application. The Mirror showcases a collection of user-specific widgets on-screen that can be configured manually through the app. Facial Recognition is used to change the on-screen interface depending on the user that is standing in-front of the Mirror. The aim of this project is to provide a practical and useful interface for daily life, to lend a helping hand while the user prepares for their day.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "kieran.turgoose2@mail.dcu.ie",
            "name": "Kieran Turgoose"
        }
        ],
        "supervisor": "Suzanne.Little@dcu.ie",
        "technology": "HTML5, Java, JavaScript, Node.js, Python, XML, OpenCV, SSH",
        "title": "PiMirror"
    },
    {
        "area": "GPS GIS, Lean Manufacturing, Simulation, Statistical Analysis",
        "description": "Closed-Loop Supply Chains have a unique set of management issues due to the added complexity of their cyclical nature. Reusable Articles are the key items within these systems that serve their purpose numerous times throughout their life cycle. This project, founded on an SME case study, explores the use of Discrete Event Simulation as a management tool for these particular systems; focusing on the ancillary item of the keg for a brewery operation.",
        "programme": "Manufacturing Engineering with Business",
        "students": [
        {
            "email": "jack.keogh23@mail.dcu.ie",
            "name": "Jack Keogh"
        }
        ],
        "supervisor": "John.Geraghty@dcu.ie",
        "technology": "ExtendSIM",
        "title": "Modelling and Analysis of Closed Loop Supply Chain Management for ReusableArticles"
    },
    {
        "area": "Artificial Intelligence, Gaming",
        "description": "This project demonstrates how genetic theory and neural networks can be used to solve computer problems. The NEAT (Neural Evolution of Augmented Topologies) algorithm I have implemented outperforms the best fixed topology methods on benchmark reinforcement learning challenges. To showcase the algorithm, I created a 2-D arcade game using the Unity 5 engine. The algorithm learns how to play the game with no previous knowledge on how the game works.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "christopher.durning4@mail.dcu.ie",
            "name": "Christopher Durning"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "C#, Unity",
        "title": "Neural Jump"
    },
    {
        "area": "Advanced Material Engineering, Biomedical Engineering, Tissue Engineering",
        "description": "The worldwide incidence of non-union bone fractures has trended steeply upwards continues to rise. Dependable synthetic bone scaffolds would remove the need for bone harvest operations, which are necessary in autograft procedures. For bone in-growth to occur, a scaffold must be sufficiently porous and have the necessary compressive strength for load bearing in vivo. Scaffolds were produced via the foam replication technique using hydroxyapatite and beta-tricalcium phosphate. Testing was carried out to determine scaffold porosityand compressive strength.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "peter.cullen6@mail.dcu.ie",
            "name": "Peter Cullen"
        }
        ],
        "supervisor": "Nicholas.Dunne@dcu.ie",
        "technology": "Excel/VB",
        "title": "Development of Scaffolds for Tissue Engineering Applications with OptimizedPorosity and Mechanical Properties."
    },
    {
        "area": "Web Applications",
        "description": "Delicious is a deli pre-ordering system accessed through two web applications. The first allows customers to select their desired item from the full menus provided by stores along with their preferred collection time and any additional preparation notes they require. The second allows the deli staff to manage the orders. This system saves both the customer and deli staff time during their busy days, making the process of purchasing from deli and hot food counters more efficient, modern and painless.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "daniel.cahill8@mail.dcu.ie",
            "name": "Daniel Cahill"
        },
        {
            "email": "shane.rooney28@mail.dcu.ie",
            "name": "Shane Rooney"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "JavaScript",
        "title": "Delicious"
    },
    {
        "area": "Lean Manufacturing",
        "description": "Assess experimentally the impact of perishability of the effectiveness and efficiency of modern production and inventory control strategies for lean manufacturing systems. Within the project must contain a state-of-the art review of production and inventory control for lean systems and for impact of perishability on line management performance, a discrete event simulation model on ExtendSim to provide the experimental platform and a conducted design of experiments analysis of the effect of perishability on selected production and inventory control strategies.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "david.kilbridge4@mail.dcu.ie",
            "name": "David Kilbridge"
        }
        ],
        "supervisor": "John.Geraghty@dcu.ie",
        "technology": "ExtendSIM",
        "title": "Production and inventory control strategies for systems manufacturing perishablegoods"
    },
    {
        "area": "Android, Databases, Environmental Mapping, Instant Messaging, SoftwareDevelopment, Social Networking, Web Application",
        "description": "The Android application Jobder is a virtual Employment system for all fields and skills of work. The system captures the user's data including their GPS data, targeting instant events and real time posting's. The data is filtered and displayed according to the user's field of employment and user needs using google maps API. The application also includes instant messaging, geocoding and automatic grammar correction. There is a web application where users can view statistical information of different trends of employment.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "adrian.rabbitt3@mail.dcu.ie",
            "name": "Adrian Rabbitt"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "AngularJS, CSS, Docker, HTML5, Java, JavaScript, Node.js, NoSQL, PHP, XML",
        "title": "Jobder"
    },
    {
        "area": "Robotics, Simulation, Software Development",
        "description": "Creating an environment to visualize the progression of the path planning algorithms for robot movement whilst not compromising the computation speed of the algorithms is challenging. This project aimed to overcome this challenge by developing, designing, and building a robust path planning program capable ofsimulating multiple algorithms, and portraying their visual aspects while remaining entirely computationally efficient. The program successfully overcame this challenge through efficient programming and integration of an easy to use graphical user interface.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "seamus.stone6@mail.dcu.ie",
            "name": "Seamus Stone"
        }
        ],
        "supervisor": "Jennifer.Bruton@dcu.ie",
        "technology": "Matlab, GUI, Programming, Robot Path Planning",
        "title": "An investigation of a MATLAB simulation environment for multi-agent mobotpath planning"
    },
    {
        "area": "Circuit Modeling",
        "description": "The target of this project is to simulate a tuned amplifier that is working for high frequency application. The project examines how the non-idealities of components affect the results as frequencies rise. The project assesses what non-idealities need to be included in models to obtain accurate results.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "basim.aldhawi2@mail.dcu.ie",
            "name": "Basim Aldhawi"
        }
        ],
        "supervisor": "Marissa.Condon@dcu.ie",
        "technology": "MATLAB + PSpice",
        "title": "Tuned Amplifier Simulation and Study"
    },
    {
        "area": "Mobile App, Data Analytics",
        "description": "Swift is a sports management app that removes the headaches of being a coach. It gives a platform for coaches and players, in a team, to share training data and communicate about upcoming events. Data is analysed and then displayed so the coach can discover areas of weakness and players can see how they are performing, relative to the team. Swift is an android app built with JAVA technology, with data stored and mined in a MySQL database.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "stephen.heerey2@mail.dcu.ie",
            "name": "Stephen Heerey"
        },
        {
            "email": "darren.clarke43@mail.dcu.ie",
            "name": "Darren Clarke"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "MySQL, PHP, Java",
        "title": "Swift"
    },
    {
        "area": "Simulation, Wireless Technology",
        "description": "This project explores the introduction of haptics into aircraft cockpits. Visual and auditory cues are the primary source of pilot alerts. Research has shown that haptic feedback can significantly reduce response times to stimuli. The project uses flight simulation software in the development of three wireless (Zigbee) wearable devices. The devices use vibrations to alert the pilot to angle-of-attack and slip characteristics. Research experiments were carried out to further examine human reaction times to differing stimuli (visual, auditory & haptic).",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "adam.kiely@mail.dcu.ie",
            "name": "Adam Kiely"
        }
        ],
        "supervisor": "Noel.Murphy@dcu.ie",
        "technology": "C/C++, C#, Unity",
        "title": "Haptic Feedback for Light Aircraft Flight Condition Awareness"
    },
    {
        "area": "Biomedical Engineering",
        "description": "Tissue engineered scaffolds aim to regenerate diseased or damaged tissue. However, translating them into clinical use is problematic, particularly the stable fixation of these devices within a cartilage defect. The challenging loading environment within the joint can lead to the failure of the device. This project investigates possible fixation device concepts, choosing a technique based on previous studies and determining if the final design can surpass the standard set previously by fixation techniques on the market.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "scott.byrne93@mail.dcu.ie",
            "name": "Scott Byrne"
        }
        ],
        "supervisor": "Tanya.Levingstone@dcu.ie",
        "technology": "ANSYS Workbench, Solidworks, CES EduPack",
        "title": "Development of Enhanced Fixation Techniques for Bio-Material Devices forCartilage Repair"
    },
    {
        "area": "Android, Arduino, Databases, Internet of Things, Motion Analysis, RaspberryPi, Sensor Data, Software Development",
        "description": "This project consists of a home security system which communicates with an android application. The system consists of multiple internet protocol cameras and wireless sensor nodes both being monitored by a raspberry pi. The raspberry pi was chosen as the central controller and Zigbee nodes implementing XBee were chosen to communicate sensor readings to it.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "denis.atkinson6@mail.dcu.ie",
            "name": "Denis Atkinson"
        }
        ],
        "supervisor": "David.Sinclair@dcu.ie",
        "technology": "Java, MySQL, PHP, Zigbee",
        "title": "MySpy"
    },
    {
        "area": "3-D Modelling, Automation, Mechanical Design and Manufacture, MechatronicSystems, Motion Analysis, Robotics",
        "description": "A ball-bot is a mobile robot that is designed to balance on a spherical ball. The balancing is achieved by using embedded microcontroller and gyroscope sensors to precisely drive three DC motors. The aim of the project is to research, design and build a ball-bot and a method for self-balancing control.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "egidijus.ambrakaitis2@mail.dcu.ie",
            "name": "Egidijus Ambrakaitis"
        }
        ],
        "supervisor": "Noel.Murphy@dcu.ie",
        "technology": "C/C++, Solidworks",
        "title": "Designing and building a self-balancing ball-bot"
    },
    {
        "area": "Web Applications",
        "description": "SaorSchool is a teacher to parent communication application for primary school level that will create a more relevant mode of communication between both parties, while also aiming to reduce a schools waste on physical resources. The app will allow teachers to communicate details of, an upcoming school event, a child's academic performance issue, create virtual permission slips for parents to sign and more. Parents can conveniently access this information along with the ability to virtually sign a permission slip.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "dale.stewart4@mail.dcu.ie",
            "name": "Dale Stewart"
        },
        {
            "email": "shaun.odonnagain2@mail.dcu.ie",
            "name": "Shaun O Donnagain"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "PHP, SQL, Bootstrap, MySQL, JavaScript, HTML5, CSS",
        "title": "SaorSchool"
    },
    {
        "area": "Data Analytics, Natural Language Processing, Statistical Analysis, Web Application",
        "description": "The aim of this project is to contrast user behaviour on Reddit. It is a web application that performs statistical/sentiment analysis to portray a clearer insight into users' behaviour and interactions within the different subforums of Reddit. It also outlines particular types of language which influences a comment to receive a higher score i.e. aggressive/assertive. There is an aspect of machine learning involved, incorporating predictive modelling to train a model to predict Subreddit/Score of a comment.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "rachel.solomon2@mail.dcu.ie",
            "name": "Rachel Solomon"
        }
        ],
        "supervisor": "Suzanne.Little@dcu.ie",
        "technology": "Python, JavaScript, CSS, SQLite",
        "title": "Analyzing Online User Behaviour"
    },
    {
        "area": "Web Applications",
        "description": "The aim of this project is to give a user the ability to find the cheapest online market to buy a software key before selling it on another website at the highest possible price. By applying the basic arbitrage technique of 'Buy low, sell high', the user should be able to capitalise on the variations of product prices across multiple e commerce platforms.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "sean.ladrigan2@mail.dcu.ie",
            "name": "Sean Matthew Ladrigan"
        }
        ],
        "supervisor": "Markus.Helfert@dcu.ie",
        "technology": "Python, SQL, Django, Bootstrap",
        "title": "Applying Arbitrage Techniques to Online Retail Platforms"
    },
    {
        "area": "Finite Element Analysis",
        "description": "Snap-fit connectors are widely used in product design. Some examples include rucksacks, various toys and safety syringes. The objective of this project is to first build and solve a finite element model of a simple snap-fit connection using ANSYS Workbench finite element software. This model was built and validated against experimental and theoretical data. The geometry of the snap-fit was then optimised using parametric design analysis.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "shane.hudson2@mail.dcu.ie",
            "name": "Shane Hudson"
        }
        ],
        "supervisor": "Bryan.MacDonald@dcu.ie",
        "technology": "ANSYS Workbench",
        "title": "Finite Element Analysis of Simple Snap-Fits"
    },
    {
        "area": "Optical Communications",
        "description": "The aim of this project is to design an optical modulator based on CMOS circuit to study the Si based modulator. The design has to be simulated in the electrical properties of the waveguide, to determine carrier concentration of P-N junction, and the optical properties aspect to show how to modulate the phase by controlling the change of the reflective index via carrier concentration. High speed silicon Mach-Zehnder modulator was chosen to be designed for the project proposal.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "maadh.alnaabi2@mail.dcu.ie",
            "name": "Maadh Hamed Salim Alnaabi"
        }
        ],
        "supervisor": "Pascal.Landais@dcu.ie",
        "technology": "MATLAB",
        "title": "Study of a Si based modulator"
    },
    {
        "area": "Internet of Things, RaspberryPi, Wearable Technology, Wireless Technology",
        "description": "A portable application aimed at giving teachers peace of mind when travelling on school tours. This monitors student activity and in the case of a student straying a group, notifies the teacher. Each teacher has their own device that connects to a cluster of wristbands worn by the students. Students can be monitored as a whole group or in subgroups. Subgroups can be created and disbanded dynamically while on a trip.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "neil.geoghegan4@mail.dcu.ie",
            "name": "Neil Geoghegan"
        }
        ],
        "supervisor": "David.Sinclair@dcu.ie",
        "technology": "JavaScript, Clojure, ReactJs, REST, Node.js, MongoDB",
        "title": "Monitour"
    },
    {
        "area": "Arduino, Embedded Systems, Wireless Technology",
        "description": "This project involves the design and implementation of a home monitoring system based on passive radar. For this project, I used several XBee chips communicating wirelessly with each other in a self-healing mesh network configuration. I then programmed an Arduino with an Xbee shield and RF chip to act as the brains of the system. The Arduino can accept, save and track information fed to it by the network.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "steven.flynn27@mail.dcu.ie",
            "name": "Steven Flynn"
        }
        ],
        "supervisor": "Connor.Brennan@dcu.ie",
        "technology": "X-CTU, XBee",
        "title": "Passive radar based intruder detection"
    },
    {
        "area": "GPS GIS, Web Application",
        "description": "Scout Ahead is a planning tool focused at hiking groups and scout groups that uses open source mapping data and transport information to give users a single space to gather all the information they require before heading out on the mountains.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "finnian.oneill27@mail.dcu.ie",
            "name": "Finnian O'Neill"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "HTML5, JavaScript, OpenGL, CSS",
        "title": "Scout Ahead"
    },
    {
        "area": "Advanced Material Engineering, Automation, Data Analytics, Lean Manufacturing, Statistical Analysis",
        "description": "The aim of this project was to analyse and improve the baseline production performances of three high speed assembly cells, located in Nypro Healthcare's Bray site, currently experiencing significant volumes of mechanical faults and component blockages. Throughout the project, multiple lean and six sigma methodologies were utilised to effectively resolve these faults by developing and testing practical and efficient improvement solutions. Metrology analysis of assembly components and evaluation of injection moulding process conditions played a significant role in developing these solutions.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "stephen.bradley8@mail.dcu.ie",
            "name": "Stephen Bradley"
        }
        ],
        "supervisor": "Jeremiah.Murphy@dcu.ie",
        "technology": "Solidworks",
        "title": "Statistical Analysis and Improvement of Multiple High-Speed Assembly Cellsthrough Lean and Six Sigma."
    },
    {
        "area": "Web Application",
        "description": "This app allows Tournament Directors to set up and run Ultimate Frisbee Tournaments. It allows them to automatically generate a bracket that conforms to the style of the tournament they want to run. This bracket is populated with the teams entered into the tournament. While the tournament is run Teams or Tournament Directors can enter results updating the bracket. This project used an Angular frontend with a REST Api backend.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "andrew.twohig3@mail.dcu.ie",
            "name": "Andrew Twohig"
        }
        ],
        "supervisor": "Martin.Crane@dcu.ie",
        "technology": "AngularJS, JavaScript, MongoDB, Node.js, REST",
        "title": "Ultimate Frisbee Tournament Organiser"
    },
    {
        "area": "Internet of Things, Network Applications, Simulation",
        "description": "IoT networking architectures typically encompass a number of networking technologies working together to transport appropriate data. This project requires the development of a suitable IoT Network Architecture and simulation model and then use of the the model to investigate how many end devices may be supported and where bottlenecks and Quality of Service (QoS) issues arise within the architecture.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "dylan.redmond25@mail.dcu.ie",
            "name": "Dylan Redmond"
        }
        ],
        "supervisor": "Jennifer.mcmanis@dcu.ie",
        "technology": "C/C++, Eclipse, NS-3, Python",
        "title": "Scaling in Internet of Things Networking"
    },
    {
        "area": "Mobile App, Android",
        "description": "Simpli-Fi is a mobile application that aims to give parents more control over their children's Wi-Fi access & app usage. Using the Simpli-Fi mobile app, parents can easily disable Wi-Fi access on their child's device for any time period they choose. Parents can also block access to specific apps on the child's smart device and even view the current location of their child. Simpli-Fi also brings a modern disciplinary technique to parents in a family household.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "adam.kelly256@mail.dcu.ie",
            "name": "Adam Kelly"
        },
        {
            "email": "pawel.olkowicz@mail.dcu.ie",
            "name": "Pawel Olkowicz"
        }
        ],
        "supervisor": "Brian.Stone@dcu.ie",
        "technology": "Java, MySQL, PHP",
        "title": "Simpli-Fi"
    },
    {
        "area": "Software Development, Social Networking, Web Application",
        "description": "This project aims to allow users to connect with one another based on lifestyle, common interests and most importantly - journey route. The journey may include a simple commute to work/university or it may even appeal to those seeking an adventure. No matter the destination, a suitable match can be found. Users can look for matches with the aim of networking, dating or simply building friendships. The possibilities are endless and our app is the platform to deliver them.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "pauric.mcgroarty3@mail.dcu.ie",
            "name": "Pauric McGroarty"
        },
        {
            "email": "muhamed.sabic2@mail.dcu.ie",
            "name": "Muhamed Sabic"
        },
        {
            "email": "cian.farrell58@mail.dcu.ie",
            "name": "Cian Farrell"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "CSS, HTML5, MySQL, PHP, SQL",
        "title": "Social Ride"
    },
    {
        "area": "Electric Generation, Energy Conservation, Renewable Energy Technology",
        "description": "Wind energy is not as great as you think it is! Let's make hydrogen. Hybrid Turbine Electrolyser is a project that critically examines, evaluates and highlights the problems associated with wind power for electricity generation, especially in Ireland. The identified inefficiencies are used to generate improvements by using wasted energy and converting it to storable hydrogen. This project includes the study of existing wind to hydrogen hybrid (power-to-gas) systems, and proposes a new energy system.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "jochelle.laguipo2@mail.dcu.ie",
            "name": "Jochelle Laguipo"
        }
        ],
        "supervisor": "James.Carton@dcu.ie",
        "technology": "Research",
        "title": "Hybrid Turbine Electrolyser"
    },
    {
        "area": "Mechanical Design and Manufacture, Automotive Technology, 3-D Modelling",
        "description": "To Design and build a Drive train capable of being implemented in the electric racing car series, F24 run by Greenpower. The mechanism was to be designed using SolidWorks and built with a variety of manufacturing processes including 3D printing. The aim of the new drive train is to improve efficiency and speed.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "rian.molloy9@mail.dcu.ie",
            "name": "Rian Molloy"
        }
        ],
        "supervisor": "Paul.Young@dcu.ie",
        "technology": "Solidworks",
        "title": "Improved Drivetrain for Greenpower Car"
    },
    {
        "area": "Web Application",
        "description": "A platform for people to organise events from start to finish. You can organise all the resources required for an event. Businesses and people with resources can offer them on the platform. Just fill out the details of the ideal event and the platform would generate the most suited package. A new random event package or individual resource can be requested if the user is not happy with the one generated. Mostly everything is done through the platform.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "talah.ishfaq2@mail.dcu.ie",
            "name": "Talah Ishfaq"
        }
        ],
        "supervisor": "Markus.Helfert@dcu.ie",
        "technology": "Node.js, Angular, HTML, CSS, Mongodb, JavaScript",
        "title": "GetGoing"
    },
    {
        "area": "Mechanical Design and Manufacture, Robotics, Sensor Technology",
        "description": "Soft robotics is a subset of robotics with particular focus on flexible materials. Conventional strain gauges have a variety of industrial applications with particular emphasis on testing and validation of emerging products. This project explores the possibility of incorporating liquid metal into a silicone backing material for use as strain gauge in soft robotics applications focusing primarily on the manufacturing and design process.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "lucas.santos2@mail.dcu.ie",
            "name": "Lucas Santos"
        }
        ],
        "supervisor": "Jeremiah.Murphy@dcu.ie",
        "technology": "Solidworks, Research",
        "title": "Design, Build and Test a Liquid Metal Strain Gauge"
    },
    {
        "area": "Simulation, Software Development",
        "description": "This project aims to simulate certain types of simple societies. It provides reliable and readable feedback for the use in social and economic studies. The project uses an agent based form of simulation to create a complex system that reflects a simple society. Differing forms of taxation and governance affect the function of the agents, with statistical feedback being produced to help make conclusions about the affects of the differing governments.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "aaron.edgeworth3@mail.dcu.ie",
            "name": "Aaron Edgeworth"
        }
        ],
        "supervisor": "Liam.Tuohey@dcu.ie",
        "technology": "Unity, C#",
        "title": "Simulation of Differing Forms of Economic Governance"
    },
    {
        "area": "Automotive Technology, BeagleBone, Embedded Systems, Mechatronic Systems",
        "description": "The aims of the project are to investigate the Controller Area Network (CAN) Bus communication protocol, to design a platform to test this communication, and to develop a user-friendly messaging interface which'translates' the CAN communication using Matlab. This project demonstrates these aims, using an Analog Discovery signal generator, a Waveshare CAN module and a Beagle Bone Black embedded system. The communication is generated through the socketCAN open source driver within the Linux kernel, using iproute2 and can-utils utilities.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "carolyn.crampton2@mail.dcu.ie",
            "name": "Carolyn Crampton"
        }
        ],
        "supervisor": "Jennifer.Bruton@dcu.ie",
        "technology": "C/C++, Matlab, Debian Linux",
        "title": "CAN Bus Test-Bed and Messaging Interface in Matlab"
    },
    {
        "area": "Cryptography",
        "description": "This project centres around hardware implementations of the LEA lightweight block cipher, for constraint use scenarios within Internet of Things applications. An overview of the the most innovative hardware architectures of LEA to date are discussed and compared with two novel architectures proposed in this paper: one resource-optimised iterative implementation and one speed-optimised pipelined implementation.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "patrick.shortall2@mail.dcu.ie",
            "name": "Patrick Shortall"
        }
        ],
        "supervisor": "Xiaojun.Wang@dcu.ie",
        "technology": "Verilog",
        "title": "Lightweight Hardware Architectures of the LEA Block Cipher for FGPA"
    },
    {
        "area": "Web Application",
        "description": "This project is aimed to allow 'Employers' to advertise jobs they need completed, whether it be painting or cleaning a house, and local 'Employees' to apply for and complete these jobs for pay. The project aims to give people who are short on time a chance to outsource tasks, and a chance for people, unemployed or not, to earn extra income. This application will be built using the MEAN stack.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "kevin.oneill35@mail.dcu.ie",
            "name": "Kevin O'Neill"
        }
        ],
        "supervisor": "Charlie.Daly@dcu.ie",
        "technology": "Express, Node.js, AngularJS, CSS, MongoDB, JavaScript",
        "title": "Local Jobs"
    },
    {
        "area": "3-D Modelling, Automation, Control Systems",
        "description": "This project involved replacing an outdated Omron Programmable Logic Controller (PLC) operating a Flexible Manufacturing System test rig with a modern Siemens PLC making the system run more in line with Industry 4.0 standards. Wiring and programming carried out by a previous project was corrected and the system functions as intended with the potential for networking now possible.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "sean.hughes27@mail.dcu.ie",
            "name": "Sean Hughes"
        }
        ],
        "supervisor": "Paul.Young@dcu.ie",
        "technology": "Solidworks, PLC Programming",
        "title": "Development of Virtual Twin for the FMS Rig"
    },
    {
        "area": "Mobile App, Android",
        "description": "CineSkip is an app that provides the service of pre-purchasing cinema tickets and food for cinemas. It allows customers to receive electronic tickets in the form of a QR code, rather than having physical tickets. Once a user has pre-purchased food, they are then able to pre-order their selected food so that on arrival to the cinema, a user is able to skip the queues and collect their chosen food from a collection lane.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "keith.rooney6@mail.dcu.ie",
            "name": "Keith Rooney"
        },
        {
            "email": "paul.osullivan35@mail.dcu.ie",
            "name": "Paul O'Sullivan"
        }
        ],
        "supervisor": "Markus.Helfert@dcu.ie",
        "technology": "XML, NoSQL, Java",
        "title": "CineSkip"
    },
    {
        "area": "Internet of Things, RaspberryPi, Wearable Technology, Wireless Technology",
        "description": "A fitness application is developed in this project. The eZ430-Chronos, a programmable smart watch with on-board sensors, connects with a heart rate monitor wirelessly to collect and log sensor data. The smartwatch is reprogrammed to alert the user of dangerous sensor readings. A Graphical User Interface is designed on a Raspberry Pi using Python which gives the user the option to connect with the smart watch wirelessly to receive the logged data or analyse their logged data graphically.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "conor.egan38@mail.dcu.ie",
            "name": "Conor Egan"
        }
        ],
        "supervisor": "Martin.Collier@dcu.ie",
        "technology": "C/C++, Python",
        "title": "Smart Watch/Fitness Monitor"
    },
    {
        "area": "Computer Vision, Device Design, Gaming, Image Video Processing, OpticalCharacter Recognition, Software Development, 3-D Modelling, Circuit Modeling",
        "description": "This project entails the research and development of an Opto-Electronic shooting rig. The rig consists of a pistol which, when triggered emits a ray of infrared light towards a camera. The camera registers the light with which then C++ coding language along with OpenCV libraries are used to calibrate the pistol relative to the fixed position of the camera. A game is then developed using the calibrated data, after which the user's shooting skills can be evaluated.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "stanjol@yahoo.co.uk",
            "name": "StanIslav Jolondcovschi"
        }
        ],
        "supervisor": "Tamas.Szecsi@dcu.ie",
        "technology": "C/C++, Solidworks, OpenCV, DevC++",
        "title": "Opto-Electronic Shooting Rig"
    },
    {
        "area": "Data Analytics, Databases, Content Management System, Web Application",
        "description": "AALicenseManager is a web based application used to monitor and control the software licenses in an organisation. The application provides a platform on which the user can add, delete and update their software licenses easily and through the use of a wide range of reports, the user can monitor the compliance status of the organisation to ensure that they remain fully compliant with software license agreements.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "arran.farrell69@mail.dcu.ie",
            "name": "Arran Farrell"
        },
        {
            "email": "anita.okoye2@mail.dcu.ie",
            "name": "Anita Okoye"
        }
        ],
        "supervisor": "Gareth.Jones@dcu.ie",
        "technology": "SQL, PHP, JavaScript, HTML5, CSS",
        "title": "AALicenseManager"
    },
    {
        "area": "Web Application, 3-D Modelling, Graphics, Image Video Processing, SoftwareDevelopment",
        "description": "Being able to interact with 3D visualisations of tomographic data from CT and MRI scans is very help fulduring investigations by doctors. High-end workstations with special 3D graphics hardware are usually required to render large data sets. The key aim of this project is to create a 3D visualisation system that can be used to view large medical datasets on web browsers using X3DOM. With the added functionality of creating and applying transfer functions to the 3D model.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "jaya.kumar2@mail.dcu.ie",
            "name": "Jaya Kumar"
        }
        ],
        "supervisor": "Robert.Sadleir@dcu.ie",
        "technology": "Eclipse, HTML5, Java, JavaScript, JQuery, OpenGL, X3DOM, CSS",
        "title": "Development of a web-based volume rendering system using X3DOM"
    },
    {
        "area": "Graphics, Broadcast Software, Gaming",
        "description": "This project is a screen capture and media livestreaming application, capable of capturing video directly from the screen, as well as audio from a microphone, and encoding them into a format which is then broadcast to a livestreaming service such as Twitch.tv or Youtube. With a focus towards casual users or those in need of a lightweight solution, the application provides an accessible client for livestreaming purposes.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "daire.obruachail2@mail.dcu.ie",
            "name": "Daire O'Bruachail"
        }
        ],
        "supervisor": "Brian.Stone@dcu.ie",
        "technology": "C/C++",
        "title": "Screen Capture and Livestreaming Application"
    },
    {
        "area": "Finite Element Analysis, Mechanical Design and Manufacture",
        "description": "This project aims to finely adjust the wood router in two different directions by designing and manufacturing an attachment for wood milling router. The wood router attachment can be used to control the side and rotary movement of the router. Additionally, strength analysis was performed to determine whether the attachment withstands the weight of the router and identify the locations of maximum deformation and stress.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "ali.almakhmary2@mail.dcu.ie",
            "name": "Ali Al Makhmary"
        }
        ],
        "supervisor": "Tamas.Szecsi@dcu.ie",
        "technology": "ANSYS Workbench, Solidworks",
        "title": "Design and Manufacture of an Attachment for Wood Milling Router Tools"
    },
    {
        "area": "Android, Wireless Technology",
        "description": "The system that we designed is as an online smartwatch application and monitoring system. The system allows people to monitor the wearer through a wearable device that they will have on their wrist, which in turn will link to an application on the users phone. Users will be able to view information on the app in regards to the person wearing the watch, which will include a location tracker, their heart rate monitor, a impact/fall detector, geofencing, & scheduled alerts.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "james.mcdonald34@mail.dcu.ie",
            "name": "James McDonald"
        },
        {
            "email": "gavin.strong2@mail.dcu.ie",
            "name": "Gavin Strong"
        },
        {
            "email": "tuffy.jack2@mail.dcu.ie",
            "name": "Jack Tuffy"
        }
        ],
        "supervisor": "Jane.Kernan@dcu.ie",
        "technology": "CSS, HTML5, JavaScript",
        "title": "L.A.M.P"
    },
    {
        "area": "Mechanical Design and Manufacture, Simulation, Software Development",
        "description": "If a shape of a certain gear (cutting tool) is known, the shape of the other gear (gear blank) can be found by simulation. In this project, Solidworks API along with VBA are used to develop a code which functions to rotate the cutting tool about the gear blank in such a relative motion. The teeth contours resulting from rotating the cutting tool represent the volume that needs to be subtracted to produce teeth in gear blank.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "mohamed.alnaamani2@mail.dcu.ie",
            "name": "Mohamed Al-Naamani"
        }
        ],
        "supervisor": "Tamas.Szecs@dcu.ie",
        "technology": "Solidworks, Solidworks API and Visual Basic for Applications (VBA)",
        "title": "Simulation, Design and Manufacture of Non Circular Gears"
    },
    {
        "area": "Databases, Mobile App, Web Application",
        "description": "Eitlean Booking is a booking management web application for private flight lessons. It allows clients to book a date and pay for a lesson online. It also allows for the management of said bookings by flight training organisations (or FTOs) through user accounts, as well as providing their clients with an accessible and modern booking experience which which aims to improve the overall customer experience and increase customer retention levels.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "owen.matthews2@mail.dcu.ie",
            "name": "Owen Matthews"
        },
        {
            "email": "padraig.ocuircbolta2@mail.dcu.ie",
            "name": "Padraig O Cuirc"
        }
        ],
        "supervisor": "Jane.Kernan@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, Bootstrap",
        "title": "Eitlean Booking"
    },
    {
        "area": "Mechatronic Systems, Robotics, Simulation, Virtual Reality",
        "description": "This project contrasts the use of the Virtual Robot Experimentation Platform's (V-Rep's) native path planning calculation module against the use of an external API  the Open Motion Planning Library (OMPL)  and its integration through embedded scripts. The meticulous set up of the V-Rep environment was analysed. Rigorous testing was performed on the use of both methods for their ability to produce accurate and repeatable shortest path solutions from a start to target location in a specially designed test map.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "emmet.cullen27@mail.dcu.ie",
            "name": "Emmet Cullen"
        }
        ],
        "supervisor": "Jennifer.Bruton@dcu.ie",
        "technology": "C/C++, Lua, Virtual Robot Experimentation Platform, Open Motion Planning Library",
        "title": "Virtual Robot Experimentation Platform for Path Planning Investigation"
    },
    {
        "area": "Artificial Intelligence, Software Development, Databases",
        "description": "DCU Damo is a chat bot that answers DCU related queries. The bot specializes in queries related to Timetable information and Lecturer information. DCU Damo is accessed through it's Facebook page where it can be privately messaged with a query. The query is pulled from Facebook using node.js and is broken down by the bot. A java program was written to take the broken down query and format an accurate response for the user which is pushed back to Facebook.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "jordanmulvaney02@mail.dcu.ie",
            "name": "Jordan Mulvaney"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "Java, MySQL, Node.js",
        "title": "DCU Damo: Chat bot"
    },
    {
        "area": "Biomedical Engineering",
        "description": "Injectable bone cements are routinely used to stabilise fractures and for the fixation of implants to bone. Calcium phosphate based cement has good biocompatibility but poor mechanical properties compared to polymer based cement and is not currently used for load bearing applications such as vertebroplasties. The aim of this project is to improve fracture behaviour of CPC through incorporation of short fibres whilst retaining injectability. Similar techniques have been employed to improve the fracture behaviour of concrete.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "rebecca.guyett2@mail.dcu.ie",
            "name": "Rebecca Guyett"
        }
        ],
        "supervisor": "Nicholas.Dunne@dcu.ie",
        "technology": "Mechanical Analysis",
        "title": "Short fibre reinforced calcium phosphate bone cement"
    },
    {
        "area": "Android, Cloud Computing, Mobile App",
        "description": "This project consists of an app that tracks and stores the attendance data of students for individual classes. Using student ID barcode scanning for the identification of students, class check in slots are allocated based on the respective timetables allowing for simple check in via mobile device. Geo-location and time-stamping are used to confirm the validity of attendance, with the data gathered being intended for use by academic staff and analysis.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "lonneke.schutte2@mail.dcu.ie",
            "name": "Lonneke Schutte"
        }
        ],
        "supervisor": "Mark.Roantree@dcu.ie",
        "technology": "Java",
        "title": "Student Attendance Tracking"
    },
    {
        "area": "E-Commerce, Databases, Data Analytics, Mobile App",
        "description": "Swiped is an online virtual shopping centre, that provides fast, easy browsing and shopping by using swipe technology to browse items. Through machine learning it documents customer behaviour to more accurately recommend items to the customer and provide real time data analytics to the retailer based on their customer's likes, dislikes and spending patterns. Swiped provides benefits to both customer and retailer which sets it apart from competing apps.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "conor.marshall8@mail.dcu.ie",
            "name": "Conor Marshall"
        },
        {
            "email": "nathan.prendergast3@mail.dcu.ie",
            "name": "Nathan Prendergast"
        }
        ],
        "supervisor": "Andrew.McCarren@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, PHP",
        "title": "Swiped"
    },
    {
        "area": "Android",
        "description": "The project was developed to help my 4yr old child learn his letters and to store statistics on his letter writing development.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "darragh.lawlor27@mail.dcu.ie",
            "name": "Darragh Lawlor"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "Java",
        "title": "Letter Writing Checker"
    },
    {
        "area": "Software Development, Mobile App, GPS GIS, Databases, Cloud Computing, Android",
        "description": "Never-Lost allows users to share their location with friends and family. This application can be used when the user needs directions or wants their location to be monitored, for example if the user is on their way home at night. Users can create geofences, which are triggered on exit, when they expect to stay within an area for some time. Travel patterns can be recorded to predict the user's future trips as an aid for users living with Dementia.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "renatas.nedzveckas2@mail.dcu.ie",
            "name": "Renatas Nedzveckas"
        }
        ],
        "supervisor": "Donal.Fitzpatrick@dcu.ie",
        "technology": "Geofencing, Firebase Realtime Database, Room Persistence Library, Google Maps API, Android Studio, SQLite, Java",
        "title": "Never-Lost"
    },
    {
        "area": "Electric Generation",
        "description": "This project investigates the relative merits and trade-offs of both thermal (water heating) and electricity (Photovoltaic) along with energy storage methods, resulting in an online decision-support tool that allows potential users in Ireland of solar energy systems to explore the lifetime costs and benefits of such systems.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "rory.clear2@mail.dcu.ie",
            "name": "Rory Clear"
        }
        ],
        "supervisor": "Barry.McMullin@dcu.ie",
        "technology": "HTML5, Java, JavaScript, MySQL, Node.js",
        "title": "Modelling of Distributed Small Scale Solar Energy Systems"
    },
    {
        "area": "Control Systems, Fluid Mechanics",
        "description": "The purpose of this project is to design a lab scale pumping system with a focus on producing a steady flow. The system includes precision flow meters, pressure sensors and an electrovalve. The purpose of the electrovalve is to regulate the flow in case a transient disturbance occurs. The project investigates several alternative control loops to identify the optimal control of the system. The system is also theoretically analysed.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "niall.oconnor44@mail.dcu.ie",
            "name": "Niall O'Connor"
        }
        ],
        "supervisor": "Yan.Delaure@dcu.ie",
        "technology": "Excel/VB, LabVIEW, Solidworks",
        "title": "Design and control a new pumping system for steady flow"
    },
    {
        "area": "Web Application, Network Applications, Mobile App, Databases",
        "description": "An application available on both mobile and desktop platforms providing users with the capability to reserve available sports pitches and sports facilities as well as the capability to list additional pitches. This web app aims to provide a seamless approach to the steps involved in booking a pitch. A built in reservation and booking system is provided listing available time slots. The application also allows users to see their listed pitches and the reservations made for that particular user",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "andreas.poppmeier2@mail.dcu.ie",
            "name": "Andreas Poppmeier"
        },
        {
            "email": "conor.dolan26@mail.dcu.ie",
            "name": "Conor Dolan"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "REST, PHP, Node.js, MySQL, JQuery, JavaScript, HTML5, CSS",
        "title": "PitchBook - A service which allows users to book and manage sports pitches inthe form of a web application"
    },
    {
        "area": "Android, Artificial Intelligence, Cloud Computing, Data Analytics, Mobile App, Model View Controller, Natural Language Processing, Web Application",
        "description": "This web-based platform aims to provide FX and Cryptocurrency traders with several advantages over traditional exchange interfaces, allowing for more informed positions and subsequently, increased profit! These include: 1) Machine Learning price action predictions and Automatic Trading Algorithms 2) Automatic Candlestick Chart Technical / Time-series Analysis 3) Social media and order-book Sentiment Analysis 4) Data Analytics - Collection & Visualisation of Intra-day and Historical trade data 5) Notifications of potential buy/sell opportunities to an Android Application",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "ross.franey3@mail.dcu.ie",
            "name": "Ross Franey"
        }
        ],
        "supervisor": "Martin.Crane@dcu.ie",
        "technology": "AngularJS, CSS, HTML5, Java, JavaScript, JQuery, MySQL, NoSQL, Python, REST, Scilab, AWS, Django, chartJS, JSON REST, Keras, DynamoDB, Google Firebase, Scrapy",
        "title": "Braikout - Cryptocurrency & FX Trading Platform"
    },
    {
        "area": "Tissue Engineering, Fluid Mechanics",
        "description": "Engineered heart valves are an increasing area of interest in the medical world. Currently mechanical and biological heart valves are used as replacement techniques. The project assessed the properties of tissue engineered heart valves (TEHV) using alginate hydrogels. A test rig was designed to investigate the valves functionality, flow restriction and durability under physiological flow conditions. TEHV are the future for valve replacement as they may reduce the need for reoccurring surgeries, which would benefit younger patients.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "sean.curtis6@mail.dcu.ie",
            "name": "Sean Curtis"
        }
        ],
        "supervisor": "Tanya.Levingstone@dcu.ie",
        "technology": "LabVIEW",
        "title": "Development of test rig to assess the functional properties of tissue engineeredheart valves"
    },
    {
        "area": "Augmented Reality, Educational, Mobile App, Web Application",
        "description": "Maths AR is an augmented reality application that will enhance children's ability to understand concrete materials and represent them as pictorial objects. The maths tasks are based on the mathematics curriculum that teachers in Irish primary schools teach. Through the use of Apple's new Augmented Reality technology, lessons & challenges will be created to help children better understand the topic usingan Apple iPad. A web portal is created to help teachers track children's performance on individual topics.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "odhran.daly2@mail.dcu.ie",
            "name": "Odhran Daly"
        }
        ],
        "supervisor": "Monica.Ward@dcu.ie",
        "technology": "CSS, Objective-C, HTML5, JQuery, Node.js, NoSQL, Swift",
        "title": "Maths AR"
    },
    {
        "area": "Advanced Material Engineering",
        "description": "Nanoparticle colloids were made using pulsed laser ablation. The colloid samples were filtered through different sized filters to achieve specific sized nanoparticles in each colloid. The filtered colloid were then used in Uv-vis spectroscopy to determine the concentration of nanoparticles in the liquid. A comparison was then made between the concentration and size of the nanoparticles in the colloid before and after filtration.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "daniel.whitty2@mail.dcu.ie",
            "name": "Daniel Whitty"
        }
        ],
        "supervisor": "Dermot.Brabazon@dcu.ie",
        "technology": "Uv-vis spectroscopy",
        "title": "A comparison of results filtering nanoparticles manually and using Uv-VisSpectroscopy to determine the weight and size distributions of colloids"
    },
    {
        "area": "Android, Mobile App",
        "description": "This project allows users to automate or script certain task. The project has an API that is accessible through the JavaScript. This API allows users to manipulate their device. This project waits for system events, such as the device's battery is low on power, and executes any script associated with that event.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "mark.dunne54@mail.dcu.ie",
            "name": "Mark Dunne"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "Java, JavaScript",
        "title": "Functional Specification"
    },
    {
        "area": "Web Application, Security, E-Commerce",
        "description": "'Blocktract' is a platform that facilitates the instant transfer of funds in settling travel insurance contracts between two independent parties in a secure and efficient manner - focusing solely on flight delays and cancellations. The service is provided to insurance companies via an API implementation which operates on the 'Ethereum Blockchain' network and makes use of smart contracts to trigger payment events. These smart contracts are triggered using provided flight status API's from specified airlines.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "conor.henry23@mail.dcu.ie",
            "name": "Conor Henry"
        },
        {
            "email": "danny.ogallchoir3@mail.dcu.ie",
            "name": "Danny O Gallchoir"
        }
        ],
        "supervisor": "Alistair.Sutherland@dcu.ie",
        "technology": "Ajax",
        "title": "BlockTract"
    },
    {
        "area": "Web Application, Telecommunications, Software Development",
        "description": "The aim of project was to create a learning platform that allows 3rd level student to book private tutors that will assist them in learn a certain programming language. The app allows you to select the date and time that suits both parties using the fully integrated calendar, it also allows them to share a collaborative terminal between each other and last but not least the app has a full video and audio capabilities for the best user experience possible.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "igor.strelkov2@mail.dcu.ie",
            "name": "Igor Strelkov"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "Node.js, REST, CSS, HTML5, JavaScript, AngularJS, JQuery, MongoDB",
        "title": "TeachMeCode"
    },
    {
        "area": "Web Application",
        "description": "The web application is designed to allow users to get nutrition advice tailored to their needs. By entering some personal information like height, weight etc. and lifestyle information like the amount of physical activity they do per week, an individual profile is made for the user. Using that data provided the application calculates the recommended diet plan for the user and provides them with suitable recipes.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "kvetoslava.sliacanova2@mail.dcu.ie",
            "name": "Kvetoslava Sliacanova"
        }
        ],
        "supervisor": "Renaat.Verbruggen@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, Python, REST",
        "title": "Nutrition and Dieting web application."
    },
    {
        "area": "Additive Manufacturing, Device Design, Finite Element Analysis, MechanicalDesign and Manufacture",
        "description": "The purpose of this project is to redesign the electronic bass drum pedal. This is done by examining the downfalls of current electronic and acoustic bass drum pedals. An entirely new design is used to overcome these shortcomings. The final design incorporates an innovative single piece polymer hinge that bends about itself, instead of a mechanical hinge. The electronic output is comprised distance sensors to transduce the that is to be differentiated it to find the velocity of the hit.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "robin.blakey2@mail.dcu.ie",
            "name": "Robin Blakey"
        }
        ],
        "supervisor": "Alan.Kennedy@dcu.ie",
        "technology": "Solidworks, PLW Pico log",
        "title": "Electronic Bass Drum Design"
    },
    {
        "area": "Speech Recognition",
        "description": "This program takes a standard ebook file and speaks it out using a voice synthesizer. The program uses the structure and metadata of the file to create an easily navigable interface. The user uses voice commands or keyboard shortcuts to easily move back and forth in the book.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "murpc286@mail.dcu.ie",
            "name": "Ciaran Murphy"
        }
        ],
        "supervisor": "Donal.Fitzpatrick@dcu.ie",
        "technology": "Python",
        "title": "Ebook Reader"
    },
    {
        "area": "Arduino, Robotics",
        "description": "Soft Robotics is an area of robotics dealing with constructing robots from highly compliant materials, like those found in living organisms. Soft actuators that are made of elastomeric materials are a big area of interest in the robotics community lately because of their rapid prototyping capabilities and they have different abilities to that of the traditional robot. This initial investigation involved building a soft actuator and testing it to determine its capabilities for various levels of compressed air",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "liam.clarke37@mail.dcu.ie",
            "name": "Liam Clarke"
        }
        ],
        "supervisor": "Jeremiah.Murphy@dcu.ie",
        "technology": "Solidworks",
        "title": "Fibre Reinforced Actuators"
    },
    {
        "area": "Mechanical Design and Manufacture",
        "description": "Pneumatic Air Muscles are an area of increasingly popularity, especially in the design of humanoid robots. They offer a lightweight alternative to pneumatic cylinders. This project investigates the design methods of an air muscle and tests multiple air muscles to establish the reaction to different pressures. This project also involves the design and build of a device attachable to the human arm which is powered by a pneumaticair muscle.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "sean.rocks2@mail.dcu.ie",
            "name": "Sean Rocks"
        }
        ],
        "supervisor": "Jeremiah.Murphy@dcu.ie",
        "technology": "Solidworks",
        "title": "Design, Build and Testing of a Pneumatic Air Muscle"
    },
    {
        "area": "Natural Language Processing, Web Application, Data Analytics",
        "description": "This project involves a web application developed in the Python Flask framework that analyses user behaviour on social media based on gender studies. Using natural language processing and computational social science, user posts from Twitter and Redbrick are analysed for patterns in reply length, word-term frequency, argument relevance and progression of argument within a discussion. Insights into any disparity between the different genders in terms of the user behaviours mentioned are visualised through the web application.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "ina.pondoc2@mail.dcu.ie",
            "name": "Ina Mari Fe Pondoc"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "SQL, Python, REST",
        "title": "Social Media User Behaviour Analyser based on Gender Studies"
    },
    {
        "area": "Advanced Material Engineering",
        "description": "Calcium Phosphate Cements (CPC) have been used as a bone repair material successfully in surgical applications for many years. The biological properties and advantages of this material are well documented, however, their mechanical properties are not suitable for high loading areas of the body such as the spine. The aim of this project was to determine the effect of substituting Magnesium ions into CPC by analysing their mechanical and handling properties.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "niall.oshaughnessy4@mail.dcu.ie",
            "name": "Niall O'Shaughnessy"
        }
        ],
        "supervisor": "Nicholas.Dunne@dcu.ie",
        "technology": "Excel/VB",
        "title": "Ion Doped Calcium Phosphate Cement"
    },
    {
        "area": "DSP",
        "description": "This project is an analysis of a GPGPU working in a heterogeneous system, the GPUGPU acts as aco-processor in the system. The analysis is achieved using NVIDIA Tesla K40c graphics card and NVIDIAs parallel programming API CUDA. The aim is to implement a Parallel Fast Fourier Transform that takes aninput from the sound card of a PC and a RTL-SDR dongle and demonstrate it as a high resolutions spectral analysis tool.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "nathan.mindomba2@mail.dcu.ie",
            "name": "Nathan Mindomba"
        }
        ],
        "supervisor": "Conor.McArdle@dcu.ie",
        "technology": "DSP, Eclipse, Matlab, SDR  Software defined radio, CUDA, Fast FourierTransform, Java, C/C++",
        "title": "GPGPU Accelerated Spectral analysis"
    },
    {
        "area": "Databases, Web Application",
        "description": "Quoter is a website that is designed to make it easier for people to purchase insurance, mortgage protection and pensions from independent brokers in their area. The customer simply comes onto the website, enters some basic information that is then sold onto the independent brokers. The website also provides a service for the broker which allows them to manage the information that they have purchased by allowing them schedule meetings with customers and check and update their progress with customers.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "shane.farrelly55@mail.dcu.ie",
            "name": "Shane Farrelly"
        },
        {
            "email": "ian.mcevoy2@mail.dcu.ie",
            "name": "Ian McEvoy"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "CSS, HTML5, PHP, SQL",
        "title": "Quoter"
    },
    {
        "area": "Android, Data Analytics, Data Mining",
        "description": "This project aims to find cars that are being sold at a good price on the website cars ireland. ie. Using data scraped from the website, a predictive model was built. The model was then used to find cars that were being sold at good prices i.e. the selling price of the car was less than the value of the car. An android app acts as the front end of the project, allowing users to browse and value cars.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "glen.delvin4@mail.dcu.ie",
            "name": "Glen Devlin"
        }
        ],
        "supervisor": "Darragh.OBrien@dcu.ie",
        "technology": "Python, Java, MySQL",
        "title": "Car Dealer Spotter"
    },
    {
        "area": "Biomedical Engineering, Lean Manufacturing",
        "description": "Lean manufacturing target elimination of waste through continuous improvement. The problems of maintenance process are often addressed through loss elimination and continuous improvement programmes. The Preventive Maintenance enhances and improves the lean production only if it is applied properly in the industry. The project aims to develop simulation models that will help medical device companies to make the right decision regarding their maintenance strategy",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "haifa.asiri3@mail.dcu.ie",
            "name": "Haifa Asiri"
        }
        ],
        "supervisor": "John.Geraghty@dcu.ie",
        "technology": "ExtendSIM",
        "title": "Impact of Preventive Maintenance on Lean Manufacturing Productivity"
    },
    {
        "area": "3-D Modelling, Data Analytics, Data Mining",
        "description": "This project is a MATLAB program that takes datasets in CSV files as its input and outputs descriptive data summary of its columns along with their graphical representations. It also has a predictive modeling functionality where it can predict a possible relationship between these columns and output the percentage error of the produced function. The system is used by data analysts for the visualization of their datasets, researchers for easy GUI and usability, and by students as a learning tool.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "rahma.ahmed2@mail.dcu.ie",
            "name": "Rahma Ahmed"
        }
        ],
        "supervisor": "Alistair.Sutherland@dcu.ie",
        "technology": "Matlab",
        "title": "Visualize Dataset"
    },
    {
        "area": "Android, Artificial Intelligence, Computer Vision, Information Retrieval, Databases, Image Video Processing, Mechatronic Systems, Mobile App, Sensor Data, SoftwareDevelopment, Internet of Things",
        "description": "This project uses Google's TensorFlow machine learning library, trained with a mobile-optimised image classifier, to detect the user's food or ingredient. Once classified, the application retrieves the nutritional information of the food, from either local data or a RESTful database. Finally, the connected Bluetooth kitchen scale records the weight and sends this to the application for calculations. The application successfully simplifies the task of logging meals and reduces the time and effort required in current meal logging applications.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "luke.scales2@mail.dcu.ie",
            "name": "Luke Scales"
        }
        ],
        "supervisor": "Bryan.MacDonald@dcu.ie",
        "technology": "TensorFlow, XML, C/C++, Docker, Excel/VB, Java, Python, REST, SQLite",
        "title": "Android Application for Diet Management with Machine Learning, Image Classifier& IoT Device"
    },
    {
        "area": "Advanced Material Engineering, Biomedical Engineering, Mechanical Designand Manufacture",
        "description": "Bone cements have been used in bone augmentation, prosthesis fixations and facial reconstructions for decades. Calcium phosphate cements (CPC) are ideal for orthopaedic surgical practices, but are very brittle and thus not commonly used in load bearing applications. This project investigates the manufacturing of TTCP for the development of a tough CPC for vertebral compression fractures. Mechanical test methods were designed and used to characterise the strength and modulus of the material, while analysis was done to investigate its microstructure.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "niamh.murphy67@mail.dcu.ie",
            "name": "Niamh Murphy"
        }
        ],
        "supervisor": "Owen.Clarke@dcu.ie",
        "technology": "Solidworks",
        "title": "Development of a Tough Adhesive Calcium Phosphate Cement"
    },
    {
        "area": "Energy Conservation, Simulation, Water Treatment",
        "description": "Water treatment, including desalination, is becoming increasingly necessary to meet various water quality demands whether it be for potable, industrial, or agricultural use. Currently, one of the most widely used methods of desalination technology is Reverse Osmosis. This project investigates the process of Reverse Osmosis. The aim of this project is to simulate and test multiple Reverse Osmosis system configurations to try determine the most cost effective and energy efficient system.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "cian.brogan4@mail.dcu.ie",
            "name": "Cian Brogan"
        }
        ],
        "supervisor": "Lorna.Fitzsimons@dcu.ie",
        "technology": "Solidworks, Reverse Osmosis System Analysis",
        "title": "Control of Reverse Osmosis Fouling Mitigation"
    },
    {
        "area": "Water Treatment",
        "description": "This project investigates the design and operation of a hybrid membrane reverse osmosis for two specific water treatment plants. Both plants offer specific operating conditions that were assessed in the development the reverse osmosis system. Commercially available software, ROSA and IMSDesign, were used to develop and simulate various possible solutions, and from the resulting data, an optimum hybrid membrane reverse osmosis system was developed.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "oliver.hamilton2@mail.dcu.ie",
            "name": "Oliver Hamilton"
        }
        ],
        "supervisor": "Lorna.Fitzsimons@dcu.ie",
        "technology": "DOW ROSA, IMSDesign by Hydranautics",
        "title": "Hybrid Membrane Reverse Osmosis"
    },
    {
        "area": "Data Analytics, Mobile App, Wearable Technology, Web Application",
        "description": "HealthKick is a web app for mobile devices. It displays health metrics based on data collected by other health apps/sensors to provide the user with one singular view on their health, and gives the user the ability to compare different datasets. An additional function in HealthKick is the ability to compare sleep and activity data to calculate future activity performed by the user, based on a linear regression model.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "chris.horgan22@mail.dcu.ie",
            "name": "Chris Horgan"
        },
        {
            "email": "sarahjane.irwin4@mail.dcu.ie",
            "name": "Sarah-Jane Irwin"
        }
        ],
        "supervisor": "Alan.Smeaton@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, PHP, REST",
        "title": "HealthKick"
    },
    {
        "area": "Sensor Technology, Telecommunications",
        "description": "Radio astronomy is a modern science concerned with the mapping of celestial objects and space in general through radio frequency scanning methods rather than traditional visual methods. This project centres around the development of a basic radio telescope design, incorporating a software defined radio and a home-built feed horn among other components, which will be assembled and tested for its effectiveness in applications in the field of radio astronomy.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "eoin.morrissey26@mail.dcu.ie",
            "name": "Eoin Morrissey"
        }
        ],
        "supervisor": "Patrick.McNally@dcu.ie",
        "technology": "SDRuno",
        "title": "Design and Development of a Software Defined Radio-Based System for 21cmWavelength Radio Astronomy"
    },
    {
        "area": "Web Application, Cryptography",
        "description": "Electio is an e-voting dapp, (decentralized-application) that allows election administrators to deploy an electoral system of their specification and allow voters to vote securely and verifiably in elections. Electio is designed to remove the need for the centralized tallying of votes which is a major security flaw across many centralized e-voting systems. By using blockchain technology, Electio allows for greater transparency during the election process as the result is generated by everyone rather than the election authority.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "patrick.morris25@mail.dcu.ie",
            "name": "Patrick Morris"
        }
        ],
        "supervisor": "Geoff.Hamilton@dcu.ie",
        "technology": "Ethereum, Solidity, Web3. js, React, Redux, Truffle, Node.js, JavaScript, Java",
        "title": "Electio - Applications of Electoral Systems using the Ethereum Blockchain"
    },
    {
        "area": "Arduino, Fluid Mechanics, Mechanical Design and Manufacture, Thermodynamics",
        "description": "This project incorporates the study of Fluid Structure Interaction (FSI) and the use of a Stepper Motor programmed with Arduino Open Source Technology to allow Linear Motion within an Experimental Tank with Water. The Experimental Rig was designed with Solidworks for the specific use of Testing and Modeling Immersed Solids in Fluid Flow. FSI is an important tool in industries such as Aerospace, Power generation, and the Automotive Industry.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "cian.byrne229@mail.dcu.ie",
            "name": "Cian Byrne"
        }
        ],
        "supervisor": "Yan.Delaure@dcu.ie",
        "technology": "Solidworks",
        "title": "Test and Model the Interaction of Immersed Solids in Fluid Flow"
    },
    {
        "area": "Data Mining, Model View Controller, Software Development, Web Application",
        "description": "Bookworm is a .NET web application which allows you to review books, have a unique profile and gain insight into other books that you might be interested in. This insight is gained using a recommender system which makes use of a machine learning algorithm from an open-sourced tool called MyMediaLite. Its architectureis designed using 5 layers, with MVC making up the first three layers followed by a service layer and a repository layer which carry out all database interactions.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "simon.lowry5@mail.dcu.ie",
            "name": "Simon Lowry"
        }
        ],
        "supervisor": "Darragh.OBrien@dcu.ie",
        "technology": "Java, JavaScript, SQL, Entity Framework, NUnit, FakeItEasy, MVCBootstrapper, MyMediaLite, HTML5, CSS, C#, .NET",
        "title": "Bookworm"
    },
    {
        "area": "Artificial Intelligence, Computer Vision",
        "description": "Sending visual data to a cloud or server for centralized decision making can create bottlenecks in the networks processing. Convolutional neural networks (CNNs) process images through non-linear layers. Developed here is a technique for partitioning a CNN between an edge and host platform and an encoding technique for video data analysis. The encoding scheme uses lossy encoding which facilitates the trade-offbetween; decreasing the size of the data for a maximum 1% loss in the networks accuracy.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "kevin.bambrick2@mail.dcu.ie",
            "name": "Kevin Bambrick"
        }
        ],
        "supervisor": "Kevin.McGuinness@dcu.ie",
        "technology": "Python",
        "title": "Visual Feature Encoding & Transmission from Edge Devices"
    },
    {
        "area": "Databases, Data Analytics, Model View Controller, Simulation, Web Application",
        "description": "Understanding how trading strategies apply to cryptocurrencies is no easy feat. This web application allows users to configure and run simulations of numerous types of trading strategies using historical cryptocurrency prices and a graphical user interface. The application back-tests the strategies designed by the user on real data and presents them with a statistical summary of the performance and outcomes. The user can choose from multiple cryptocurrencies, fiat currencies and trading strategies.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "sean.sinnott4@mail.dcu.ie",
            "name": "Sean Sinnott"
        }
        ],
        "supervisor": "Andrew.McCarren@dcu.ie",
        "technology": "Python, JQuery, Node.js, MySQL, JavaScript, CSS, HTML5",
        "title": "Cryptocurrency Trading Strategy Dashboard"
    },
    {
        "area": "3-D Modelling, Fluid Mechanics, Motion Analysis, Simulation, Thermodynamics",
        "description": "The aim of this project is to successfully drive a reciprocating pump with minimal leakage There is to be a model built on Solidworks, that will be taken in to Ansys to be analysed on rigid body Dynamics, these results shall be compared with theoretical results, and only made if this comparison proves to have similar readings. The rig when built shall have the theoretical and Ansys results compared with the built rig using a tachometer.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "cathal.duggan23@mail.dcu.ie",
            "name": "Cathal Duggan"
        }
        ],
        "supervisor": "Yan.Delaure@dcu.ie",
        "technology": "ANSYS Workbench, Excel/VB, Solidworks",
        "title": "Design and build a test rig for the study of a reciprocating pump"
    },
    {
        "area": "3-D Modelling, Biomedical Engineering, Fluid Mechanics, Tissue Engineering",
        "description": "The goal of this project was to identify a viable heating solution that would be capable of heating a pressure vessel to a temperature above 31C and maintaining that temperature for a sustained period of time, in order to turn solid CO2 supercritical such that a dense but flowing substance is created. This would then diffuse into a polymer mould, the carbon dioxide then vented, and a cell scaffold left as the result.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "mark.heaney2@mail.dcu.ie",
            "name": "Mark Heaney"
        }
        ],
        "supervisor": "Garrett.McGuinness@dcu.ie",
        "technology": "ANSYS Workbench, Solidworks",
        "title": "The Manufacture of Porous Tissue Engineering Scaffolds using Supercritical Fluid"
    },
    {
        "area": "Control Systems, Mechatronic Systems",
        "description": "Control using inputs based on proportional, integral and differential (PID) error terms is used widely in industry and thus relevant when training engineers. In this project a simple test rig is developed and analysed to assess the benefits of this type of control. By consideration of the system behaviour, a virtual model has been designed which simulates the physical system closely. From results of experimental testing it is believed that this system would be suitable for undergraduate teaching purposes.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "damien.moorehead2@mail.dcu.ie",
            "name": "Damien Moorehead"
        }
        ],
        "supervisor": "Harold.Esmond@dcu.ie",
        "technology": "LabVIEW, Matlab, Simulink",
        "title": "A PID control rig to demonstrate the characteristics of proportional,integral and derivative control"
    },
    {
        "area": "Educational",
        "description": "The modern engineering profession deals with uncertainty. With incomplete data and often conflicting demands from clients and the general public. Engineers require skills in human relations and technical competence. This report will demonstrate why PBL (Project based learning) can act as a benefit to the current structure of the module: Operations research methods. Through social expectation, and the self-driven pressure to preform favourably. This report will demonstrate how for each fortnightly, student lead presentation, PBL forces each group member to become their best self.",
        "programme": "Manufacturing Engineering with Business",
        "students": [
        {
            "email": "Sharawn.ahaotusimelane2@mail.dcu.ie",
            "name": "Sharawn Ahaotu Simelane"
        }
        ],
        "supervisor": "John.Geragthy@dcu.ie",
        "technology": "Excel/VB",
        "title": "Development and testing of a Project Based Learning approach"
    },
    {
        "area": "Power Electronics",
        "description": "Chaos exists in switching converters with feedback control, and this nonlinear phenomenon deteriorates the performance of switching converters. Therefore, an effective way of controlling chaos is of great importance in engineering. In this investigation, there is a simulation and experimental study of methods of controlling chaos in the voltage-mode buck converter controlled by PWM (Pulse Width Modulation).",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "john.connolly57@mail.dcu.ie",
            "name": "John Connolly"
        }
        ],
        "supervisor": "Marissa.Condon@dcu.ie",
        "technology": "Matlab, Simulink, Pspice",
        "title": "Investigation into the existence and control of chaos in switching converters"
    },
    {
        "area": "Cryptography",
        "description": "The project involves the implementation of the Lightweight Encryption Device Block Cipher. Comparing different implementations of the same cipher to ascertain which implementation is the most efficient. Keeping the features of the cipher constant, the performance of each implementation of the cipher is compared against the other ones. All implementations are done using VHDL programming language. The simulations are done on Vivado Design Suite.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "neto.ukpong2@mail.dcu.ie",
            "name": "Neto Ukpong"
        }
        ],
        "supervisor": "Xiaojun.Wang@dcu.ie",
        "technology": "FPGA, VHDL",
        "title": "Efficient FPGA Implementation of the Lightweight LED Block Cipher"
    },
    {
        "area": "Biomedical Engineering, Device Design",
        "description": "This project is a development of the pyloric project: an implant for facilitating weight loss, for the company Trinitas. The project investigates the different variations of needle tips for penetration into stomach tissue. The project aims to find the 'ideal' needle tip for this process. The 'ideal' needle tip produces the least reaction force during insertion, and results in minimal deflection of the stomach tissue.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "aidan.jones22@mail.dcu.ie",
            "name": "Aidan Jones"
        }
        ],
        "supervisor": "Tanya.Levingstone@dcu.ie",
        "technology": "Excel/VB, Solidworks",
        "title": "Development of a device for the narrowing of the pylorus to help facilitateweight loss"
    },
    {
        "area": "Android",
        "description": "An Android Multi-player word game, which uses Google Play Game Services API to allow players to find and compete against opponents over the network. It uses a Trie data structure to efficiently store and find words.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "kevin.sweeney2@mail.dcu.ie",
            "name": "Kevin Sweeney"
        }
        ],
        "supervisor": "Darragh.OBrien@dcu.ie",
        "technology": "Java",
        "title": "Multiplayer Word Game"
    },
    {
        "area": "Android, Control Systems, Mechatronic Systems, Mobile App, Simulation, Software Development",
        "description": "This project concerns the control of a two wheeled self-balancing vehicle via smartphone. The purpose of the project is to provide DCU with an interesting model for display on opens days. It is to serve as a demonstration of control theory and its application using an everyday item all the while advertising the engineering skills and education gained by DCU students. This project involves mechanical and electronic design and manufacture, system modelling, controller design and implementation through app development.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "paul.queallygallagher2@mail.dcu.ie",
            "name": "Paul Queally Gallagher"
        }
        ],
        "supervisor": "Harold.Esmonde@dcu.ie",
        "technology": "Java, Matlab, Simulink, Solidworks",
        "title": "Self Balancing Two Wheeled Vehicle"
    },
    {
        "area": "Biomedical Engineering, Tissue Engineering",
        "description": "The project involved the development of fibre-gel composites with tissue-like mechanical properties. To achieve these features, flat composite specimens were developed by creating biomaterials composed of soft, hydrated matrix materials reinforced with electrospun fibres. This was achieved by combining electrospun PCL fibres with a PVA solution and subjecting both materials to freeze-thaw cycling to forma composite material. The resulting fibre-gel composites were mechanically tensile tested to determineis tissue-like mechanical properties were achieved.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "mark.oconnor23@mail.dcu.ie",
            "name": "Mark O Connor"
        }
        ],
        "supervisor": "Garrett.McGuinness@dcu.ie",
        "technology": "Excel/VB",
        "title": "Electrospinning of fibre-gel composites for future blood vessel applications"
    },
    {
        "area": "Cloud Computing, Distributed Systems, Network Applications",
        "description": "Heracles is a map-reduce framework designed for parallel data processing on a large scale. It is written in Rust and Go, and has a focus on an accessible API backed by an intuitive async implementation. It leverages existing technologies to provide reliability and scalability",
        "programme": "Computational Problem Solving and Software Development",
        "students": [
        {
            "email": "terence.bolt2@mail.dcu.ie",
            "name": "Terry Bolt"
        },
        {
            "email": "wojciech.bednarzak2@mail.dcu.ie",
            "name": "Wojciech Bednarzak"
        }
        ],
        "supervisor": "David.Gray@dcu.ie",
        "technology": "Docker, Go, Rust",
        "title": "Heracles"
    },
    {
        "area": "Android, Arduino, Mobile App",
        "description": "The goal of Delock is to give anyone the ability to rent or share their personal assets with others safely and securely. Delock is built on top of the Ethereum Blockchain, this gives an immutable record of all transaction on the system and removes the need for trust between users. Ethereums Smart Contracts give everyday objects the capacity to perform actions on the blockchain and serve as the brains of the objects allowing users to interact with and rent them.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "mark.mcadam4@mail.dcu.ie",
            "name": "Mark McAdam"
        }
        ],
        "supervisor": "David.Sinclair@dcu.ie",
        "technology": "C/C++, Java, Solidity",
        "title": "Delock decentralized rental system"
    },
    {
        "area": "Fluid Mechanics",
        "description": "The main objective of this project is to investigate how to decrease the bubble sizing in water streams to improve oxygen dissolution through mechanically mixing the stream while increasing the time at which the stream is passing the tank. The investigation will be based on a provided tank where the internal part of it will be designed in a way that would achieve the objectives.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "mohammed.aladawani2@mail.dcu.ie",
            "name": "Mohammed Hammed AL Adawani"
        }
        ],
        "supervisor": "Yan.Delaure@dcu.ie",
        "technology": "Solidworks, CFD",
        "title": "Microbubble generation for wastewater processing: Mixing Tank Design"
    },
    {
        "area": "Embedded Systems, DSP, Software Development",
        "description": "The aim of this project is to test the input/output limitations of the PYNQ-Z1 board through the use of a logic analyser and pattern generator built and run on the board. Using the PYNQ open source platform and the Logictools overlay that consists of programmable hardware blocks for Finite state machines, Boolean logic functions, trace analysers and digital pattern generators it is possible to program the programmable logic circuits for the FPGA through Python.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "jack.mcdonald29@mail.dcu.ie",
            "name": "Jack McDonald"
        }
        ],
        "supervisor": "Derek.Molloy@dcu.ie",
        "technology": "Python, FPGA",
        "title": "A PYNQ-based Logic Analyzer and Pattern Generator"
    },
    {
        "area": "Mobile App",
        "description": "This project is a Mobile Application for both iOS and Android. The basic concept revolves around promotional competitions and streamlining sharing them in App. An App that companies and other entrepreneurial individuals can pay to upload a competition for a period of time, people can download this, create an account / profiles and share to other sites to have a chance of winning. It is made specifically to be easy to use, browse and share. Winners are announced in App.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "ciaran.moylan3@mail.dcu.ie",
            "name": "Ciaran Moylan"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "CSS, HTML5",
        "title": "CompShare"
    },
    {
        "area": "Sensor Technology",
        "description": "The is capable of correcting for dependencies in ambient pressure, temperature and density from the International Standard Atmosphere (ISA) conditions of 1013hPa, 15 degrees Celsius and zero altitude. This was achieved by using a water-based manometer to calibrate a differential pressure sensor, which will, in turn, be used to calibrate the airspeed indicator. The calculation of a pressure altitude will be used to correct for the ISA dependencies.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "stephen.kenny37@mail.dcu.ie",
            "name": "Stephen Kenny"
        }
        ],
        "supervisor": "Noel.Murphy@dcu.ie",
        "technology": "C/C++",
        "title": "Aircraft Airspeed Indicator Tester"
    },
    {
        "area": "3-D Modelling, Finite Element Analysis, Fluid Mechanics, Simulation",
        "description": "Demonstrates and documents the process of creating a 1-Way Fluid Structure Interaction Problem using the ANSYS Workbench. The structural effects of multiple airflow speeds over an industry standard 1. 5MW 35mwind turbine blade are analysed. The deflection of the blade as well as the stresses induced for each airflow speed are found. Blade geometry is produced and modelled accurately to real world wind turbine blade, including multiple layers of composite materials with varying thicknesses along the length of the blade.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "alec.mcmahon36@mail.dcu.ie",
            "name": "Alec McMahon"
        }
        ],
        "supervisor": "Bryan.MacDonald@dcu.ie",
        "technology": "ANSYS Workbench, Solidworks",
        "title": "Modelling of Fluid Structure Interaction Problems using the ANSYS Workbench."
    },
    {
        "area": "Android, Databases, Information Retrieval, Mobile App, Web Application, Wireless Technology",
        "description": "This project streamlines the process of keeping attendance at events, such as college lectures /meetings. No more lists of names, places, or time wasted on taking attendance. A simple Tap-and-Go between mobile application and NFC tag, with minimal configuration necessary. Collected data is displayed on an organised web interface.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "amy.leitch2@mail.dcu.ie",
            "name": "Amy Leitch"
        }
        ],
        "supervisor": "Stephen.Blott@dcu.ie",
        "technology": "CSS, HTML5, Java, JavaScript, Firebase",
        "title": "HeadCount: An NFC Attendance Tracker"
    },
    {
        "area": "Artificial Intelligence",
        "description": "'MozAIrt' tackles the challenges of AI in art by attempting to compose music. It utilises novel methods of data representation to turn a collection of music into a dataset to train a neural network. Riding the wave of neural networks' renewed prominence in AI, 'MozAIrt' utilises the 'Long Short-TermMemory' model to retain information during its writing process, allowing it to 'remember' features throughout the output. This results in a song that has consistent and coherent themes and patterns throughout.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "sean.hutchinson5@mail.dcu.ie",
            "name": "Sean Hutchinson"
        }
        ],
        "supervisor": "Suzanne.Little@dcu.ie",
        "technology": "Python",
        "title": "'MozAIrt - Music Learning Neural Network'"
    },
    {
        "area": "Arduino, Control Systems, Mechatronic Systems, Sensor Data, Simulation",
        "description": "Rheometers are used to measure the dynamic mechanical behaviour of liquids and soft solids. Values obtained are highly sensitive to temperature. Therefore measurements are conducted under carefully controlled conditions. The Peltier's thermoelectric effect is used to provide cooling or heating as required in a squeeze film rheometer. An arduino uno and a h-bridge circuit are used to regulate power to the heat pump in response to a signal from a thermistor placed in close proximity to the sample under test.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "shane.bannon3@mail.dcu.ie",
            "name": "Shane Bannon"
        }
        ],
        "supervisor": "Harold.Esmonde@dcu.ie",
        "technology": "Matlab, Simulink, Solidworks",
        "title": "Thermal Control System"
    },
    {
        "area": "Web Application",
        "description": "Trouve is an area adviser, providing detailed analysis of an area to interested parties such as realtors and house hunters. The project aggregates data from multiple sources to allow the user to come the most informed opinion about the area. The data is wide ranging from primary demographic in an area, to amenities in the region, to number of Irish language speakers.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "eoin.magner3@mail.dcu.ie",
            "name": "Eoin Magner"
        }
        ],
        "supervisor": "Donal.Fitpatrick@dcu.ie",
        "technology": "REST, Elasticsearch, AngularJs/ReactJS",
        "title": "Trouve - Area Advisor"
    },
    {
        "area": "Biomedical Engineering",
        "description": "The aim of this project was to generate thoracolumbar burst fractures within synthetic and natural vertebrae samples using a drop-weight test method. This involves dropping a known weight from a specific height onto the sample. This technique attempts to re-create the dynamic conditions of a real life burst fracture, and the potential and kinetic energies necessary for fracture generation can be examined. Different types of fracture can then be classified according to established classification methods.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "oisin.carr4@mail.dcu.ie",
            "name": "Oisin Carr"
        }
        ],
        "supervisor": "Nicholas.Dunne@dcu.ie",
        "technology": "Solidworks",
        "title": "Experimental Dynamic Protocol for the Simulation of Spinal Burst Fractures"
    },
    {
        "area": "Software Development",
        "description": "My project is for the CoderDojo Foundation. This project migrates CoderDojo's Zen platform to become an OAuth provider allowing third-party applications access to CoderDojo's API on behalf of a registered CoderDojo user.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "suzanne.campbell25@mail.dcu.ie",
            "name": "Suzanne Campbell"
        }
        ],
        "supervisor": "Brian.Stone@dcu.ie",
        "technology": "CSS, Docker, Node.js, REST, MySQL, JavaScript, PostgreSQL, VueJS",
        "title": "CoderDojo Universal Login"
    },
    {
        "area": "Android, Mobile App, Wireless Technology",
        "description": "UniPay is a mobile payment system that has been developed to provide third level students across the country with a virtual wallet that allows them to store their payment card details on their smartphones and make smart and secure payments in retailers throughout the various third level campuses across Ireland.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "jack.ryan89@mail.dcu.ie",
            "name": "Jack Ryan"
        },
        {
            "email": "oran.lawton2@mail.dcu.ie",
            "name": "Oran Lawton"
        }
        ],
        "supervisor": "Paul.M.Clarke@dcu.ie",
        "technology": "Java, SQLite",
        "title": "UniPay"
    },
    {
        "area": "Wireless Technology, Mobile App, Statistical Analysis, Image Video Processing, Data Mining, Data Analytics, Android, Wearable Technology",
        "description": "The project has explored electroencephalographic (EEG) signals in alpha, beta, theta, delta and gammawave bands to determine levels of memorability so that it's users can redress forgetfulness. An Android application connects to a Muse brain-sensing and analyses states of memorability by presenting a user with a video. Moments of lost concentration which lead to forgetfulness are captured to provide the user with a reinforcement tool in the form of a personalized recap of the video.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "laura.araviciute2@mail.dcu.ie",
            "name": "Laura Araviciute"
        }
        ],
        "supervisor": "Alan.Smeaton@dcu.ie",
        "technology": "Excel/VB, Android SDK, Muse Brain Sensing Headband SDK, KNIME AnalyticsPlatform, Firebase, Java",
        "title": "Memorability Toolkit"
    },
    {
        "area": "Biomedical Engineering",
        "description": "This project explores the design of a novel device, which overcomes problems associated with delivery of Enduragel to cerebral aneurysms. The device must employ a porosity which restricts flow of Enduragel and allows flow of blood at a specific rate. A test was designed to measure the flow rate flux of solutions similar to blood and Enduragel through materials with predefined porosities. A range of porosities which meet the required flow rate flux criteria of blood and Enduragel were determined.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "jennifer.daly36@mail.dcu.ie",
            "name": "Jennifer Daly"
        }
        ],
        "supervisor": "Owen.Clarke@dcu.ie",
        "technology": "Excel/VB, Solidworks, Practical Fluid Flow Rig",
        "title": "Design of a Novel Medical Device to Aid the Delivery of Enduragel in theTreatment of Cerebral Aneurysms"
    },
    {
        "area": "Statistical Analysis, Web Application, Data Analytics, Natural Language Processing",
        "description": "This project attempts to make the hiring process for both employers and applicants easier. It is a job posting web application created with the Django web framework. The application will read an applicant's CV and return how qualified that person is for the applied role based on the requirements specified as well as predicting how well that person will perform in the role using machine learning. For applicants, they can upload their CV to see what job postings they match.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "daniel.osullivan42@mail.dcu.ie",
            "name": "Daniel O'Sullivan"
        }
        ],
        "supervisor": "Suzanne.Little@dcu.ie",
        "technology": "HTML5, JavaScript, JQuery, Python, SQL, Django Web Framework, CSS",
        "title": "Job Analytics"
    },
    {
        "area": "Natural Language Processing, Web Application",
        "description": "The DCU Personal Assistant Chat Bot is a web app designed with the purpose of aiding DCU students. The student will be able to ask the bot a question, the bot will utilize natural language processing methods to determine what the student is asking, and then respond with the appropriate information. This information will include but is not limited to the time of their next lecture and when their next bus will arrive.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "ian.kelly7@mail.dcu.ie",
            "name": "Ian Kelly"
        }
        ],
        "supervisor": "Gareth.Jones@dcu.ie",
        "technology": "JavaScript, Node.js, REST, Luis",
        "title": "DCU Personal Assistant Chat Bot"
    },
    {
        "area": "Biomedical Engineering, Device Design, Fluid Mechanics, 3-D Modelling",
        "description": "This project was taken in collaboration with Biosensia, a late stage, pre-commercial medical device start-up, and involves the design of a multiplexing disposable cartridge for use in their diagnostic platform, RapiPlex. The cartridge must be low cost, simple to manufacture and capable of testing for six different analytes simultaneously. Through the research and development of the cartridge, a design with a CV% value of less than 10% was achieved for the readings across the six strips.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "thomas.walsh47@mail.dcu.ie",
            "name": "Thomas Walsh"
        }
        ],
        "supervisor": "Brian.Corcoran@dcu.ie",
        "technology": "Solidworks",
        "title": "Design of a disposable cartridge for RapiPlex Diagnostic Reader capableof testing for six Analytes"
    },
    {
        "area": "Software Development, Android, Computer Vision, Mobile App, OpticalCharacter Recognition",
        "description": "MySpend enables users to monitor their spending patterns and aid budgeting. It is an android app that accurately extracts relevant data from receipts and invoices by efficiently storing and categorising this data to keep track of expenses on the go. MySpend analyses the retrieved data to help users to manage and plan how, when and where they spend their money.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "claireanne.macdonagh5@mail.dcu.ie",
            "name": "Claire-Anne MacDonagh"
        }
        ],
        "supervisor": "Ray.Walsh@dcu.ie",
        "technology": "XML, Java",
        "title": "MySpend"
    },
    {
        "area": "Mobile App, Intelligence Pattern Matching, Artificial Intelligence",
        "description": "This project is an app that allows the Rey-Osterrieth complex figure(ROCF) neuropsychological test to be taken on an iPad and scored automatically. The scoring is done by a convolutional neural network created with the TensorFlow framework and trained with copies of the test provided by Beaumont Hospital. The ROCF test involves reproducing a complex diagram and is used for a wide variety of patients. The goal is to reduce the time doctors spend manually marking paper copies of the test.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "jesse.balfe3@mail.dcu.ie",
            "name": "Jesse Balfe"
        }
        ],
        "supervisor": "Suzanne.Little@dcu.ie",
        "technology": "Python, Swift",
        "title": "Rey-Osterrieth Test for iPad"
    },
    {
        "area": "Web Applications",
        "description": "Searchee can be best described as a new electronic goods comparison search engine that tackles the issue of searching multiple sources for product and price comparison by combining them all on one website making it easier for the user. It adds the feature of location based results which not only save the user's time in receiving their product but gives local Irish retailers the advantage against online international websites.",
        "programme": "Enterprise Computing",
        "students": [
        {
            "email": "scott.dermondy3@mail.dcu.ie",
            "name": "Scott Dermondy"
        },
        {
            "email": "jordan.hughes27@mail.dcu.ie",
            "name": "Jordan Hughes"
        }
        ],
        "supervisor": "Jane.Kernan@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, MySQL, PHP, SQL",
        "title": "Searchee"
    },
    {
        "area": "Internet of Things",
        "description": "For many IOT applications it's desirable to collect environmental sensor data without power supply or network connection. The aim of this project is to develop a passive Near Field Communication (NFC) sensor which can be permanently installed in locations without power supply or network connection and then read periodically via an NFC-enabled smartphone Android application. The project will involve designing an NFC13MHz inductive loop circuit, a very low-power microcontroller with sensor hardware/software system, smartphone user-interface and NFC interface software.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "niall.quirke3@mail.dcu.ie",
            "name": "Niall Quirke"
        }
        ],
        "supervisor": "Conor.McArdle@dcu.ie",
        "technology": "C/C++, DSP",
        "title": "Passive NFC Environmental Sensor"
    },
    {
        "area": "Web Application, Cloud Computing, Artificial Intelligence, Natural LanguageProcessing",
        "description": "This project attempts to help users learning a language. It tracks and displays a user's day-to-day use of a language and the mistakes they make, and uses that data to assist the user by highlighting difficult words, suggesting improvements when typing and other things. As a bonus, it can guess a user's native language based on their writing in English. Data for the system is gathered using Metro, a data crowdsourcing platform also created by Rory outside of this project.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "rory@metro.exchange",
            "name": "Rory Byrne"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "HTML5, JavaScript, Python",
        "title": "LangAssist"
    },
    {
        "area": "Security, Image Video Processing, Computer Vision",
        "description": "The aim of the project is to generate privacy at source, i.e. The system will comprise of a simple intelligent computer vision system (e.g. based on the raspberry pi) connected to a standard camera. The aim is to automatically detect and apply privacy protection to all facial features captured at source using this device. The device must be capable of operating in real-time.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "radwan.duadu2@mail.dcu.ie",
            "name": "Radwan Duadu"
        }
        ],
        "supervisor": "Paul.Whelan@dcu.ie",
        "technology": "Python, opencv",
        "title": "Real-time 'privacy at source' computer vision system"
    },
    {
        "area": "3-D Modelling",
        "description": "This project looks at a proton exchange membrane fuel cell. The project is looking at the design of air flow plates to optimize the performance of the fuel cell. The project uses Solidworks to design the flow plates and ANSYS workbench to model the flow through the plates. The pressures and velocities of the flow through the plates are analysed to determine the optimum flow plate design.",
        "programme": "Mechanical and Manufacturing Engineering",
        "students": [
        {
            "email": "stephen.murphy295@mail.dcu.ie",
            "name": "Stephen Murphy"
        }
        ],
        "supervisor": "James.Carton@dcu.ie",
        "technology": "Solidworks, ANSYS Workbench",
        "title": "Air Flow Plate for a Hydrogen Fuel Cell"
    },
    {
        "area": "Data Analytics, Data Mining, Web Application",
        "description": "Bamboozle is a web application which is designed to provide a fraud detection service to users. It aims to detect whether product reviews and URLs are fraudulent or not. The application uses data mining classification techniques to classify the data submitted by users.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "niamh.byrne53@mail.dcu.ie",
            "name": "Niamh Byrne"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "CSS, Eclipse, HTML5, Java, JavaScript, WEKA",
        "title": "Bamboozle: Fraud Detection Web Application"
    },
    {
        "area": "3-D Modelling, Arduino, Virtual Reality",
        "description": "The Unity Game Engine provides powerful and well-supported Virtual Reality viewing modes. Solidworks is a well-known computer aided design software for the development and prototyping of mechanical parts and assemblies. The purpose of this project is to design a virtual reality interface for assemblies generated with Solidworks to create a realistic representation of prototypes. Interaction with the virtual objects is completed with the Arduino microcontroller giving the user the ability to control the virtual object.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "bruce.davidson2@mail.dcu.ie",
            "name": "Bruce Davidson"
        }
        ],
        "supervisor": "Noel.Murphy@dcu.ie",
        "technology": ".NET, C#, Solidworks, Unity",
        "title": "Design of a Virtual Reality Interface to Solidworks using the Unity Game Engine"
    },
    {
        "area": "Gaming, Software Development",
        "description": "Quest is a top-down exploration game, with emphasis on adventure, puzzle solving and getting through obstacles in the player's way. It has been developed for the Windows platform using C# within the Unity game engine. The player follows the story to finish quests in a rogue-like manner to discover more about the world and people around them.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "triona.barrow2@mail.dcu.ie",
            "name": "Triona Barrow"
        }
        ],
        "supervisor": "Renaat.Verbruggen@dcu.ie",
        "technology": "C#, Unity",
        "title": "Quest"
    },
    {
        "area": "Automation, Lean Manufacturing, Mechatronic Systems, Robotics, ComputerVision, Image Video Processing",
        "description": "The project involves the use of a robotic manipulator and a camera to develop an intelligent automation system which performs automated packing. This is achieved by capturing an image scene, using image processing and analysis tools to decide the position of each item within the presented packing region fora space efficient result, sending the information to a microcontroller to control a robotic manipulator and taking images between packing each item for real-time feedback.",
        "programme": "Mechatronic Engineering",
        "students": [
        {
            "email": "osama.hammad2@mail.dcu.ie",
            "name": "Osama Hammad"
        }
        ],
        "supervisor": "Paul.Whelan@dcu.ie",
        "technology": "C/C++, Matlab",
        "title": "Robotic Vision-Controlled Automated Packing System"
    },
    {
        "area": "Power Electronics",
        "description": "The most common Photovoltaic (PV) cells consist of silicon PN junction devices which transform solar radiation energy into electrical energy. A related phenomenon, called electroluminescence (EL), occurs when the PN junctions are forward biased and the generated electron-hole pairs recombine to emit light. The project investigates the use of simple webcams for monitoring and mapping the EL behaviour of PV cells and correlating these EL maps with electronic measurements such as open-circuit voltage and short-circuit current data at various temperatures.",
        "programme": "Electronic and Computer Engineering",
        "students": [
        {
            "email": "shatha.alsiyabi2@mail.dcu.ie",
            "name": "Shatha Al Siyabi"
        }
        ],
        "supervisor": "Patrick.McNally@dcu.ie",
        "technology": "Scientific/engineering measurements and instrumentation design",
        "title": "Electroluminescence and Efficiency Measurements in Photovoltaic Cells"
    },
    {
        "area": "Statistical Analysis, Software Development, Data Mining, Data Analytics",
        "description": "The goal of the project is to perform statistical analysis on the price history of Magic The Gathering trading cards to see if there are any existing trends which can be used to predict the price of cards in the future. The project consists of a website which provides a nice user experience to search and view price predictions of MTG cards, as well as a report of the statistical analysis findings.",
        "programme": "Computer Applications",
        "students": [
        {
            "email": "conor.smyth44@mail.dcu.ie",
            "name": "Conor Smyth"
        }
        ],
        "supervisor": "Martin.Crane@dcu.ie",
        "technology": "CSS, HTML5, JavaScript, Python",
        "title": "Magic Card Price Predictor"
    },
    {
        "area": "Device Design, Biomedical Engineering, Additive Manufacturing",
        "description": "Spirometry is a crucial pulmonary function test used for the diagnosis and monitoring of respiratory diseases such as COPD and asthma. However, the key component of a Spirometry test, the spirometer, is an expensive piece of equipment and diseases such as COPD are particularly prevalent in poorer, developing countries. Therefore, for this project a low-cost spirometer was designed and manufactured using 3D-printing technology.",
        "programme": "Biomedical Engineering",
        "students": [
        {
            "email": "eoghan.hamill2@mail.dcu.ie",
            "name": "Eoghan Hamill"
        }
        ],
        "supervisor": "Tanya.Levingstone@dcu.ie",
        "technology": "LabVIEW, Solidworks",
        "title": "The Design of a Low-Cost Spirometer for use in Monitoring Respiratory Diseases"
    },
    {
        "area": "Artificial Intelligence, Software Development",
        "description": "Skynet is a neural network framework which creates multi-layer perceptrons and convolutional neural networks along with a website which can create, run and visualize the performance of created models. The networks can be run on common problems and datasets such as digit recognition with MNIST and sentiment analysis with IMDb movie reviews. The core of Skynet is written in Java, with some GPU optimizations in OpenCL. The site was created with Ember.js with communication handled by Jersey/Jackson.",
        "programme": "Computational Problem Solving and Software Development",
        "students": [
        {
            "email": "conor.flynn38@mail.dcu.ie",
            "name": "Conor Flynn and Jack Smith"
        },
        {
            "email": "sean.healy33@mail.dcu.ie",
            "name": "Sean Healy and Mladen Kajic"
        },
        {
            "email": "conor.mcmanus242@mail.dcu.ie",
            "name": "Conor McManus"
        }
        ],
        "supervisor": "Jennifer.Foster@dcu.ie",
        "technology": "Java, JavaScript",
        "title": "Skynet"
    },
    {
        "area": "Optical Communications",
        "description": "The aim of the project was to design a simulator of an electro-optical modulator based on a diode using Matlab. To achieve this project, I decided to use a 1D drift-diffusion model to simulate the behaviour of a pn junction. It was decided to choose the LU decomposition as numerical method, and the Scharfetter-Gummel discretization. At the end, I was able to design the simulator at the equilibrium, but problems were identified concerning the application of a voltage at the anode of the pn junction.",
        "programme": "Study Abroad (Engineering & Computing)",
        "students": [
        {
            "email": "tom.pellein2@mail.dcu.ie",
            "name": "Tom Pellein"
        }
        ],
        "supervisor": "Pascal.Landais@dcu.ie",
        "technology": "Matlab",
        "title": "Advanced design & analysis of an Si-based modulator"
    },
    {
        "area": "Optical Communications, Digital Signal Processing",
        "description": "The main goal of this project is the detection of trace-gas molecules in real world applications with the purpose of improving detection sensitivity in the part per billion range. Moreover, it is necessary to identify a few different wavelengths bands of interest, simulate with VPI to develop dual-comb architectures a suitable receiver and referencing circuit designs, implement DSP to enhance the sensitivity and the final classification of the gas species and finally compare the sensitivity improvement against standard techniques such as CE spectroscopy and FTIR.",
        "programme": "Study Abroad (Engineering & Computing)",
        "students": [
        {
            "email": "alejandro.jaimezgarcia2@mail.dcu.ie",
            "name": "Alejandro Jaimez Garcia"
        }
        ],
        "supervisor": "Prince.Anandarajah@dcu.ie",
        "technology": "Other - VPI, Digital Signal Processing",
        "title": "Detection of trace-gas molecules using an optical dual comb architecture"
    },
    {
        "area": "Artificial Intelligence, Natural Language Processing, Speech Recognition,",
        "description": "The focus of this project is speech recognition, more specifically in 'large vocabulary continuous speech recognition' (LVCSR). The problem addressed in this project is building a system that can transcribe speech from a wide variety of videos (news, interviews, sports, etc.) using information from the context of these videos. A Deep Speech Recurrent Neural Network is fine-tuned, the context is extracted from videos, language model training is carried out and a Beam Search decoder is used for final implementation checking.",
        "programme": "Study Abroad (Engineering & Computing)",
        "students": [
        {
            "email": "alejandro.woodward3@mail.dcu.ie",
            "name": "Alejandro Woodward"
        }
        ],
        "supervisor": "Kevin.McGuinness@dcu.ie",
        "technology": "Other",
        "title": "Contextual information for speech recognition"
    },
    {
        "area": "Information retrieval",
        "description": "This project focusses on one of the life log tasks purpose by LSC (lifelog Search Challenge). These core tasks aim to advance the state-of-the-art research in life logging as an application of information retrieval. This project uses LSC data that consists of at least 4 weeks of data from two active lifeloggers. The development identifies different elements of an image and is able to identify what the image is about. A diary is constructed from the information.",
        "programme": "Study Abroad (Engineering & Computing)",
        "students": [
        {
            "email": "adria.alsinatorra2@mail.dcu.ie",
            "name": "Adria Alsinatorra"
        }
        ],
        "supervisor": "Cathal.Gurrin@dcu.ie",
        "technology": "Matlab, Python",
        "title": "Narrative Clip"
    },
    {
        "area": "Artificial Intelligence, Image Processing",
        "description": "The focus of this project is image processing on iSUN datasets so that the saliency model's performance is improved. Initially examples of images are identified where fixation's time and order seem important. A deep learning model, implemented in Python, (MLNet) is used to improve an existing model trained for saliency prediction by adding temporal information. A new metric is created and applied to evaluate the new model's predictions.",
        "programme": "Study Abroad (Engineering & Computing)",
        "students": [
        {
            "email": "marta.collpoll2@mail.dcu.ie",
            "name": "Marta Coll Poll"
        }
        ],
        "supervisor": "Kevin.McGuinness@dcu.ie",
        "technology": "Other",
        "title": "An investigation into the importance of time and order in the evaluation of visual attention models"
    }
    ]
